///////////////////////////////////////////////////////////////////////////////
// 消費税申告書用　新ヘッダ－	(SINDEF2.H)
#define		ushort		unsigned short
#define		uchar		unsigned char

#pragma pack( push, 2 )

// 簡易課税及一般 本表用
struct	_SHIN {
							//		（ 課税標準額等 ）
	char	shin1[6],		//   1.	課税標準額
			shin2[6],		//   2.	消費税合計    ( 4 + 5 )	
			shin3[6],		//   3.	貸倒回収に係る税額 （控除過大調整税額）
							// 		（ 控除税額 ）
			shin4[6],		//   4.	控除対象仕入税額
			shin5[6],		// 	 5.	返還等対価に係る税額
			shin6[6],		//   6.	貸倒れに係る税額
			shin7[6],		//   7.	控除税額小計		( 4 + 5 + 6 )
			shin8[6],		//   8.	控除不足還付税額	( 7 - 2 - 3 )
			shin9[6],		//   9.	差引税額			( 2 + 3 - 7 )
			shin10[6],		//  10.	中間納付税額
			shin11[6],		//  11.	納付税額    ( 9 - 10 )
			shin12[6],		//  12.	中間納付還付税額    ( 10 - 9 )
							//		（ 修正申告 ）
			shin13[6],		//  13.	既確定税額
			shin14[6],		//  14.	差引納付税額  ( 11 - 14 )
			shin15[6],		//  15.	この課税期間の課税売上高 （課税売上高）
			shin16[6];		//  16.	総売上高（一般用のみ）
							//		（ 地方消費税の計算用 ）
	char	shin17[6],		//  17.	控除不足還付税額
			shin18[6],		//  18.	差引税額
			shin19[6],		//  19.	譲渡割額還付額
			shin20[6],		//  20.	譲渡割額納税額
			shin21[6],		//  21.	中間納付譲渡割額
			shin22[6],		//  22.	納付譲渡割額	（ 20 - 21 ）
			shin23[6],		//  23.	中間還付譲渡割額（ 21 - 20 
			shin24[6],		//  24.	修正申告・既確定譲渡割額
			shin25[6],		//  25.	修正申告・差引納付譲渡割額
			shin26[6];		//  26.	消費税額・地方消費税額の合計税額
};

///////////////////////////////////////////////////////////////////////////////
// 付表１及び４用
struct	_F1 {
							//		（ 課税標準額 ）
	char	F11B[6],		//  1.B 課税標準額(税率4%分)
			F12A[6],		//  2.A 　　〃　　(旧税率分)
			F13C[6],		//  3.C 　　〃　　計
			F14B[6],		//  4.B 消費税額  (税率4%分)
			F15A[6],		//	5.A  　〃　　 (旧税率分)
			F16C[6],		//	6.C 消費税額計(合計)
			F17A[6],		//  7.A 控除過大調整税額(旧税率分)
			F17B[6],		//	7.B 　　 　〃　　 　(税率4%分)
			F17C[6],		//  7.C 　　　 〃　　　     計
			F18A[6],		//	8.A 控除対象仕入税額(旧税率分)
			F18B[6],		//	8.B  　　　〃　　 　(税率4%分)
			F18C[6],		//	8.C  　　　〃　　 　(合計分)
			F19A[6],		//  9.A 返還等対価に係る税額(旧税率分)
			F19B[6],		//	9.B 　　 　  〃  　　 　(税率4%分)
			F19C[6],		//	9.C 　　 　  〃  　　 　(合計分)
			F110A[6],		// 10.A 貸倒に係る税額(旧税率分)
			F110B[6],		// 10.B 　　  〃　　  (税率4%分)
			F110C[6],		// 10.C 　　  〃　　  (合計)
			F111A[6],		// 11.A 控除税額小計(旧税率分)
			F111B[6],		// 11.B 控除税額小計(税率4%分)
			F111C[6],		// 11.C 控除税額小計(合計)
			F112A[6],		// 12.A 控除不足税額(旧税率分)
			F112B[6],		// 12.B 控除不足税額(税率4%分)
			F112C[6],		// 12.C 控除不足税額(合計)
			F113A[6],		// 13.A 差引税額(旧税率分)
			F113B[6],		// 13.B 差引税額(税率4%分)
			F113C[6],		// 13.C 差引税額(合計)
			F114C[6];		// 14.C 合計差引税額
};

///////////////////////////////////////////////////////////////////////////////
// 付表２ 及び ２-(2)用
struct	_F2 {
	char	F21A[6],		//  1. 課税売上額
			F21B[6],		//  1. 課税売上額
			F22A[6],		//  2. 免税売上額
			F22B[6],		//  2. 免税売上額
			F23A[6],		//  3. 非課税資産の輸出金額
			F23B[6],		//  3. 非課税資産の輸出金額
			F24C[6],		//  4. 課税資産の譲渡等の対価の額
			F26A[6],		//	6. 非課税売上額
			F26B[6],		//	6. 非課税売上額	
			F27C[6],		//  7. 資産の譲渡等の対価の額
			F28A[6],		//	8. 課税仕入に係る支払対価の額
			F28B[6],		//	8. 課税仕入に係る支払対価の額
			F29A[6],		//	9. 課税仕入に係る消費税額
			F29B[6],		//	9. 課税仕入に係る消費税額
			F210A[6],		// 10. 課税貨物に係る支払対価の額
			F210B[6],		// 10. 課税貨物に係る支払対価の額
			F211A[6],		// 11. 課税貨物に係る消費税額
			F211B[6],		// 11. 課税貨物に係る消費税額
			F212A[6],		// 12. 調整税額
			F212B[6],		// 12. 調整税額
			F213A[6],		// 13. 課税仕入等の税額の合計額
			F213B[6],		// 13. 課税仕入等の税額の合計額
			F215A[6],		// 15. 課税売上に係る仕入税額
			F215B[6],		// 15. 課税売上に係る仕入税額
			F216A[6],		// 16. 共通の売上に係る仕入税額
			F216B[6],		// 16. 共通の売上に係る仕入税額
			F217A[6],		// 17. 個別対応方式控除仕入税額
			F217B[6],		// 17. 個別対応方式控除仕入税額
			F218A[6],		// 18. 比例配分方式控除仕入税額
			F218B[6],		// 18. 比例配分方式控除仕入税額	
			F219A[6],		// 19. 調整対象固定資産に係る調整税額
			F219B[6],		// 19. 調整対象固定資産に係る調整税額
			F220A[6],		// 20. 　　　〃　　　を課税業務用に転用した調整額
			F220B[6],		// 20. 　　　〃　　　を課税業務用に転用した調整額
			F221A[6],		// 21. 差引控除対象仕入税額
			F221B[6],		// 21. 差引控除対象仕入税額
			F222A[6],		// 22. 差引控除過大調整税額
			F222B[6],		// 22. 差引控除過大調整税額
			F223A[6],		// 23. 貸倒回収に係る消費税額
			F223B[6];		// 23. 貸倒回収に係る消費税額
	ushort	F2UWS;			//     課税売上割合
};

///////////////////////////////////////////////////////////////////////////////
// 付表５ 及び ５-(2)用
struct	_F5 {
	char	F51T[6],		//  1. 課税標準額に対する消費税額（期間計）
			F51B[6],		//  1. 　　　　　　〃　　　　　　（4%分）
			F52T[6],		//  2. 貸倒回収額に対する消費税額（期間計）
			F52B[6],		//  2. 　　　　　　〃　　　　　　（4%分）
			F53T[6],		//  3. 売上対価の返還等に係る消費税額（期間計）
			F53B[6],		//  3. 　　　　　　〃　　　　　　　　（4%分）
			F54T[6],		//  4. 控除対象仕入税額計算の為の消費税額(期間計)
			F54B[6],		//	4. 　　　　　　　　〃　　　　　　　　(4%分)
			F55T[6],		//	5. 単一事業の場合の控除対象仕入税額(期間計)
			F55B[6],		//  5. 　　　　　　　　〃　　　　　　　(4%分)
			F56T[6],		//	6. 事業別課税売上高合計（期間計）
			F56B[6],		//	6. 　　　　　〃　　　　（4%分）	
			F57T[6],		//	7. 事業別課税売上高･第一種（期間計）
			F57B[6],		//	7. 　　　　　〃　　　　　 （4%分）
			F58T[6],		//	8. 事業別課税売上高･第二種（期間計）
			F58B[6],		//	8. 　　　　　〃　　　　　 （4%分）
			F59T[6],		//	9. 事業別課税売上高･第三種（期間計）
			F59B[6],		//	9. 　　　　　〃　　　　　 （4%分）
			F510T[6],		// 10. 事業別課税売上高･第四種（期間計）
			F510B[6],		// 10. 　　　　　〃　　　　　 （4%分）
			F511T[6],		// 11. 事業別課税売上高･第五種（期間計）
			F511B[6],		// 11. 　　　　　〃　　　　　 （4%分）
			F512T[6],		// 12. 事業別課税売上に係る消費税額合計(期間計)	
			F512B[6],		// 12. 　　　　　　　　〃　　　　　　　(4%分)
			F513T[6],		// 13. 事業別課税売上に係消費税額･第一種(期間計)
			F513B[6],		// 13. 　　　　　　　　〃　　　　　	　　(4%分)
			F514T[6],		// 14. 事業別課税売上に係消費税額･第二種(期間計)
			F514B[6],		// 14. 　　　　　　　　〃　　　　　	　　(4%分)
			F515T[6],		// 15. 事業別課税売上に係消費税額･第三種(期間計)
			F515B[6],		// 15. 　　　　　　　　〃　　　　　	　　(4%分)
			F516T[6],		// 16. 事業別課税売上に係消費税額･第四種(期間計)
			F516B[6],		// 16. 　　　　　　　　〃　　　　　	　　(4%分)
			F517T[6],		// 17. 事業別課税売上に係消費税額･第五種(期間計)
			F517B[6],		// 17. 　　　　　　　　〃　　　　　	　　(4%分)
			F518T[6],		// 18. 原則計算適用･合計 仕入税額（期間計）
			F518B[6],		// 18. 　　　　　　　 〃　　　　  （4%分）
			F519T[6],		// 19. 特例適用･合計 仕入税額（期間計）	
			F519B[6],		// 19. 　　　　　　　　〃　　  (4%分)	
			SZsw,
			SBsw,
			CQsw,
			GKsw;
	ushort	F51UPb,			// 課税売上割合・第一種	(4%分)
			F52UPb,			// 課税売上割合・第二種	(4%分)
			F53UPb,			// 課税売上割合・第三種	(4%分)
			F54UPb,			// 課税売上割合・第四種	(4%分)
			F55UPb;			// 課税売上割合・第五種	(4%分)
};

///////////////////////////////////////////////////////////////////////////////
// 付表３用
struct	_F3 {
	char	F31[6],			//  1. 限界控除前の税額
			F32[6],			//  2. 限界控除税額
			F33[6],			//  3. 差引税額
			F34[6],			//  4. 地方消費税・課税標準の基礎金額
			F35[6],			//	5.  　 〃　　  限界控除税額相当額
			F36[6],			//	6.     〃　　　課税標準となる消費税額
			KAURI[6],		//	課税売上高
			JOGEN[6],		//	限界控除適用上限
			SAGAK[6],		//	限界控除適用上限－下限
			GEN_A[6],		//	現行法による限界控除税額
			GEN_B[6],		//	改正法による限界控除税額
			Fmon1,			//	限界控除特例適用日前の月数
			Fmon2,			//	限界控除特例適用日後の月数
			Fmon3,			//	平成９年４月以後の月数
			Fdmy;
};

#pragma pack( pop )
