#pragma	once

#define	ID220 56	// 1行目　内容
#define	ID221 57	// 1行目　課税仕入等に係る特定収入４％
#define	ID222 58	// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID223 59	// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID224 60	// 1行目　課税仕入等に係る特定収入６．３％
#define	ID225 61	// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID226 62	// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID227 63	// 2行目　内容
#define	ID228 64	// 2行目　課税仕入等に係る特定収入４％
#define	ID229 65	// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2210 66	// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2211 67	// 2行目　課税仕入等に係る特定収入６．３％
#define	ID2212 68	// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2213 69	// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2214 70	// 3行目　内容
#define	ID2215 71	// 3行目　課税仕入等に係る特定収入４％
#define	ID2216 72	// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2217 73	// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2218 74	// 3行目　課税仕入等に係る特定収入６．３％
#define	ID2219 75	// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2220 76	// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2221 77	// 4行目　内容
#define	ID2222 78	// 4行目　課税仕入等に係る特定収入４％
#define	ID2223 79	// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2224 80	// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2225 81	// 4行目　課税仕入等に係る特定収入６．３％
#define	ID2226 82	// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2227 83	// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2228 84	// 5行目　内容
#define	ID2229 85	// 5行目　課税仕入等に係る特定収入４％
#define	ID2230 86	// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2231 87	// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2232 88	// 5行目　課税仕入等に係る特定収入６．３％
#define	ID2233 89	// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2234 90	// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2235 91	// 6行目　内容
#define	ID2236 92	// 6行目　課税仕入等に係る特定収入４％
#define	ID2237 93	// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2238 94	// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2239 95	// 6行目　課税仕入等に係る特定収入６．３％
#define	ID2240 96	// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2241 97	// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2242 98	// 7行目　内容
#define	ID2243 99	// 7行目　課税仕入等に係る特定収入４％
#define	ID2244 100	// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2245 101	// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2246 102	// 7行目　課税仕入等に係る特定収入６．３％
#define	ID2247 103	// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2248 104	// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	KEI221 8	//課税仕入等に係る特定収入４％　 合計
#define	KEI222 9	//課税売上にのみ要する課税仕入れ等に特定されている特定収入　E 合計
#define	KEI223 10	//課税売上にのみ要する課税仕入れ等に特定されている特定収入　F 合計
#define	KEI224 11	//課税仕入等に係る特定収入6.3％　 合計
#define	KEI225 12	//課税売上にのみ要する課税仕入れ等に特定されている特定収入　G 合計
#define	KEI226 13	//課税売上にのみ要する課税仕入れ等に特定されている特定収入　H 合計


SH_ITEMINDEX	Specific22Keika[]	=	{
	{	ID222,	0, 1, 0		},
	{	ID223,	0, 1, 0		},
	{	ID225,	0, 1, 0		},
	{	ID226,	0, 1, 0		},

	{	ID229,	0, 1, 0		},
	{	ID2210,	0, 1, 0		},
	{	ID2212,	0, 1, 0		},
	{	ID2213,	0, 1, 0		},

	{	ID2216,	0, 1, 0		},
	{	ID2217,	0, 1, 0		},
	{	ID2219,	0, 1, 0		},
	{	ID2220,	0, 1, 0		},

	{	ID2223,	0, 1, 0		},
	{	ID2224,	0, 1, 0		},
	{	ID2226,	0, 1, 0		},
	{	ID2227,	0, 1, 0		},

	{	ID2230,	0, 1, 0		},
	{	ID2231,	0, 1, 0		},
	{	ID2233,	0, 1, 0		},
	{	ID2234,	0, 1, 0		},

	{	ID2237,	0, 1, 0		},
	{	ID2238,	0, 1, 0		},
	{	ID2240,	0, 1, 0		},
	{	ID2241,	0, 1, 0		},

	{	ID2244,	0, 1, 0		},
	{	ID2245,	0, 1, 0		},
	{	ID2247,	0, 1, 0		},
	{	ID2248,	0, 1, 0		},

	{	   0,	0, 0, 0		}
};


static FCSUPDOWN_INFO	FCS_Specific22Keika[]	=	{

	{	ID222	},
	{	ID229	},
	{	ID2216	},
	{	ID2223	},
	{	ID2230	},
	{	ID2237	},
	{	ID2244	},
	
	{	ID223	},
	{	ID2210	},
	{	ID2217	},
	{	ID2224	},
	{	ID2231	},
	{	ID2228	},
	{	ID2245	},

	{	ID225	},
	{	ID2212	},
	{	ID2219	},
	{	ID2226	},
	{	ID2233	},
	{	ID2240	},
	{	ID2247	},

	{	ID226	},
	{	ID2213	},
	{	ID2220	},
	{	ID2227	},
	{	ID2234	},
	{	ID2241	},
	{	ID2248	},
};

static FCSUPDOWN_INFO	FCS_Specific22Keika_LR[]	=	{
	{	ID222	},
	{	ID223	},
	{	ID225	},
	{	ID226	},

	{	ID229	},
	{	ID2210	},
	{	ID2212	},
	{	ID2213	},
	
	{	ID2216	},
	{	ID2217	},
	{	ID2219	},
	{	ID2220	},

	{	ID2223	},
	{	ID2224	},
	{	ID2226	},
	{	ID2227	},

	{	ID2230	},
	{	ID2231	},
	{	ID2233	},
	{	ID2234	},

	{	ID2237	},
	{	ID2238	},
	{	ID2240	},
	{	ID2241	},

	{	ID2244	},
	{	ID2245	},
	{	ID2247	},
	{	ID2248	},
};

#define		FCS_SPECIFIC22CNT	28
