#pragma	once

//yoshida150311


#define	ID210  42	// 1行目　内容
#define	ID211  43	// 1行目　資産の譲渡等の対価以外の収入
#define	ID212  44	// 1行目　左のうち特定収入　A
#define	ID213  45	// 1行目　課税仕入れ等に係る特定収入　B
#define	ID214  46	// 1行目　A－Bの金額　C

#define	ID215  47	// 2行目　内容
#define	ID216  48	// 2行目　資産の譲渡等の対価以外の収入
#define	ID217  49	// 2行目　左のうち特定収入　A
#define	ID218  50	// 2行目　課税仕入れ等に係る特定収入　B
#define	ID219  51	// 2行目　A－Bの金額　C

#define	ID2110 52	// 3行目　内容
#define	ID2111 53	// 3行目　資産の譲渡等の対価以外の収入
#define	ID2112 54	// 3行目　左のうち特定収入　A
#define	ID2113 55	// 3行目　課税仕入れ等に係る特定収入　B
#define	ID2114 56	// 3行目　A－Bの金額　C

#define	ID2115 57	// 4行目　内容
#define	ID2116 58	// 4行目　資産の譲渡等の対価以外の収入
#define	ID2117 59	// 4行目　左のうち特定収入　A
#define	ID2118 60	// 4行目　課税仕入れ等に係る特定収入　B
#define	ID2119 61	// 4行目　A－Bの金額　C

#define	ID2120 62	// 5行目　内容
#define	ID2121 63	// 5行目　資産の譲渡等の対価以外の収入
#define	ID2122 64	// 5行目　左のうち特定収入　A
#define	ID2123 65	// 5行目　課税仕入れ等に係る特定収入　B
#define	ID2124 66	// 5行目　A－Bの金額　C

#define	ID2125 67	// 6行目　内容
#define	ID2126 68	// 6行目　資産の譲渡等の対価以外の収入
#define	ID2127 69	// 6行目　左のうち特定収入　A
#define	ID2128 70	// 6行目　課税仕入れ等に係る特定収入　B
#define	ID2129 71	// 6行目　A－Bの金額　C

#define	ID2130 72	// 7行目　内容
#define	ID2131 73	// 7行目　資産の譲渡等の対価以外の収入
#define	ID2132 74	// 7行目　左のうち特定収入　A
#define	ID2133 75	// 7行目　課税仕入れ等に係る特定収入　B
#define	ID2134 76	// 7行目　A－Bの金額　C


#define	KEI1 6		// 資産の譲渡等の対価以外の収入 合計
#define	KEI2 7		// 左のうち特定収入　A
#define	KEI3 8		// 課税仕入れ等に係る特定収入　B
#define	KEI5 9		// A－Bの金額　C


SH_ITEMINDEX	Specific21Ex2[]	=	{
	{	ID210 , 0, 1, 0		},
	{	ID211 , 0, 1, 0		},
	{	ID212 ,	0, 1, 0		},
	{	ID213 ,	0, 0, 0		},
	{	ID214 , 0, 0, 0		},
		
	{	ID215 , 0, 1, 0		},
	{	ID216 , 0, 1, 0		},
	{	ID217 ,	0, 1, 0		},
	{	ID218 ,	0, 0, 0		},
	{	ID219 ,	0, 0, 0		},
		
	{	ID2110,	0, 1, 0		},
	{	ID2111,	0, 1, 0		},
	{	ID2112,	0, 1, 0		},
	{	ID2113,	0, 0, 0		},
	{	ID2114,	0, 0, 0		},
		
	{	ID2115,	0, 1, 0		},
	{	ID2116,	0, 1, 0		},
	{	ID2117,	0, 1, 0		},
	{	ID2118,	0, 0, 0		},
	{	ID2119,	0, 0, 0		},
		
	{	ID2120,	0, 1, 0		},
	{	ID2121,	0, 1, 0		},
	{	ID2122,	0, 1, 0		},
	{	ID2123,	0, 0, 0		},
	{	ID2124,	0, 0, 0		},
		
	{	ID2125,	0, 1, 0		},
	{	ID2126,	0, 1, 0		},
	{	ID2127,	0, 1, 0		},
	{	ID2128,	0, 0, 0		},
	{	ID2129,	0, 0, 0		},
		
	{	ID2130,	0, 1, 0		},
	{	ID2131,	0, 1, 0		},
	{	ID2132,	0, 1, 0		},
	{	ID2133,	0, 0, 0		},
	{	ID2134,	0, 0, 0		},

	{	   0,	0, 0, 0		}
};


static FCSUPDOWN_INFO	FCS_Specific21Ex2[]	=	{
	{	ID210 		},
	{	ID215 		},
	{	ID2110 		},
	{	ID2115 		},
	{	ID2120 		},
	{	ID2125 		},
	{	ID2130 		},

	{	ID211 		},
	{	ID216 		},
	{	ID2111		},
	{	ID2116		},
	{	ID2121		},
	{	ID2126		},
	{	ID2131		},

	{	ID212 		},
	{	ID217 		},
	{	ID2112 		},
	{	ID2117 		},
	{	ID2122 		},
	{	ID2127 		},
	{	ID2132 		},

	{	ID213 		},
	{	ID218 		},
	{	ID2113 		},
	{	ID2118 		},
	{	ID2123 		},
	{	ID2128 		},
	{	ID2133 		},

	{	ID214 		},
	{	ID219 		},
	{	ID2114 		},
	{	ID2119 		},
	{	ID2124 		},
	{	ID2129 		},
	{	ID2134 		},

};

static FCSUPDOWN_INFO	FCS_Specific21Ex2_LR[]	=	{
	{	ID210 		},
	{	ID211 		},
	{	ID212 		},
	{	ID213 		},
	{	ID214 		},

	{	ID215 		},
	{	ID216 		},
	{	ID217 		},
	{	ID218 		},
	{	ID219 		},

	{	ID2110 		},
	{	ID2111 		},
	{	ID2112 		},
	{	ID2113		},
	{	ID2114 		},

	{	ID2115 		},
	{	ID2116 		},
	{	ID2117 		},
	{	ID2118 		},
	{	ID2119		},

	{	ID2120 		},
	{	ID2121 		},
	{	ID2122 		},
	{	ID2123 		},
	{	ID2124 		},

	{	ID2125		},
	{	ID2126 		},
	{	ID2127 		},
	{	ID2128 		},
	{	ID2129 		},

	{	ID2130 		},
	{	ID2131		},
	{	ID2132 		},
	{	ID2133 		},
	{	ID2134 		},
	
};

#define		FCS_SPECIFIC21CNT	42
