#pragma	once

//yoshida150311


#define	ID210 49	// 1行目　内容
#define	ID211 50	// 1行目　資産の譲渡等の対価以外の収入
#define	ID212 51	// 1行目　左のうち特定収入　A
#define	ID213 52	// 1行目　課税仕入れ等に係る特定収入　B　８％
#define	ID214 53	// 1行目　課税仕入れ等に係る特定収入　B　５％
#define	ID215 54	// 1行目　A－Bの金額　C

#define	ID216 55	// 2行目　内容
#define	ID217 56	// 2行目　資産の譲渡等の対価以外の収入
#define	ID218 57	// 2行目　左のうち特定収入　A
#define	ID219 58	// 2行目　課税仕入れ等に係る特定収入　B　８％
#define	ID2110 59	// 2行目　課税仕入れ等に係る特定収入　B　５％
#define	ID2111 60	// 2行目　A－Bの金額　C

#define	ID2112 61	// 3行目　内容
#define	ID2113 62	// 3行目　資産の譲渡等の対価以外の収入
#define	ID2114 63	// 3行目　左のうち特定収入　A
#define	ID2115 64	// 3行目　課税仕入れ等に係る特定収入　B　８％
#define	ID2116 65	// 3行目　課税仕入れ等に係る特定収入　B　５％
#define	ID2117 66	// 3行目　A－Bの金額　C

#define	ID2118 67	// 4行目　内容
#define	ID2119 68	// 4行目　資産の譲渡等の対価以外の収入
#define	ID2120 69	// 4行目　左のうち特定収入　A
#define	ID2121 70	// 4行目　課税仕入れ等に係る特定収入　B　８％
#define	ID2122 71	// 4行目　課税仕入れ等に係る特定収入　B　５％
#define	ID2123 72	// 4行目　A－Bの金額　C

#define	ID2124 73	// 5行目　内容
#define	ID2125 74	// 5行目　資産の譲渡等の対価以外の収入
#define	ID2126 75	// 5行目　左のうち特定収入　A
#define	ID2127 76	// 5行目　課税仕入れ等に係る特定収入　B　８％
#define	ID2128 77	// 5行目　課税仕入れ等に係る特定収入　B　５％
#define	ID2129 78	// 5行目　A－Bの金額　C

#define	ID2130 79	// 6行目　内容
#define	ID2131 80	// 6行目　資産の譲渡等の対価以外の収入
#define	ID2132 81	// 6行目　左のうち特定収入　A
#define	ID2133 82	// 6行目　課税仕入れ等に係る特定収入　B　８％
#define	ID2134 83	// 6行目　課税仕入れ等に係る特定収入　B　５％
#define	ID2135 84	// 6行目　A－Bの金額　C

#define	ID2136 85	// 7行目　内容
#define	ID2137 86	// 7行目　資産の譲渡等の対価以外の収入
#define	ID2138 87	// 7行目　左のうち特定収入　A
#define	ID2139 88	// 7行目　課税仕入れ等に係る特定収入　B　８％
#define	ID2140 89	// 7行目　課税仕入れ等に係る特定収入　B　５％
#define	ID2141 90	// 7行目　A－Bの金額　C


#define	KEI1 7		// 資産の譲渡等の対価以外の収入 合計
#define	KEI2 8		// 左のうち特定収入　A
#define	KEI3 9		// 課税仕入れ等に係る特定収入　B　８％
#define	KEI4 10		// 課税仕入れ等に係る特定収入　B　５％
#define	KEI5 11		// A－Bの金額　C


SH_ITEMINDEX	Specific21[]	=	{
	{	ID210,	0, 1, 0		},
	{	ID211,	0, 1, 0		},
	{	ID212,	0, 1, 0		},
	{	ID213,	0, 1, 0		},
	{	ID214,	0, 0, 0		},
	{	ID215,	0, 0, 0		},

	{	ID216,	0, 1, 0		},
	{	ID217,	0, 1, 0		},
	{	ID218,	0, 1, 0		},
	{	ID219,	0, 1, 0		},
	{	ID2110,	0, 0, 0		},
	{	ID2111,	0, 0, 0		},

	{	ID2112,	0, 1, 0		},
	{	ID2113,	0, 1, 0		},
	{	ID2114,	0, 1, 0		},
	{	ID2115,	0, 1, 0		},
	{	ID2116,	0, 0, 0		},
	{	ID2117,	0, 0, 0		},

	{	ID2118,	0, 1, 0		},
	{	ID2119,	0, 1, 0		},
	{	ID2120,	0, 1, 0		},
	{	ID2121,	0, 1, 0		},
	{	ID2122,	0, 0, 0		},
	{	ID2123,	0, 0, 0		},

	{	ID2124,	0, 1, 0		},
	{	ID2125,	0, 1, 0		},
	{	ID2126,	0, 1, 0		},
	{	ID2127,	0, 1, 0		},
	{	ID2128,	0, 0, 0		},
	{	ID2129,	0, 0, 0		},

	{	ID2130,	0, 1, 0		},
	{	ID2131,	0, 1, 0		},
	{	ID2132,	0, 1, 0		},
	{	ID2133,	0, 1, 0		},
	{	ID2134,	0, 0, 0		},
	{	ID2135,	0, 0, 0		},

	{	ID2136,	0, 1, 0		},
	{	ID2137,	0, 1, 0		},
	{	ID2138,	0, 1, 0		},
	{	ID2139,	0, 1, 0		},
	{	ID2140,	0, 0, 0		},
	{	ID2141,	0, 0, 0		},

	{	   0,	0, 0, 0		}
};

//SH_ITEMINDEX	SpecificKei21[]	=	{
//	{	KEI1,	0, 0, 0		},
//	{	KEI2,	0, 0, 0		},
//	{	KEI3,	0, 0, 0		},
//	{	KEI4,	0, 0, 0		},
//	{	KEI5,	0, 0, 0		},
//
//	{	   0,	0, 0, 0		}
//};


static FCSUPDOWN_INFO	FCS_Specific21[]	=	{
	{	ID210 		},
	{	ID216 		},
	{	ID2112 		},
	{	ID2118 		},
	{	ID2124 		},
	{	ID2130 		},
	{	ID2136 		},

	{	ID211 		},
	{	ID217 		},
	{	ID2113		},
	{	ID2119		},
	{	ID2125		},
	{	ID2131		},
	{	ID2137		},

	{	ID212 		},
	{	ID218 		},
	{	ID2114 		},
	{	ID2120 		},
	{	ID2126 		},
	{	ID2132 		},
	{	ID2138 		},

	{	ID213 		},
	{	ID219 		},
	{	ID2115 		},
	{	ID2121 		},
	{	ID2127 		},
	{	ID2133 		},
	{	ID2139 		},

	{	ID214 		},
	{	ID2110 		},
	{	ID2116 		},
	{	ID2122 		},
	{	ID2128 		},
	{	ID2134 		},
	{	ID2140 		},

	{	ID215 		},	
	{	ID2111 		},	
	{	ID2117 		},		
	{	ID2123 		},		
	{	ID2129 		},	
	{	ID2135 		},	
	{	ID2141 		},
};

static FCSUPDOWN_INFO	FCS_Specific21_LR[]	=	{
	{	ID210 		},
	{	ID211 		},
	{	ID212 		},
	{	ID213 		},
	{	ID214 		},
	{	ID215 		},

	{	ID216 		},
	{	ID217 		},
	{	ID218 		},
	{	ID219 		},
	{	ID2110 		},
	{	ID2111 		},

	{	ID2112 		},
	{	ID2113		},
	{	ID2114 		},
	{	ID2115 		},
	{	ID2116 		},
	{	ID2117 		},

	{	ID2118 		},
	{	ID2119		},
	{	ID2120 		},
	{	ID2121 		},
	{	ID2122 		},
	{	ID2123 		},

	{	ID2124 		},
	{	ID2125		},
	{	ID2126 		},
	{	ID2127 		},
	{	ID2128 		},
	{	ID2129 		},

	{	ID2130 		},
	{	ID2131		},
	{	ID2132 		},
	{	ID2133 		},
	{	ID2134 		},
	{	ID2135 		},

	{	ID2136 		},
	{	ID2137		},
	{	ID2138 		},
	{	ID2139 		},
	{	ID2140 		},
	{	ID2141 		},
	
};

#define		FCS_SPECIFIC21CNT	42
