#pragma	once

//-----------------------------------------------------------------------------
// 計算表１：インデックスファイル
//-----------------------------------------------------------------------------

#define	ID10 19		// 1.課税売上（免税・非課税売上・値引を含まない）	[SpKzur]
#define	ID11 20		// 2.課税売上（免税・非課税売上・値引を含まない）	[SpKzur]
#define	ID12 21		// 3.免税売上										[SpMzur]
#define	ID13 22		// 4.非課税売上（有価証券を全額で含む）				[SpHkur]
#define	ID14 23		// 5.資産の譲渡等の対価の合計額						[SpTuwb]


SH_ITEMINDEX	Specific1[]	=	{
//-- '15.05.18 --
//	{	ID10,	0, 2, 0		},
//	{	ID11,	0, 3, 0		},
//---------------
	{	ID10,	0, 0, 0		},
	{	ID11,	0, 0, 0		},
//---------------
//-- '15.05.18 --
//	{	ID12,	0, 1, 0		},
//---------------
	{	ID12,	0, 0, 0		},
//---------------
	{	ID13,	0, 1, 0		},
	{	   0,	0, 0, 0		}
};


static FCSUPDOWN_INFO	FCS_Specific1[]	=	{
	{	ID10 		},
	{	ID11 		},
	{	ID12 		},
	{	ID13 		},
	{	ID14 		}
};

static FCSUPDOWN_INFO	FCS_Specific1_LR[]	=	{
	{	ID10 		},
	{	ID11 		},
	{	ID12 		},
	{	ID13 		},
	{	ID14 		}
	
};

#define		FCS_SPECIFIC1CNT	5