#pragma once

#define ID402_1A	133		// 課税標準額 税率3%適用分   A
#define ID402_1B	134		// 課税標準額 税率4%適用分   B
#define ID402_1C	135		// 課税標準額 税率6.3%適用分 C
#define ID402_1X	136		// 課税標準額 旧税率分小計   X

#define ID402_1_1A	137		// 課税資産の譲渡等の対価の額 税率3%適用分   A
#define ID402_1_1B	138		// 課税資産の譲渡等の対価の額 税率4%適用分   B
#define ID402_1_1C	139		// 課税資産の譲渡等の対価の額 税率6.3%適用分 C
#define ID402_1_1X	140		// 課税資産の譲渡等の対価の額 旧税率分小計   X

#define ID402_2A	141		// 消費税額 税率3%適用分   A
#define ID402_2B	142		// 消費税額 税率4%適用分   B
#define ID402_2C	143		// 消費税額 税率6.3%適用分 C
#define ID402_2X	144		// 消費税額 旧税率分小計   X

#define ID402_3A	145		// 貸倒回収に係る消費税額 税率3%適用分   A
#define ID402_3B	146		// 貸倒回収に係る消費税額 税率4%適用分   B
#define ID402_3C	147		// 貸倒回収に係る消費税額 税率6.3%適用分 C
#define ID402_3X	148		// 貸倒回収に係る消費税額 旧税率分小計   X

#define ID402_4A	149		// 控除対象仕入税額 税率3%適用分   A
#define ID402_4B	150		// 控除対象仕入税額 税率4%適用分   B
#define ID402_4C	151		// 控除対象仕入税額 税率6.3%適用分 C
#define ID402_4X	152		// 控除対象仕入税額 旧税率分小計   X

#define ID402_5A	153		// 返還等対価に係る税額 税率3%適用分   A
#define ID402_5B	154		// 返還等対価に係る税額 税率4%適用分   B
#define ID402_5C	155		// 返還等対価に係る税額 税率6.3%適用分 C
#define ID402_5X	156		// 返還等対価に係る税額 旧税率分小計   X

#define ID402_6A	157		// 貸倒れに係る税額 税率3%適用分   A
#define ID402_6B	158		// 貸倒れに係る税額 税率4%適用分   B
#define ID402_6C	159		// 貸倒れに係る税額 税率6.3%適用分 C
#define ID402_6X	160		// 貸倒れに係る税額 旧税率分小計   X

#define ID402_7A	161		// 控除税額小計 税率3%適用分   A
#define ID402_7B	162		// 控除税額小計 税率4%適用分   B
#define ID402_7C	163		// 控除税額小計 税率6.3%適用分 C
#define ID402_7X	164		// 控除税額小計 旧税率分小計   X

#define ID402_8A	165		// 控除不足還付税額 税率3%適用分   A
#define ID402_8B	166		// 控除不足還付税額 税率4%適用分   B
#define ID402_8C	167		// 控除不足還付税額 税率6.3%適用分 C
#define ID402_8X	168		// 控除不足還付税額 旧税率分小計   X

#define ID402_9A	169		// 差引税額 税率3%適用分   A
#define ID402_9B	170		// 差引税額 税率4%適用分   B
#define ID402_9C	171		// 差引税額 税率6.3%適用分 C
#define ID402_9X	172		// 差引税額 旧税率分小計   X

#define ID402_11B	173		// 控除不足還付税額 税率4%適用分   B
#define ID402_11C	174		// 控除不足還付税額 税率6.3%適用分 C
#define ID402_11X	175		// 控除不足還付税額 旧税率分小計   X

#define ID402_12B	176		// 差引税額 税率4%適用分   B
#define ID402_12C	177		// 差引税額 税率6.3%適用分 C
#define ID402_12X	178		// 差引税額 旧税率分小計   X

#define ID402_13B	179		// 合計差引地方消費税の課税標準となる消費税額 税率4%適用分   B
#define ID402_13C	180		// 合計差引地方消費税の課税標準となる消費税額 税率6.3%適用分 C
#define ID402_13X	181		// 合計差引地方消費税の課税標準となる消費税額 旧税率分小計   X

#define ID402_14B	182		// 還付額 税率4%適用分   B
#define ID402_14C	183		// 還付額 税率6.3%適用分 C
#define ID402_14X	184		// 還付額 旧税率分小計   X

#define ID402_15B	185		// 納税額 税率4%適用分   B
#define ID402_15C	186		// 納税額 税率6.3%適用分 C
#define ID402_15X	187		// 納税額 旧税率分小計   X

static SH_ITEMINDEX Fhyo4_02[] = {

	{ ID402_1A, 0, 0, 0 },//yoshida190620 入力不可に
	{ ID402_1B, 0, 0, 0 },//yoshida190620 入力不可に
	{ ID402_1C, 0, 0, 0 },//yoshida190620 入力不可に

	{ ID402_1_1A, 0, 1, 0 },
	{ ID402_1_1B, 0, 1, 0 },
	{ ID402_1_1C, 0, 1, 0 },

	{ ID402_2A, 0, 1, 0 },
	{ ID402_2B, 0, 1, 0 },
	{ ID402_2C, 0, 1, 0 },

	{ ID402_3A, 0, 1, 0 },
	{ ID402_3B, 0, 1, 0 },
	{ ID402_3C, 0, 1, 0 },

	{ ID402_5A, 0, 1, 0 },
	{ ID402_5B, 0, 1, 0 },
	{ ID402_5C, 0, 1, 0 },

	{ ID402_6A, 0, 1, 0 },
	{ ID402_6B, 0, 1, 0 },
	{ ID402_6C, 0, 1, 0 },

	{  0, 0, 0, 0 }
};

static FCSUPDOWN_INFO FCS_Fhyo4_02[] = {
	{ ID402_1A   },
	{ ID402_1_1A },
	{ ID402_2A   },
	{ ID402_3A   },
	{ ID402_4A   },
	{ ID402_4A   },
	{ ID402_5A   },
	{ ID402_6A   },
	{ ID402_7A   },
	{ ID402_8A   },
	{ ID402_9A   },

	{ ID402_1B   },
	{ ID402_1_1B },
	{ ID402_2B   },
	{ ID402_3B   },
	{ ID402_4B   },
	{ ID402_5B   },
	{ ID402_6B   },
	{ ID402_7B   },
	{ ID402_8B   },
	{ ID402_9B   },
	{ ID402_11B  },
	{ ID402_12B  },
	{ ID402_13B  },
	{ ID402_14B  },
	{ ID402_15B  },

	{ ID402_1C   },
	{ ID402_1_1C },
	{ ID402_2C   },
	{ ID402_3C   },
	{ ID402_4C   },
	{ ID402_5C   },
	{ ID402_6C   },
	{ ID402_7C   },
	{ ID402_8C   },
	{ ID402_9C   },
	{ ID402_11C  },
	{ ID402_12C  },
	{ ID402_13C  },
	{ ID402_14C  },
	{ ID402_15C  },

	{ ID402_1X },
	{ ID402_1_1X },
	{ ID402_2X },
	{ ID402_3X },
	{ ID402_4X },
	{ ID402_5X },
	{ ID402_6X },
	{ ID402_7X },
	{ ID402_8X },
	{ ID402_9X },
	{ ID402_11X },
	{ ID402_12X },
	{ ID402_13X },
	{ ID402_14X },
	{ ID402_15X }

};

#define FCS_FHY4_02CNT 54