#pragma once


#define ID103_1A	121		// 課税標準額 税率6.24%適用分  A
#define ID103_1B	122		// 課税標準額 税率7.8%適用分   B
#define ID103_1C	123		// 課税標準額 合計 C

#define ID103_1_1A	124		// 課税資産の譲渡等の対価の額 税率6.24%適用分  A
#define ID103_1_1B	125		// 課税資産の譲渡等の対価の額 税率7.8%適用分   B
#define ID103_1_1C	126		// 課税資産の譲渡等の対価の額合計 C

#define ID103_1_2B	127		// 特定課税仕入に係る支払い対価の額 税率7.8%適用分   B
#define ID103_1_2C	128		// 特定課税仕入に係る支払い対価の額 合計 C

#define ID103_2A	129		// 消費税額 税率6.24%適用分  A
#define ID103_2B	130		// 消費税額 税率7.8%適用分   B
#define ID103_2C	131		// 消費税額 合計 C

#define ID103_3A	132		// 控除過大調整税額 税率6.24%適用分  A
#define ID103_3B	133		// 控除過大調整税額 税率7.8%適用分   B
#define ID103_3C	134		// 控除過大調整税額 合計 C

#define ID103_4A	135		// 控除対象仕入税額 税率6.24%適用分  A
#define ID103_4B	136		// 控除対象仕入税額 税率7.8%適用分   B
#define ID103_4C	137		// 控除対象仕入税額 合計 C

#define ID103_5A	138		// 返還等対価に係る税額 税率6.24%適用分  A
#define ID103_5B	139		// 返還等対価に係る税額 税率7.8%適用分   B
#define ID103_5C	140		// 返還等対価に係る税額 合計 C

#define ID103_5_1A	141		// 売上げの返還等対価に係る税額 税率6.24%適用分  A
#define ID103_5_1B	142		// 売上げの返還等対価に係る税額 税率7.8%適用分   B
#define ID103_5_1C	143		// 売上げの返還等対価に係る税額 合計 C

#define ID103_5_2B	144		// 特定課税仕入れの返還等対価に係る税額 税率7.8%適用分   B
#define ID103_5_2C	145		// 特定課税仕入れの返還等対価に係る税額 合計 C

#define ID103_6A	146		// 貸倒れに係る税額 税率6.24%適用分  A
#define ID103_6B	147		// 貸倒れに係る税額 税率7.8%適用分   B
#define ID103_6C	148		// 貸倒れに係る税額 合計 C

#define ID103_7A	149		// 控除税額小計 税率6.24%適用分  A
#define ID103_7B	150		// 控除税額小計 税率7.8%適用分   B
#define ID103_7C	151		// 控除税額小計 合計 C

#define ID103_8C	152		// 控除不足還付税額 合計 C

#define ID103_9C	153		// 差引税額 合計 C

#define ID103_10C	154		// 地方消費税の課税標準となる消費税額 控除不足還付税額 合計 C

#define ID103_11C	155		// 地方消費税の課税標準となる消費税額 差引税額 合計 C

#define ID103_12C	156		// 還付額 合計 C

#define ID103_13C	157		// 納税額 合計 C


static SH_ITEMINDEX Fhyo1_03[] = {

	{ ID103_1A, 0, 0, 0 },
	{ ID103_1B, 0, 0, 0 },

	{ ID103_1_1A, 0, 1, 0 },
	{ ID103_1_1B, 0, 1, 0 },

	{ ID103_1_2B, 0, 1, 0 },

	{ ID103_2A, 0, 1, 0   },
	{ ID103_2B, 0, 1, 0   },

	{ ID103_5A, 0, 0, 0   },
	{ ID103_5B, 0, 0, 0   },

	{ ID103_5_1A, 0, 1, 0 },
	{ ID103_5_1B, 0, 1, 0 },

	{ ID103_5_2B, 0, 1, 0 },

	{ ID103_6A, 0, 1, 0   },
	{ ID103_6B, 0, 1, 0   },

	{ 0, 0, 0, 0		  }

};

static FCSUPDOWN_INFO	FCS_Fhyo1_03[] = {

	{ ID103_1A   },
	{ ID103_1_1A },
	{ ID103_2A   },
	{ ID103_3A   },
	{ ID103_4A   },
	{ ID103_5A   },
	{ ID103_5_1A },
	{ ID103_6A   },
	{ ID103_7A   },

	{ ID103_1B   },
	{ ID103_1_1B },
	{ ID103_2B   },
	{ ID103_3B   },
	{ ID103_4B   },
	{ ID103_5B   },
	{ ID103_5_1B },
	{ ID103_6B   },
	{ ID103_7B   },

	{ ID103_1C   },
	{ ID103_1_1C },
	{ ID103_2C   },
	{ ID103_3C   },
	{ ID103_4C   },
	{ ID103_5C   },
	{ ID103_5_1C },
	{ ID103_5_2C },
	{ ID103_6C   },
	{ ID103_7C   },
	{ ID103_8C   },
	{ ID103_9C   },
	{ ID103_11C  },
	{ ID103_12C  },
	{ ID103_13C  },
};

#define		FCS_FHY1_03CNT	36
