#pragma once

#define ID401_1X	131		// 課税標準額 旧税率分小計    X
#define ID401_1D	132		// 課税標準額 税率6.24%適用分 D
#define ID401_1E	133		// 課税標準額 税率7.8%適用分  E
#define ID401_1F	134		// 課税標準額 合計            F

#define ID401_1_1X	135		// 課税資産の譲渡等の対価の額 旧税率分小計    X
#define ID401_1_1D	136		// 課税資産の譲渡等の対価の額 税率6.24%適用分 D
#define ID401_1_1E	137		// 課税資産の譲渡等の対価の額 税率7.8%適用分  E
#define ID401_1_1F	138		// 課税資産の譲渡等の対価の額 合計            F

#define ID401_2X	139		// 消費税額 旧税率分小計    X
#define ID401_2D	140		// 消費税額 税率6.24%適用分 D
#define ID401_2E	141		// 消費税額 税率7.8%適用分  E
#define ID401_2F	142		// 消費税額 合計            F

#define ID401_3X	143		// 貸倒回収に係る消費税額 旧税率分小計    X
#define ID401_3D	144		// 貸倒回収に係る消費税額 税率6.24%適用分 D
#define ID401_3E	145		// 貸倒回収に係る消費税額 税率7.8%適用分  E
#define ID401_3F	146		// 貸倒回収に係る消費税額 合計            F

#define ID401_4X	147		// 控除対象仕入れ税額 旧税率分小計    X
#define ID401_4D	148		// 控除対象仕入れ税額 税率6.24%適用分 D
#define ID401_4E	149		// 控除対象仕入れ税額 税率7.8%適用分  E
#define ID401_4F	150		// 控除対象仕入れ税額 合計            F

#define ID401_5X	151		// 返還等対価に係る税額 旧税率分小計    X
#define ID401_5D	152		// 返還等対価に係る税額 税率6.24%適用分 D
#define ID401_5E	153		// 返還等対価に係る税額 税率7.8%適用分  E
#define ID401_5F	154		// 返還等対価に係る税額 合計            F

#define ID401_6X	155		// 貸倒れに係る税額 旧税率分小計    X
#define ID401_6D	156		// 貸倒れに係る税額 税率6.24%適用分 D
#define ID401_6E	157		// 貸倒れに係る税額 税率7.8%適用分  E
#define ID401_6F	158		// 貸倒れに係る税額 合計            F

#define ID401_7X	159		// 控除税額小計 旧税率分小計    X
#define ID401_7D	160		// 控除税額小計 税率6.24%適用分 D
#define ID401_7E	161		// 控除税額小計 税率7.8%適用分  E
#define ID401_7F	162		// 控除税額小計 合計            F

#define ID401_8X	163		// 控除不足還付税額 旧税率分小計    X
#define ID401_8D	164		// 控除不足還付税額 税率6.24%適用分 D
#define ID401_8E	165		// 控除不足還付税額 税率7.8%適用分  E
#define ID401_8F	166		// 控除不足還付税額 合計            F

#define ID401_9X	167		// 差引税額 旧税率分小計    X
#define ID401_9D	168		// 差引税額 税率6.24%適用分 D
#define ID401_9E	169		// 差引税額 税率7.8%適用分  E
#define ID401_9F	170		// 差引税額 合計            F

#define ID401_10F	171		// 合計差引税額 合計 F

#define ID401_11X	172		// 控除不足還付税額 旧税率分小計    X
#define ID401_11E	173		// 控除不足還付税額 税率7.8%適用分  E
#define ID401_11F	174		// 控除不足還付税額 合計            F

#define ID401_12X	175		// 差引税額 旧税率分小計    X
#define ID401_12E	176		// 差引税額 税率7.8%適用分  E
#define ID401_12F	177		// 差引税額 合計            F

#define ID401_13X	178		// 合計差引地方消費税の課税標準となる消費税額 旧税率分小計    X
#define ID401_13E	179		// 合計差引地方消費税の課税標準となる消費税額 税率7.8%適用分  E
#define ID401_13F	180		// 合計差引地方消費税の課税標準となる消費税額 合計            F

#define ID401_14X	181		// 還付額 旧税率分小計    X
#define ID401_14E	182		// 還付額 税率7.8%適用分  E
#define ID401_14F	183		// 還付額 合計            F

#define ID401_15X	184		// 納付額 旧税率分小計    X
#define ID401_15E	185		// 納付額 税率7.8%適用分  E
#define ID401_15F	186		// 納付額 合計            F

#define ID401_16F	187		// 合計差引譲渡割額 合計 F

static SH_ITEMINDEX Fhyo4_01[] = {

	{ ID401_1D, 0, 0, 0 },//yoshida190620 入力不可に
	{ ID401_1E, 0, 0, 0 },//yoshida190620 入力不可に

	{ ID401_1_1D, 0, 1, 0 },
	{ ID401_1_1E, 0, 1, 0 },

	{ ID401_2D, 0, 1, 0 },
	{ ID401_2E, 0, 1, 0 },

	{ ID401_3D, 0, 1, 0 },
	{ ID401_3E, 0, 1, 0 },

	{ ID401_5D, 0, 1, 0 },
	{ ID401_5E, 0, 1, 0 },

	{ ID401_6D, 0, 1, 0 },
	{ ID401_6E, 0, 1, 0 },

	{ 0, 0, 0, 0 }
};

static FCSUPDOWN_INFO FCS_Fhyo4_01[] = {

	{ ID401_1X   },
	{ ID401_1_1X },
	{ ID401_2X   },
	{ ID401_3X   },
	{ ID401_4X   },
	{ ID401_5X   },
	{ ID401_6X   },
	{ ID401_7X   },
	{ ID401_8X   },
	{ ID401_9X   },
	{ ID401_11X  },
	{ ID401_12X  },
	{ ID401_13X  },
	{ ID401_14X  },
	{ ID401_15X  },

	{ ID401_1D   },
	{ ID401_1_1D },
	{ ID401_2D   },
	{ ID401_3D   },
	{ ID401_4D   },
	{ ID401_5D   },
	{ ID401_6D   },
	{ ID401_7D   },
	{ ID401_8D   },
	{ ID401_9D   },

	{ ID401_1E   },
	{ ID401_1_1E },
	{ ID401_2E   },
	{ ID401_3E   },
	{ ID401_4E   },
	{ ID401_5E   },
	{ ID401_6E   },
	{ ID401_7E   },
	{ ID401_8E   },
	{ ID401_9E   },
	{ ID401_11E  },
	{ ID401_12E  },
	{ ID401_13E  },
	{ ID401_14E  },
	{ ID401_15E  },

	{ ID401_1F   },
	{ ID401_1_1F },
	{ ID401_2F   },
	{ ID401_3F   },
	{ ID401_4F   },
	{ ID401_5F   },
	{ ID401_6F   },
	{ ID401_7F   },
	{ ID401_8F   },
	{ ID401_9F   },
	{ ID401_10F  },
	{ ID401_11F  },
	{ ID401_12F  },
	{ ID401_13F  },
	{ ID401_14F  },
	{ ID401_15F  },
	{ ID401_16F  }

};

#define FCS_FHY4_01CNT	56