#pragma once

#define ID501_1X 182	// 課税標準額に対する消費税額 旧税率分小計    X
#define ID501_1D 183	// 課税標準額に対する消費税額 税率6.24%適用分 D
#define ID501_1E 184	// 課税標準額に対する消費税額 税率7.8%適用分  E
#define ID501_1F 185	// 課税標準額に対する消費税額 合計            F

#define ID501_2X 186	// 貸倒回収に係る消費税額 旧税率分小計    X
#define ID501_2D 187	// 貸倒回収に係る消費税額 税率6.24%適用分 D
#define ID501_2E 188	// 貸倒回収に係る消費税額 税率7.8%適用分  E
#define ID501_2F 189	// 貸倒回収に係る消費税額 合計            F

#define ID501_3X 190	// 売上対価の返還等に係る消費税額 旧税率分小計    X
#define ID501_3D 191	// 売上対価の返還等に係る消費税額 税率6.24%適用分 D
#define ID501_3E 192	// 売上対価の返還等に係る消費税額 税率7.8%適用分  E
#define ID501_3F 193	// 売上対価の返還等に係る消費税額 合計            F

#define ID501_4X 194	// 控除対象仕入税額の計算の基礎となる消費税額 旧税率分小計    X
#define ID501_4D 195	// 控除対象仕入税額の計算の基礎となる消費税額 税率6.24%適用分 D
#define ID501_4E 196	// 控除対象仕入税額の計算の基礎となる消費税額 税率7.8%適用分  E
#define ID501_4F 197	// 控除対象仕入税額の計算の基礎となる消費税額 合計            F

#define ID501_5X 198	// ④×みなし仕入率 旧税率分小計    X
#define ID501_5D 199	// ④×みなし仕入率 税率6.24%適用分 D
#define ID501_5E 200	// ④×みなし仕入率 税率7.8%適用分  E
#define ID501_5F 201	// ④×みなし仕入率 合計            F

#define ID501_6X 202	// 事業区分別の合計額 旧税率分小計    X
#define ID501_6D 203	// 事業区分別の合計額 税率6.24%適用分 D
#define ID501_6E 204	// 事業区分別の合計額 税率7.8%適用分  E
#define ID501_6F 205	// 事業区分別の合計額 合計            F

#define ID501_7X 206	// 第一種事業(卸売業) 旧税率分小計    X
#define ID501_7D 207	// 第一種事業(卸売業) 税率6.24%適用分 D
#define ID501_7E 208	// 第一種事業(卸売業) 税率7.8%適用分  E
#define ID501_7F 209	// 第一種事業(卸売業) 合計            F
#define ID501_7W 210	// 第一種事業(卸売業) 売上割合

#define ID501_8X 211	// 第二種事業(小売業) 旧税率分小計    X
#define ID501_8D 212	// 第二種事業(小売業) 税率6.24%適用分 D
#define ID501_8E 213	// 第二種事業(小売業) 税率7.8%適用分  E
#define ID501_8F 214	// 第二種事業(小売業) 合計            F
#define ID501_8W 215	// 第二種事業(小売業) 売上割合

#define ID501_9X 216	// 第三種事業(製造業等) 旧税率分小計    X
#define ID501_9D 217	// 第三種事業(製造業等) 税率6.24%適用分 D
#define ID501_9E 218	// 第三種事業(製造業等) 税率7.8%適用分  E
#define ID501_9F 219	// 第三種事業(製造業等) 合計            F
#define ID501_9W 220	// 第三種事業(製造業等) 売上割合

#define ID501_10X 221	// 第四種事業(その他) 旧税率分小計    X
#define ID501_10D 222	// 第四種事業(その他) 税率6.24%適用分 D
#define ID501_10E 223	// 第四種事業(その他) 税率7.8%適用分  E
#define ID501_10F 224	// 第四種事業(その他) 合計            F
#define ID501_10W 225	// 第四種事業(その他) 売上割合

#define ID501_11X 226	// 第五種事業(サービス業等) 旧税率分小計    X
#define ID501_11D 227	// 第五種事業(サービス業等) 税率6.24%適用分 D
#define ID501_11E 228	// 第五種事業(サービス業等) 税率7.8%適用分  E
#define ID501_11F 229	// 第五種事業(サービス業等) 合計            F
#define ID501_11W 230	// 第五種事業(サービス業等) 売上割合

#define ID501_12X 231	// 第六種事業(不動産業) 旧税率分小計    X
#define ID501_12D 232	// 第六種事業(不動産業) 税率6.24%適用分 D
#define ID501_12E 233	// 第六種事業(不動産業) 税率7.8%適用分  E
#define ID501_12F 234	// 第六種事業(不動産業) 合計            F
#define ID501_12W 235	// 第六種事業(不動産業) 売上割合

#define ID501_13X 236	// 事業区分別の合計額 旧税率分小計    X
#define ID501_13D 237	// 事業区分別の合計額 税率6.24%適用分 D
#define ID501_13E 238	// 事業区分別の合計額 税率7.8%適用分  E
#define ID501_13F 239	// 事業区分別の合計額 合計            F

#define ID501_14X 240	// 第一種事業(卸売業) 旧税率分小計    X
#define ID501_14D 241	// 第一種事業(卸売業) 税率6.24%適用分 D
#define ID501_14E 242	// 第一種事業(卸売業) 税率7.8%適用分  E
#define ID501_14F 243	// 第一種事業(卸売業) 合計            F

#define ID501_15X 244	// 第二種事業(小売業) 旧税率分小計    X
#define ID501_15D 245	// 第二種事業(小売業) 税率6.24%適用分 D
#define ID501_15E 246	// 第二種事業(小売業) 税率7.8%適用分  E
#define ID501_15F 247	// 第二種事業(小売業) 合計            F

#define ID501_16X 248	// 第三種事業(製造業等) 旧税率分小計    X
#define ID501_16D 249	// 第三種事業(製造業等) 税率6.24%適用分 D
#define ID501_16E 250	// 第三種事業(製造業等) 税率7.8%適用分  E
#define ID501_16F 251	// 第三種事業(製造業等) 合計            F

#define ID501_17X 252	// 第四種事業(その他) 旧税率分小計    X
#define ID501_17D 253	// 第四種事業(その他) 税率6.24%適用分 D
#define ID501_17E 254	// 第四種事業(その他) 税率7.8%適用分  E
#define ID501_17F 255	// 第四種事業(その他) 合計            F

#define ID501_18X 256	// 第五種事業(サービス業等) 旧税率分小計    X
#define ID501_18D 257	// 第五種事業(サービス業等) 税率6.24%適用分 D
#define ID501_18E 258	// 第五種事業(サービス業等) 税率7.8%適用分  E
#define ID501_18F 259	// 第五種事業(サービス業等) 合計            F

#define ID501_19X 260	// 第六種事業(不動産業) 旧税率分小計    X
#define ID501_19D 261	// 第六種事業(不動産業) 税率6.24%適用分 D
#define ID501_19E 262	// 第六種事業(不動産業) 税率7.8%適用分  E
#define ID501_19F 263	// 第六種事業(不動産業) 合計            F

static SH_ITEMINDEX Fhyo5_01[] = {
	{ ID501_6D, 0, 1, 0 },
	{ ID501_6E, 0, 1, 0 },

	{ ID501_7D, 0, 1, 0 },
	{ ID501_7E, 0, 1, 0 },

	{ ID501_8D, 0, 1, 0 },
	{ ID501_8E, 0, 1, 0 },

	{ ID501_9D, 0, 1, 0 },
	{ ID501_9E, 0, 1, 0 },

	{ ID501_10D, 0, 1, 0 },
	{ ID501_10E, 0, 1, 0 },

	{ ID501_11D, 0, 1, 0 },
	{ ID501_11E, 0, 1, 0 },

	{ ID501_12D, 0, 1, 0 },
	{ ID501_12E, 0, 1, 0 },

	{ ID501_14D, 0, 1, 0 },
	{ ID501_14E, 0, 1, 0 },

	{ ID501_15D, 0, 1, 0 },
	{ ID501_15E, 0, 1, 0 },

	{ ID501_16D, 0, 1, 0 },
	{ ID501_16E, 0, 1, 0 },

	{ ID501_17D, 0, 1, 0 },
	{ ID501_17E, 0, 1, 0 },

	{ ID501_18D, 0, 1, 0 },
	{ ID501_18E, 0, 1, 0 },

	{ ID501_19D, 0, 1, 0 },
	{ ID501_19E, 0, 1, 0 },

	{ 0, 0, 0, 0 }
};

static FCSUPDOWN_INFO FCS_Fhyo5_01[] = {
	{ ID501_1X  },
	{ ID501_2X  },
	{ ID501_3X  },
	{ ID501_4X  },
	{ ID501_5X  },
	{ ID501_6X  },
	{ ID501_7X  },
	{ ID501_8X  },
	{ ID501_9X  },
	{ ID501_10X },
	{ ID501_11X },
	{ ID501_12X },
	{ ID501_13X },
	{ ID501_14X },
	{ ID501_15X },
	{ ID501_16X },
	{ ID501_17X },
	{ ID501_18X },
	{ ID501_19X },

	{ ID501_1D  },
	{ ID501_2D  },
	{ ID501_3D  },
	{ ID501_4D  },
	{ ID501_5D  },
	{ ID501_6D  },
	{ ID501_7D  },
	{ ID501_8D  },
	{ ID501_9D  },
	{ ID501_10D },
	{ ID501_11D },
	{ ID501_12D },
	{ ID501_13D },
	{ ID501_14D },
	{ ID501_15D },
	{ ID501_16D },
	{ ID501_17D },
	{ ID501_18D },
	{ ID501_19D },

	{ ID501_1E  },
	{ ID501_2E  },
	{ ID501_3E  },
	{ ID501_4E  },
	{ ID501_5E  },
	{ ID501_6E  },
	{ ID501_7E  },
	{ ID501_8E  },
	{ ID501_9E  },
	{ ID501_10E },
	{ ID501_11E },
	{ ID501_12E },
	{ ID501_13E },
	{ ID501_14E },
	{ ID501_15E },
	{ ID501_16E },
	{ ID501_17E },
	{ ID501_18E },
	{ ID501_19E },

	{ ID501_1F  },
	{ ID501_2F  },
	{ ID501_3F  },
	{ ID501_4F  },
	{ ID501_5F  },
	{ ID501_6F  },
	{ ID501_7F  },
	{ ID501_8F  },
	{ ID501_9F  },
	{ ID501_10F },
	{ ID501_11F },
	{ ID501_12F },
	{ ID501_13F },
	{ ID501_14F },
	{ ID501_15F },
	{ ID501_16F },
	{ ID501_17F },
	{ ID501_18F },
	{ ID501_19F },

	{ ID501_7W  },
	{ ID501_8W  },
	{ ID501_9W  },
	{ ID501_10W },
	{ ID501_11W },
	{ ID501_12W }
};

#define		FCS_FHY5_01CNT	81
