#pragma once


#define ID102_1A	159		// 課税標準額 税率3%適用分   A
#define ID102_1B	160		// 課税標準額 税率4%適用分   B
#define ID102_1C	161		// 課税標準額 税率6.3%適用分 C
#define ID102_1X	162		// 課税標準額 旧税率分小計   X

#define ID102_1_1A	163		// 課税資産の譲渡等の対価の額 税率3%適用分   A
#define ID102_1_1B	164		// 課税資産の譲渡等の対価の額 税率4%適用分   B
#define ID102_1_1C	165		// 課税資産の譲渡等の対価の額 税率6.3%適用分 C
#define ID102_1_1X	166		// 課税資産の譲渡等の対価の額 旧税率分小計   X

#define ID102_1_2C	167		// 特定課税仕入に係る支払い対価の額 税率6.3%適用分 C
#define ID102_1_2X	168		// 特定課税仕入に係る支払い対価の額 旧税率分小計   X

#define ID102_2A	169		// 消費税額 税率3%適用分   A
#define ID102_2B	170		// 消費税額 税率4%適用分   B
#define ID102_2C	171		// 消費税額 税率6.3%適用分 C
#define ID102_2X	172		// 消費税額 旧税率分小計   X

#define ID102_3A	173		// 控除過大調整税額 税率3%適用分   A
#define ID102_3B	174		// 控除過大調整税額 税率4%適用分   B
#define ID102_3C	175		// 控除過大調整税額 税率6.3%適用分 C
#define ID102_3X	176		// 控除過大調整税額 旧税率分小計   X

#define ID102_4A	177		// 控除対象仕入税額 税率3%適用分   A
#define ID102_4B	178		// 控除対象仕入税額 税率4%適用分   B
#define ID102_4C	179		// 控除対象仕入税額 税率6.3%適用分 C
#define ID102_4X	180		// 控除対象仕入税額 旧税率分小計   X

#define ID102_5A	181		// 返還等対価に係る税額 税率3%適用分   A
#define ID102_5B	182		// 返還等対価に係る税額 税率4%適用分   B
#define ID102_5C	183		// 返還等対価に係る税額 税率6.3%適用分 C
#define ID102_5X	184		// 返還等対価に係る税額 旧税率分小計   X

#define ID102_5_1A	185		// 売上げの返還等対価に係る税額 税率3%適用分   A
#define ID102_5_1B	186		// 売上げの返還等対価に係る税額 税率4%適用分   B
#define ID102_5_1C	187		// 売上げの返還等対価に係る税額 税率6.3%適用分 C
#define ID102_5_1X	188		// 売上げの返還等対価に係る税額 旧税率分小計   X

#define ID102_5_2C	189		// 特定課税仕入れの返還等対価に係る税額 税率6.3%適用分 C
#define ID102_5_2X	190		// 特定課税仕入れの返還等対価に係る税額 旧税率分小計   X

#define ID102_6A	191		// 貸倒れに係る税額 税率3%適用分   A
#define ID102_6B	192		// 貸倒れに係る税額 税率4%適用分   B
#define ID102_6C	193		// 貸倒れに係る税額 税率6.3%適用分 C
#define ID102_6X	194		// 貸倒れに係る税額 旧税率分小計   X

#define ID102_7A	195		// 控除税額小計 税率3%適用分   A
#define ID102_7B	196		// 控除税額小計 税率4%適用分   B
#define ID102_7C	197		// 控除税額小計 税率6.3%適用分 C
#define ID102_7X	198		// 控除税額小計 旧税率分小計   X

#define ID102_8A	199		// 控除不足還付税額 税率3%適用分   A
#define ID102_8B	200		// 控除不足還付税額 税率4%適用分   B
#define ID102_8C	201		// 控除不足還付税額 税率6.3%適用分 C
#define ID102_8X	202		// 控除不足還付税額 旧税率分小計   X

#define ID102_9A	203		// 差引税額 税率3%適用分   A
#define ID102_9B	204		// 差引税額 税率4%適用分   B
#define ID102_9C	205		// 差引税額 税率6.3%適用分 C
#define ID102_9X	206		// 差引税額 旧税率分小計   X

#define ID102_11B	207		// 控除不足還付税額 税率4%適用分   B
#define ID102_11C	208		// 控除不足還付税額 税率6.3%適用分 C
#define ID102_11X	209		// 控除不足還付税額 旧税率分小計   X

#define ID102_12B	210		// 差引税額 税率4%適用分   B
#define ID102_12C	211		// 差引税額 税率6.3%適用分 C
#define ID102_12X	212		// 差引税額 旧税率分小計   X

#define ID102_13B	213		// 合計差引地方消費税の課税標準となる消費税額 税率4%適用分   B
#define ID102_13C	214		// 合計差引地方消費税の課税標準となる消費税額 税率6.3%適用分 C
#define ID102_13X	215		// 合計差引地方消費税の課税標準となる消費税額 旧税率分小計   X

#define ID102_14B	216		// 還付額 税率4%適用分   B
#define ID102_14C	217		// 還付額 税率6.3%適用分 C
#define ID102_14X	218		// 還付額 旧税率分小計   X

#define ID102_15B	219		// 納税額 税率4%適用分   B
#define ID102_15C	220		// 納税額 税率6.3%適用分 C
#define ID102_15X	221		// 納税額 旧税率分小計   X

static SH_ITEMINDEX Fhyo1_02[] = {

	{ ID102_1A, 0, 0, 0   },//yoshida190613 入力不可に
	{ ID102_1B, 0, 0, 0   },//yoshida190613 入力不可に
	{ ID102_1C, 0, 0, 0   },//yoshida190613 入力不可に

	{ ID102_1_1A, 0, 1, 0 },
	{ ID102_1_1B, 0, 1, 0 },
	{ ID102_1_1C, 0, 1, 0 },

	{ ID102_1_2C, 0, 1, 0 },

	{ ID102_2A, 0, 1, 0   },
	{ ID102_2B, 0, 1, 0   },
	{ ID102_2C, 0, 1, 0   },

	{ ID102_5A, 0, 0, 0   },//yoshida190622 入力不可に
	{ ID102_5B, 0, 0, 0   },//yoshida190622 入力不可に
	{ ID102_5C, 0, 0, 0   },//yoshida190622 入力不可に

	{ ID102_5_1A, 0, 1, 0 },
	{ ID102_5_1B, 0, 1, 0 },
	{ ID102_5_1C, 0, 1, 0 },

	{ ID102_5_2C, 0, 1, 0 },

	{ ID102_6A, 0, 1, 0   },
	{ ID102_6B, 0, 1, 0   },
	{ ID102_6C, 0, 1, 0   },

	{ 0, 0, 0, 0		  }

};

static FCSUPDOWN_INFO	FCS_Fhyo1_02[] = {
	
	{ ID102_1A   },
	{ ID102_1_1A },
	{ ID102_2A   },
	{ ID102_3A   },
	{ ID102_4A   },
	{ ID102_5A   },
	{ ID102_5_1A },
	{ ID102_6A   },
	{ ID102_7A   },
	{ ID102_8A   },
	{ ID102_9A   },
	
	{ ID102_1B   },
	{ ID102_1_1B },
	{ ID102_2B   },
	{ ID102_3B   },
	{ ID102_4B   },
	{ ID102_5B   },
	{ ID102_5_1B },
	{ ID102_6B   },
	{ ID102_7B   },
	{ ID102_8B   },
	{ ID102_9B   },
	{ ID102_11B  },
	{ ID102_12B  },
	{ ID102_13B  },
	{ ID102_14B  },
	{ ID102_15B  },
	
	{ ID102_1C   },
	{ ID102_1_1C },
	{ ID102_1_2C },
	{ ID102_2C   },
	{ ID102_3C   },
	{ ID102_4C   },
	{ ID102_5C   },
	{ ID102_5_1C },
	{ ID102_5_2C },
	{ ID102_6C   },
	{ ID102_7C   },
	{ ID102_8C   },
	{ ID102_9C   },
	{ ID102_11C  },
	{ ID102_12C  },
	{ ID102_13C  },
	{ ID102_14C  },
	{ ID102_15C  },

	{ ID102_1X   },
	{ ID102_1_1X },
	{ ID102_1_2X },
	{ ID102_2X   },
	{ ID102_3X   },
	{ ID102_4X   },
	{ ID102_5X   },
	{ ID102_5_1X },
	{ ID102_5_2X },
	{ ID102_6X   },
	{ ID102_7X   },
	{ ID102_8X   },
	{ ID102_9X   },
	{ ID102_11X  },
	{ ID102_12X  },
	{ ID102_13X  },
	{ ID102_14X  },
	{ ID102_15X  },
	
};

#define		FCS_FHY1_02CNT	62