#pragma once

#define ID503_1A 155	// 課税標準額に対する消費税額 税率6.24%適用分 A
#define ID503_1B 156	// 課税標準額に対する消費税額 税率7.8%適用分  B
#define ID503_1C 157	// 課税標準額に対する消費税額 合計            C

#define ID503_2A 158	// 貸倒回収に係る消費税額 税率6.24%適用分 A
#define ID503_2B 159	// 貸倒回収に係る消費税額 税率7.8%適用分  B
#define ID503_2C 160	// 貸倒回収に係る消費税額 合計            C

#define ID503_3A 161	// 売上対価の返還等に係る消費税額 税率6.24%適用分 A
#define ID503_3B 162	// 売上対価の返還等に係る消費税額 税率7.8%適用分  B
#define ID503_3C 163	// 売上対価の返還等に係る消費税額 合計            C

#define ID503_4A 164	// 控除対象仕入税額の計算の基礎となる消費税額 税率6.24%適用分 A
#define ID503_4B 165	// 控除対象仕入税額の計算の基礎となる消費税額 税率7.8%適用分  B
#define ID503_4C 166	// 控除対象仕入税額の計算の基礎となる消費税額 合計            C

#define ID503_5A 167	// ④×みなし仕入率 税率6.24%適用分 A
#define ID503_5B 168	// ④×みなし仕入率 税率7.8%適用分  B
#define ID503_5C 169	// ④×みなし仕入率 合計            C

#define ID503_6A 170	// 事業区分別の合計額 税率6.24%適用分 A
#define ID503_6B 171	// 事業区分別の合計額 税率7.8%適用分  B
#define ID503_6C 172	// 事業区分別の合計額 合計            C

#define ID503_7A 173	// 第一種事業(卸売業) 税率6.24%適用分 A
#define ID503_7B 174	// 第一種事業(卸売業) 税率7.8%適用分  B
#define ID503_7C 175	// 第一種事業(卸売業) 合計            C
#define ID503_7W 176	// 第一種事業(卸売業) 売上割合

#define ID503_8A 177	// 第二種事業(小売業) 税率6.24%適用分 A
#define ID503_8B 178	// 第二種事業(小売業) 税率7.8%適用分  B
#define ID503_8C 179	// 第二種事業(小売業) 合計            C
#define ID503_8W 180	// 第二種事業(小売業) 売上割合

#define ID503_9A 181	// 第三種事業(製造業等) 税率6.24%適用分 A
#define ID503_9B 182	// 第三種事業(製造業等) 税率7.8%適用分  B
#define ID503_9C 183	// 第三種事業(製造業等) 合計            C
#define ID503_9W 184	// 第三種事業(製造業等) 売上割合

#define ID503_10A 185	// 第四種事業(その他) 税率6.24%適用分 A
#define ID503_10B 186	// 第四種事業(その他) 税率7.8%適用分  B
#define ID503_10C 187	// 第四種事業(その他) 合計            C
#define ID503_10W 188	// 第四種事業(その他) 売上割合

#define ID503_11A 189	// 第五種事業(サービス業等) 税率6.24%適用分 A
#define ID503_11B 190	// 第五種事業(サービス業等) 税率7.8%適用分  B
#define ID503_11C 191	// 第五種事業(サービス業等) 合計            C
#define ID503_11W 192	// 第五種事業(サービス業等) 売上割合

#define ID503_12A 193	// 第六種事業(不動産業) 税率6.24%適用分 A
#define ID503_12B 194	// 第六種事業(不動産業) 税率7.8%適用分  B
#define ID503_12C 195	// 第六種事業(不動産業) 合計            C
#define ID503_12W 196	// 第六種事業(不動産業) 売上割合

#define ID503_13A 197	// 事業区分別の合計額 税率6.24%適用分 A
#define ID503_13B 198	// 事業区分別の合計額 税率7.8%適用分  B
#define ID503_13C 199	// 事業区分別の合計額 合計            C

#define ID503_14A 200	// 第一種事業(卸売業) 税率6.24%適用分 A
#define ID503_14B 201	// 第一種事業(卸売業) 税率7.8%適用分  B
#define ID503_14C 202	// 第一種事業(卸売業) 合計            C

#define ID503_15A 203	// 第二種事業(小売業) 税率6.24%適用分 A
#define ID503_15B 204	// 第二種事業(小売業) 税率7.8%適用分  B
#define ID503_15C 205	// 第二種事業(小売業) 合計            C

#define ID503_16A 206	// 第三種事業(製造業等) 税率6.24%適用分 A
#define ID503_16B 207	// 第三種事業(製造業等) 税率7.8%適用分  B
#define ID503_16C 208	// 第三種事業(製造業等) 合計            C

#define ID503_17A 209	// 第四種事業(その他) 税率6.24%適用分 A
#define ID503_17B 210	// 第四種事業(その他) 税率7.8%適用分  B
#define ID503_17C 211	// 第四種事業(その他) 合計            C

#define ID503_18A 212	// 第五種事業(サービス業等) 税率6.24%適用分 A
#define ID503_18B 213	// 第五種事業(サービス業等) 税率7.8%適用分  B
#define ID503_18C 214	// 第五種事業(サービス業等) 合計            C

#define ID503_19A 215	// 第六種事業(不動産業) 税率6.24%適用分 A
#define ID503_19B 216	// 第六種事業(不動産業) 税率7.8%適用分  B
#define ID503_19C 217	// 第六種事業(不動産業) 合計            C

static SH_ITEMINDEX Fhyo5_03[] = {
	{ ID503_6A, 0, 1, 0 },
	{ ID503_6B, 0, 1, 0 },

	{ ID503_7A, 0, 1, 0 },
	{ ID503_7B, 0, 1, 0 },

	{ ID503_8A, 0, 1, 0 },
	{ ID503_8B, 0, 1, 0 },

	{ ID503_9A, 0, 1, 0 },
	{ ID503_9B, 0, 1, 0 },

	{ ID503_10A, 0, 1, 0 },
	{ ID503_10B, 0, 1, 0 },

	{ ID503_11A, 0, 1, 0 },
	{ ID503_11B, 0, 1, 0 },

	{ ID503_12A, 0, 1, 0 },
	{ ID503_12B, 0, 1, 0 },

	{ ID503_14A, 0, 1, 0 },
	{ ID503_14B, 0, 1, 0 },

	{ ID503_15A, 0, 1, 0 },
	{ ID503_15B, 0, 1, 0 },

	{ ID503_16A, 0, 1, 0 },
	{ ID503_16B, 0, 1, 0 },

	{ ID503_17A, 0, 1, 0 },
	{ ID503_17B, 0, 1, 0 },

	{ ID503_18A, 0, 1, 0 },
	{ ID503_18B, 0, 1, 0 },

	{ ID503_19A, 0, 1, 0 },
	{ ID503_19B, 0, 1, 0 },

	{ 0, 0, 0, 0 }
};

static FCSUPDOWN_INFO FCS_Fhyo5_03[] = {
	{ ID503_1A  },
	{ ID503_2A  },
	{ ID503_3A  },
	{ ID503_4A  },
	{ ID503_5A  },
	{ ID503_6A  },
	{ ID503_7A  },
	{ ID503_8A  },
	{ ID503_9A  },
	{ ID503_10A },
	{ ID503_11A },
	{ ID503_12A },
	{ ID503_13A },
	{ ID503_14A },
	{ ID503_15A },
	{ ID503_16A },
	{ ID503_17A },
	{ ID503_18A },
	{ ID503_19A },

	{ ID503_1B  },
	{ ID503_2B  },
	{ ID503_3B  },
	{ ID503_4B  },
	{ ID503_5B  },
	{ ID503_6B  },
	{ ID503_7B  },
	{ ID503_8B  },
	{ ID503_9B  },
	{ ID503_10B },
	{ ID503_11B },
	{ ID503_12B },
	{ ID503_13B },
	{ ID503_14B },
	{ ID503_15B },
	{ ID503_16B },
	{ ID503_17B },
	{ ID503_18B },
	{ ID503_19B },

	{ ID503_1C  },
	{ ID503_2C  },
	{ ID503_3C  },
	{ ID503_4C  },
	{ ID503_5C  },
	{ ID503_6C  },
	{ ID503_7C  },
	{ ID503_8C  },
	{ ID503_9C  },
	{ ID503_10C },
	{ ID503_11C },
	{ ID503_12C },
	{ ID503_13C },
	{ ID503_14C },
	{ ID503_15C },
	{ ID503_16C },
	{ ID503_17C },
	{ ID503_18C },
	{ ID503_19C },

	{ ID503_7W  },
	{ ID503_8W  },
	{ ID503_9W  },
	{ ID503_10W },
	{ ID503_11W },
	{ ID503_12W }
};

#define		FCS_FHY5_03CNT	65
