#pragma once

/*#define ID5032_NO20_S   7	// 20の項目名　開始
#define ID5032_NO20_E   14	//			　 終了

#define ID5032_NO21_S	25
#define ID5032_NO21_E	27

#define ID5032_NO22_S	43
#define ID5032_NO22_E	49

#define ID5032_NO23_S	56
#define ID5032_NO23_E	62

#define ID5032_NO24_S	66
#define ID5032_NO24_E	72

#define ID5032_NO25_S	76
#define ID5032_NO25_E	82

#define ID5032_NO26_S	86
#define ID5032_NO26_E	92

#define ID5032_NO27_S	96
#define ID5032_NO27_E	102

#define ID5032_NO28_S	106
#define ID5032_NO28_E	112

#define ID5032_NO29_S	116
#define ID5032_NO29_E	122

#define ID5032_NO30_S	126
#define ID5032_NO30_E	132

#define ID5032_NO31_S	136
#define ID5032_NO31_E	142

#define ID5032_NO32_S	146
#define ID5032_NO32_E	152

#define ID5032_NO33_S	156
#define ID5032_NO33_E	162

#define ID5032_NO34_S	166
#define ID5032_NO34_E	172

#define ID5032_NO35_S	176
#define ID5032_NO35_E	182

#define ID5032_NO36_S	186
#define ID5032_NO36_E	192*/


#define ID5032_20A 210		// 4×みなし仕入率 税率6.24%適用分 A
#define ID5032_20B 211		// 4×みなし仕入率 税率7.8%適用分  B
#define ID5032_20C 212		// 4×みなし仕入率 合計            C

#define ID5032_21A 213		// 4×みなし仕入率 税率6.24%適用分 A
#define ID5032_21B 214		// 4×みなし仕入率 税率7.8%適用分  B
#define ID5032_21C 215		// 4×みなし仕入率 合計            C

#define ID5032_22A 216		// 第一種事業及び第二種事業 税率6.24%適用分 A
#define ID5032_22B 217		// 第一種事業及び第二種事業 税率7.8%適用分  B
#define ID5032_22C 218		// 第一種事業及び第二種事業 合計            C

#define ID5032_23A 219		// 第一種事業及び第三種事業 税率6.24%適用分 A
#define ID5032_23B 220		// 第一種事業及び第三種事業 税率7.8%適用分  B
#define ID5032_23C 221		// 第一種事業及び第三種事業 合計            C

#define ID5032_24A 222		// 第一種事業及び第四種事業 税率6.24%適用分 A
#define ID5032_24B 223		// 第一種事業及び第四種事業 税率7.8%適用分  B
#define ID5032_24C 224		// 第一種事業及び第四種事業 合計            C

#define ID5032_25A 225		// 第一種事業及び第五種事業 税率6.24%適用分 A
#define ID5032_25B 226		// 第一種事業及び第五種事業 税率7.8%適用分  B
#define ID5032_25C 227		// 第一種事業及び第五種事業 合計            C

#define ID5032_26A 228		// 第一種事業及び第六種事業 税率6.24%適用分 A
#define ID5032_26B 229		// 第一種事業及び第六種事業 税率7.8%適用分  B
#define ID5032_26C 230		// 第一種事業及び第六種事業 合計            C

#define ID5032_27A 231		// 第二種事業及び第三種事業 税率6.24%適用分 A
#define ID5032_27B 232		// 第二種事業及び第三種事業 税率7.8%適用分  B
#define ID5032_27C 233		// 第二種事業及び第三種事業 合計            C

#define ID5032_28A 234		// 第二種事業及び第四種事業 税率6.24%適用分 A
#define ID5032_28B 235		// 第二種事業及び第四種事業 税率7.8%適用分  B
#define ID5032_28C 236		// 第二種事業及び第四種事業 合計            C

#define ID5032_29A 237		// 第二種事業及び第五種事業 税率6.24%適用分 A
#define ID5032_29B 238		// 第二種事業及び第五種事業 税率7.8%適用分  B
#define ID5032_29C 239		// 第二種事業及び第五種事業 合計            C

#define ID5032_30A 240		// 第二種事業及び第六種事業 税率6.24%適用分 A
#define ID5032_30B 241		// 第二種事業及び第六種事業 税率7.8%適用分  B
#define ID5032_30C 242		// 第二種事業及び第六種事業 合計            C

#define ID5032_31A 243		// 第三種事業及び第四種事業 税率6.24%適用分 A
#define ID5032_31B 244		// 第三種事業及び第四種事業 税率7.8%適用分  B
#define ID5032_31C 245		// 第三種事業及び第四種事業 合計            C

#define ID5032_32A 246		// 第三種事業及び第五種事業 税率6.24%適用分 A
#define ID5032_32B 247		// 第三種事業及び第五種事業 税率7.8%適用分  B
#define ID5032_32C 248		// 第三種事業及び第五種事業 合計            C

#define ID5032_33A 249		// 第三種事業及び第六種事業 税率6.24%適用分 A
#define ID5032_33B 250		// 第三種事業及び第六種事業 税率7.8%適用分  B
#define ID5032_33C 251		// 第三種事業及び第六種事業 合計            C

#define ID5032_34A 252		// 第四種事業及び第五種事業 税率6.24%適用分 A
#define ID5032_34B 253		// 第四種事業及び第五種事業 税率7.8%適用分  B
#define ID5032_34C 254		// 第四種事業及び第五種事業 合計            C

#define ID5032_35A 255		// 第四種事業及び第六種事業 税率6.24%適用分 A
#define ID5032_35B 256		// 第四種事業及び第六種事業 税率7.8%適用分  B
#define ID5032_35C 257		// 第四種事業及び第六種事業 合計            C

#define ID5032_36A 258		// 第五種事業及び第六種事業 税率6.24%適用分 A
#define ID5032_36B 259		// 第五種事業及び第六種事業 税率7.8%適用分  B
#define ID5032_36C 260		// 第五種事業及び第六種事業 合計            C

#define ID5032_37A 261		// 選択可能な計算式区分の内から選択した金額 税率6.24%適用分 A
#define ID5032_37B 262		// 選択可能な計算式区分の内から選択した金額 税率7.8%適用分  B
#define ID5032_37C 263		// 選択可能な計算式区分の内から選択した金額 合計            C

//#define SELECTITEM 265		// 控除対象仕入税額の選択

static SH_ITEMINDEX Fhyo5_032[] = {
	{ ID5032_20A, 0, 1, 0 },
	{ ID5032_20B, 0, 1, 0 },
	{ ID5032_20C, 0, 1, 0 },

	{ ID5032_21A, 0, 1, 0 },
	{ ID5032_21B, 0, 1, 0 },
	{ ID5032_21C, 0, 1, 0 },

	{ ID5032_22A, 0, 1, 0 },
	{ ID5032_22B, 0, 1, 0 },
	{ ID5032_22C, 0, 1, 0 },

	{ ID5032_23A, 0, 1, 0 },
	{ ID5032_23B, 0, 1, 0 },
	{ ID5032_23C, 0, 1, 0 },

	{ ID5032_24A, 0, 1, 0 },
	{ ID5032_24B, 0, 1, 0 },
	{ ID5032_24C, 0, 1, 0 },

	{ ID5032_25A, 0, 1, 0 },
	{ ID5032_25B, 0, 1, 0 },
	{ ID5032_25C, 0, 1, 0 },

	{ ID5032_26A, 0, 1, 0 },
	{ ID5032_26B, 0, 1, 0 },
	{ ID5032_26C, 0, 1, 0 },

	{ ID5032_27A, 0, 1, 0 },
	{ ID5032_27B, 0, 1, 0 },
	{ ID5032_27C, 0, 1, 0 },

	{ ID5032_28A, 0, 1, 0 },
	{ ID5032_28B, 0, 1, 0 },
	{ ID5032_28C, 0, 1, 0 },

	{ ID5032_29A, 0, 1, 0 },
	{ ID5032_29B, 0, 1, 0 },
	{ ID5032_29C, 0, 1, 0 },

	{ ID5032_30A, 0, 1, 0 },
	{ ID5032_30B, 0, 1, 0 },
	{ ID5032_30C, 0, 1, 0 },

	{ ID5032_31A, 0, 1, 0 },
	{ ID5032_31B, 0, 1, 0 },
	{ ID5032_31C, 0, 1, 0 },

	{ ID5032_32A, 0, 1, 0 },
	{ ID5032_32B, 0, 1, 0 },
	{ ID5032_32C, 0, 1, 0 },

	{ ID5032_33A, 0, 1, 0 },
	{ ID5032_33B, 0, 1, 0 },
	{ ID5032_33C, 0, 1, 0 },

	{ ID5032_34A, 0, 1, 0 },
	{ ID5032_34B, 0, 1, 0 },
	{ ID5032_34C, 0, 1, 0 },

	{ ID5032_35A, 0, 1, 0 },
	{ ID5032_35B, 0, 1, 0 },
	{ ID5032_35C, 0, 1, 0 },

	{ ID5032_36A, 0, 1, 0 },
	{ ID5032_36B, 0, 1, 0 },
	{ ID5032_36C, 0, 1, 0 },

	{ 0, 0, 0, 0 }
};

static FCSUPDOWN_INFO FCS_Fhyo5_032[] = {
	{ ID5032_20A },
	{ ID5032_21A },
	{ ID5032_22A },
	{ ID5032_23A },
	{ ID5032_24A },
	{ ID5032_25A },
	{ ID5032_26A },
	{ ID5032_27A },
	{ ID5032_28A },
	{ ID5032_29A },
	{ ID5032_30A },
	{ ID5032_31A },
	{ ID5032_32A },
	{ ID5032_33A },
	{ ID5032_34A },
	{ ID5032_35A },
	{ ID5032_36A },
	{ ID5032_37A },

	{ ID5032_20B },
	{ ID5032_21B },
	{ ID5032_22B },
	{ ID5032_23B },
	{ ID5032_24B },
	{ ID5032_25B },
	{ ID5032_26B },
	{ ID5032_27B },
	{ ID5032_28B },
	{ ID5032_29B },
	{ ID5032_30B },
	{ ID5032_31B },
	{ ID5032_32B },
	{ ID5032_33B },
	{ ID5032_34B },
	{ ID5032_35B },
	{ ID5032_36B },
	{ ID5032_37B },

	{ ID5032_20C },
	{ ID5032_21C },
	{ ID5032_22C },
	{ ID5032_23C },
	{ ID5032_24C },
	{ ID5032_25C },
	{ ID5032_26C },
	{ ID5032_27C },
	{ ID5032_28C },
	{ ID5032_29C },
	{ ID5032_30C },
	{ ID5032_31C },
	{ ID5032_32C },
	{ ID5032_33C },
	{ ID5032_34C },
	{ ID5032_35C },
	{ ID5032_36C },
	{ ID5032_37C },
};

#define		FCS_FHY5_032CNT	53