#pragma once

#define	ID101_1X	156	//   課税標準額　旧税率分小計　X
#define	ID101_1D	157	//   課税標準額　税率6.24％適用分　D
#define	ID101_1E	158	//   課税標準額　税率7.8％適用分　E
#define	ID101_1F	159	//   課税標準額　合計 F

#define	ID101_1_1X	160	//   課税資産の譲渡等の対価の額　旧税率分小計　X
#define	ID101_1_1D	161	//   課税資産の譲渡等の対価の額　税率6.24％適用分　D
#define	ID101_1_1E	162	//   課税資産の譲渡等の対価の額　税率7.8％適用分　E
#define	ID101_1_1F	163	//   課税資産の譲渡等の対価の額　合計 F

#define	ID101_1_2X	164	//   特定課税仕入れに係る支払い対価の額　旧税率分小計　X
#define	ID101_1_2E	165	//   特定課税仕入れに係る支払い対価の額　税率7.8％適用分　E
#define	ID101_1_2F	166	//   特定課税仕入れに係る支払い対価の額　合計 F

#define	ID101_2X	167	//   消費税額　旧税率分小計　X
#define	ID101_2D	168	//   消費税額　税率6.24％適用分　D
#define	ID101_2E	169	//   消費税額　税率7.8％適用分　E
#define	ID101_2F	170	//   消費税額　合計 F

#define	ID101_3X	171	//   控除過大調整税額　旧税率分小計　X
#define	ID101_3D	172	//   控除過大調整税額　税率6.24％適用分　D
#define	ID101_3E	173	//   控除過大調整税額　税率7.8％適用分　E
#define	ID101_3F	174	//   控除過大調整税額　合計 F

#define	ID101_4X	175	//   控除対象仕入れ税額　旧税率分小計　X
#define	ID101_4D	176	//   控除対象仕入れ税額　税率6.24％適用分　D
#define	ID101_4E	177	//   控除対象仕入れ税額　税率7.8％適用分　E
#define	ID101_4F	178	//   控除対象仕入れ税額　合計 F

#define	ID101_5X	179	//   返還等対価に係る税額　旧税率分小計　X
#define	ID101_5D	180	//   返還等対価に係る税額　税率6.24％適用分　D
#define	ID101_5E	181	//   返還等対価に係る税額　税率7.8％適用分　E
#define	ID101_5F	182	//   返還等対価に係る税額　合計 F

#define	ID101_5_1X	183	//   売上げの返還等対価に係る税額　旧税率分小計　X
#define	ID101_5_1D	184	//   売上げの返還等対価に係る税額　税率6.24％適用分　D
#define	ID101_5_1E	185	//   売上げの返還等対価に係る税額　税率7.8％適用分　E
#define	ID101_5_1F	186	//   売上げの返還等対価に係る税額　合計 F

#define	ID101_5_2X	187	//   特定課税仕入れの返還等対価に係る税額　旧税率分小計　X
#define	ID101_5_2E	188	//   特定課税仕入れの返還等対価に係る税額　税率7.8％適用分　E
#define	ID101_5_2F	189	//   特定課税仕入れの返還等対価に係る税額　合計 F

#define	ID101_6X	190	//   貸倒れに係る税額　旧税率分小計　X
#define	ID101_6D	191	//   貸倒れに係る税額　税率6.24％適用分　D
#define	ID101_6E	192	//   貸倒れに係る税額　税率7.8％適用分　E
#define	ID101_6F	193	//   貸倒れに係る税額　合計 F

#define	ID101_7X	194	//   控除税額小計　旧税率分小計　X
#define	ID101_7D	195	//   控除税額小計　税率6.24％適用分　D
#define	ID101_7E	196	//   控除税額小計　税率7.8％適用分　E
#define	ID101_7F	197	//   控除税額小計　合計 F

#define	ID101_8X	198	//   控除不足還付税額　旧税率分小計　X
#define	ID101_8D	199	//   控除不足還付税額　税率6.24％適用分　D
#define	ID101_8E	200	//   控除不足還付税額　税率7.8％適用分　E
#define	ID101_8F	201	//   控除不足還付税額　合計 F

#define	ID101_9X	202	//   差引税額　旧税率分小計　X
#define	ID101_9D	203	//   差引税額　税率6.24％適用分　D
#define	ID101_9E	204	//   差引税額　税率7.8％適用分　E
#define	ID101_9F	205	//   差引税額　合計 F

#define	ID101_10F	206	//   合計差引税額　合計 F

#define	ID101_11X	207	//   控除不足還付税額　旧税率分小計　X
#define	ID101_11E	208	//   控除不足還付税額　税率7.8％適用分　E
#define	ID101_11F	209	//   控除不足還付税額　合計 F

#define	ID101_12X	210	//   差引税額　旧税率分小計　X
#define	ID101_12E	211	//   差引税額　税率7.8％適用分　E
#define	ID101_12F	212	//   差引税額　合計 F

#define	ID101_13X	213	//   合計差引地方消費税の課税標準となる消費税額　旧税率分小計　X
#define	ID101_13E	214	//   合計差引地方消費税の課税標準となる消費税額　税率7.8％適用分　E
#define	ID101_13F	215	//   合計差引地方消費税の課税標準となる消費税額　合計 F

#define	ID101_14X	216	//   還付額　旧税率分小計　X
#define	ID101_14E	217	//   還付額　税率7.8％適用分　E
#define	ID101_14F	218	//   還付額　合計 F

#define	ID101_15X	219	//   納税額　旧税率分小計　X
#define	ID101_15E	220	//   納税額　税率7.8％適用分　E
#define	ID101_15F	221	//   納税額　合計 F

#define	ID101_16F	222	//   合計差引譲渡割額　合計 F

// 付表１
static SH_ITEMINDEX	Fhyo1_01[]	=	{
//	{	ID101_1X, 0, 1, 0		},
	{	ID101_1D, 0, 0, 0		},//yoshida190613 入力不可に
	{	ID101_1E, 0, 0, 0		},//yoshida190613 入力不可に

//	{	ID101_1_1X, 0, 1, 0		},
	{	ID101_1_1D, 0, 1, 0		},
	{	ID101_1_1E, 0, 1, 0		},

//	{	ID101_1_2X, 0, 1, 0		},
	{	ID101_1_2E, 0, 1, 0		},

//	{	ID101_2X, 0, 1, 0		},
	{	ID101_2D, 0, 1, 0		},
	{	ID101_2E, 0, 1, 0		},

//	{	ID101_5X, 0, 1, 0		},
	{	ID101_5D, 0, 0, 0		},//yoshida190622 入力不可に
	{	ID101_5E, 0, 0, 0		},//yoshida190622 入力不可に

//	{	ID101_5_1X, 0, 1, 0		},
	{	ID101_5_1D, 0, 1, 0		},
	{	ID101_5_1E, 0, 1, 0		},

//	{	ID101_1_2X, 0, 1, 0		},
	{	ID101_5_2E, 0, 1, 0		},

//	{	ID101_6X, 0, 1, 0		},
	{	ID101_6D, 0, 1, 0		},
	{	ID101_6E, 0, 1, 0		},

	{	0,0,0,0				}
};

static FCSUPDOWN_INFO	FCS_Fhyo1_01[]	=	{
	{	ID101_1X 		},
	{	ID101_1_1X 		},
	{	ID101_1_2X 		},
	{	ID101_2X 		},
	{	ID101_3X 		},
	{	ID101_4X 		},
	{	ID101_5X 		},
	{	ID101_5_1X 		},
	{	ID101_5_2X 		},
	{	ID101_6X 		},
	{	ID101_7X 		},
	{	ID101_8X 		},
	{	ID101_9X 		},
	{	ID101_11X 		},
	{	ID101_12X 		},
	{	ID101_13X 		},
	{	ID101_14X 		},
	{	ID101_15X 		},
	
	{	ID101_1D 		},
	{	ID101_1_1D 		},
	{	ID101_2D 		},
	{	ID101_3D 		},
	{	ID101_4D 		},
	{	ID101_5D 		},
	{	ID101_5_1D 		},
	{	ID101_6D 		},
	{	ID101_7D 		},
	{	ID101_8D 		},
	{	ID101_9D 		},
	
	{	ID101_1E 		},
	{	ID101_1_1E 		},
	{	ID101_1_2E 		},
	{	ID101_2E 		},
	{	ID101_3E 		},
	{	ID101_4E 		},
	{	ID101_5E 		},
	{	ID101_5_1E 		},
	{	ID101_5_2E 		},
	{	ID101_6E 		},
	{	ID101_7E 		},
	{	ID101_8E 		},
	{	ID101_9E 		},
	{	ID101_11E 		},
	{	ID101_12E 		},
	{	ID101_13E 		},
	{	ID101_14E 		},
	{	ID101_15E 		},

	{	ID101_1F 		},
	{	ID101_1_1F 		},
	{	ID101_1_2F 		},
	{	ID101_2F 		},
	{	ID101_3F 		},
	{	ID101_4F 		},
	{	ID101_5F 		},
	{	ID101_5_1F 		},
	{	ID101_5_2F 		},
	{	ID101_6F 		},
	{	ID101_7F 		},
	{	ID101_8F 		},
	{	ID101_9F 		},
	{	ID101_10F 		},
	{	ID101_11F 		},
	{	ID101_12F 		},
	{	ID101_13F 		},
	{	ID101_14F 		},
	{	ID101_15F 		},
	{	ID101_16F 		}
	
};

#define		FCS_FHY1_01CNT	67
