#pragma once

#define ID502_1A 174	// 課税標準額に対する消費税額 旧税率分小計    A
#define ID502_1B 175	// 課税標準額に対する消費税額 税率6.24%適用分 B
#define ID502_1C 176	// 課税標準額に対する消費税額 税率7.8%適用分  C
#define ID502_1X 177	// 課税標準額に対する消費税額 合計            X

#define ID502_2A 178	// 貸倒回収に係る消費税額 旧税率分小計    A
#define ID502_2B 179	// 貸倒回収に係る消費税額 税率6.24%適用分 B
#define ID502_2C 180	// 貸倒回収に係る消費税額 税率7.8%適用分  C
#define ID502_2X 181	// 貸倒回収に係る消費税額 合計            X

#define ID502_3A 182	// 売上対価の返還等に係る消費税額 旧税率分小計    A
#define ID502_3B 183	// 売上対価の返還等に係る消費税額 税率6.24%適用分 B
#define ID502_3C 184	// 売上対価の返還等に係る消費税額 税率7.8%適用分  C
#define ID502_3X 185	// 売上対価の返還等に係る消費税額 合計            X

#define ID502_4A 186	// 控除対象仕入税額の計算の基礎となる消費税額 旧税率分小計    A
#define ID502_4B 187	// 控除対象仕入税額の計算の基礎となる消費税額 税率6.24%適用分 B
#define ID502_4C 188	// 控除対象仕入税額の計算の基礎となる消費税額 税率7.8%適用分  C
#define ID502_4X 189	// 控除対象仕入税額の計算の基礎となる消費税額 合計            X

#define ID502_5A 190	// ④×みなし仕入率 旧税率分小計    A
#define ID502_5B 191	// ④×みなし仕入率 税率6.24%適用分 B
#define ID502_5C 192	// ④×みなし仕入率 税率7.8%適用分  C
#define ID502_5X 193	// ④×みなし仕入率 合計            X

#define ID502_6A 194	// 事業区分別の合計額 旧税率分小計    A
#define ID502_6B 195	// 事業区分別の合計額 税率6.24%適用分 B
#define ID502_6C 196	// 事業区分別の合計額 税率7.8%適用分  C
#define ID502_6X 197	// 事業区分別の合計額 合計            X

#define ID502_7A 198	// 第一種事業(卸売業) 旧税率分小計    A
#define ID502_7B 199	// 第一種事業(卸売業) 税率6.24%適用分 B
#define ID502_7C 200	// 第一種事業(卸売業) 税率7.8%適用分  C
#define ID502_7X 201	// 第一種事業(卸売業) 合計            X

#define ID502_8A 202	// 第二種事業(小売業) 旧税率分小計    A
#define ID502_8B 203	// 第二種事業(小売業) 税率6.24%適用分 B
#define ID502_8C 204	// 第二種事業(小売業) 税率7.8%適用分  C
#define ID502_8X 205	// 第二種事業(小売業) 合計            X

#define ID502_9A 206	// 第三種事業(製造業等) 旧税率分小計    A
#define ID502_9B 207	// 第三種事業(製造業等) 税率6.24%適用分 B
#define ID502_9C 208	// 第三種事業(製造業等) 税率7.8%適用分  C
#define ID502_9X 209	// 第三種事業(製造業等) 合計            X

#define ID502_10A 210	// 第四種事業(その他) 旧税率分小計    A
#define ID502_10B 211	// 第四種事業(その他) 税率6.24%適用分 B
#define ID502_10C 212	// 第四種事業(その他) 税率7.8%適用分  C
#define ID502_10X 213	// 第四種事業(その他) 合計            X

#define ID502_11A 214	// 第五種事業(サービス業等) 旧税率分小計    A
#define ID502_11B 215	// 第五種事業(サービス業等) 税率6.24%適用分 B
#define ID502_11C 216	// 第五種事業(サービス業等) 税率7.8%適用分  C
#define ID502_11X 217	// 第五種事業(サービス業等) 合計            X

#define ID502_12A 218	// 第六種事業(不動産業) 旧税率分小計    A
#define ID502_12B 219	// 第六種事業(不動産業) 税率6.24%適用分 B
#define ID502_12C 220	// 第六種事業(不動産業) 税率7.8%適用分  C
#define ID502_12X 221	// 第六種事業(不動産業) 合計            X

#define ID502_13A 222	// 事業区分別の合計額 旧税率分小計    A
#define ID502_13B 223	// 事業区分別の合計額 税率6.24%適用分 B
#define ID502_13C 224	// 事業区分別の合計額 税率7.8%適用分  C
#define ID502_13X 225	// 事業区分別の合計額 合計            X

#define ID502_14A 226	// 第一種事業(卸売業) 旧税率分小計    A
#define ID502_14B 227	// 第一種事業(卸売業) 税率6.24%適用分 B
#define ID502_14C 228	// 第一種事業(卸売業) 税率7.8%適用分  C
#define ID502_14X 229	// 第一種事業(卸売業) 合計            X

#define ID502_15A 230	// 第二種事業(小売業) 旧税率分小計    A
#define ID502_15B 231	// 第二種事業(小売業) 税率6.24%適用分 B
#define ID502_15C 232	// 第二種事業(小売業) 税率7.8%適用分  C
#define ID502_15X 233	// 第二種事業(小売業) 合計            X

#define ID502_16A 234	// 第三種事業(製造業等) 旧税率分小計    A
#define ID502_16B 235	// 第三種事業(製造業等) 税率6.24%適用分 B
#define ID502_16C 236	// 第三種事業(製造業等) 税率7.8%適用分  C
#define ID502_16X 237	// 第三種事業(製造業等) 合計            X

#define ID502_17A 238	// 第四種事業(その他) 旧税率分小計    A
#define ID502_17B 239	// 第四種事業(その他) 税率6.24%適用分 B
#define ID502_17C 240	// 第四種事業(その他) 税率7.8%適用分  C
#define ID502_17X 241	// 第四種事業(その他) 合計            X

#define ID502_18A 242	// 第五種事業(サービス業等) 旧税率分小計    A
#define ID502_18B 243	// 第五種事業(サービス業等) 税率6.24%適用分 B
#define ID502_18C 244	// 第五種事業(サービス業等) 税率7.8%適用分  C
#define ID502_18X 245	// 第五種事業(サービス業等) 合計            X

#define ID502_19A 246	// 第六種事業(不動産業) 旧税率分小計    A
#define ID502_19B 247	// 第六種事業(不動産業) 税率6.24%適用分 B
#define ID502_19C 248	// 第六種事業(不動産業) 税率7.8%適用分  C
#define ID502_19X 249	// 第六種事業(不動産業) 合計            X

static SH_ITEMINDEX Fhyo5_02[] = {

	{ ID502_6A, 0, 1, 0 },
	{ ID502_6B, 0, 1, 0 },
	{ ID502_6C, 0, 1, 0 },

	{ ID502_7A, 0, 1, 0 },
	{ ID502_7B, 0, 1, 0 },
	{ ID502_7C, 0, 1, 0 },

	{ ID502_8A, 0, 1, 0 },
	{ ID502_8B, 0, 1, 0 },
	{ ID502_8C, 0, 1, 0 },

	{ ID502_9A, 0, 1, 0 },
	{ ID502_9B, 0, 1, 0 },
	{ ID502_9C, 0, 1, 0 },

	{ ID502_10A, 0, 1, 0 },
	{ ID502_10B, 0, 1, 0 },
	{ ID502_10C, 0, 1, 0 },

	{ ID502_11A, 0, 1, 0 },
	{ ID502_11B, 0, 1, 0 },
	{ ID502_11C, 0, 1, 0 },

	{ ID502_12A, 0, 1, 0 },
	{ ID502_12B, 0, 1, 0 },
	{ ID502_12C, 0, 1, 0 },

	{ ID502_14A, 0, 1, 0 },
	{ ID502_14B, 0, 1, 0 },
	{ ID502_14C, 0, 1, 0 },

	{ ID502_15A, 0, 1, 0 },
	{ ID502_15B, 0, 1, 0 },
	{ ID502_15C, 0, 1, 0 },

	{ ID502_16A, 0, 1, 0 },
	{ ID502_16B, 0, 1, 0 },
	{ ID502_16C, 0, 1, 0 },

	{ ID502_17A, 0, 1, 0 },
	{ ID502_17B, 0, 1, 0 },
	{ ID502_17C, 0, 1, 0 },

	{ ID502_18A, 0, 1, 0 },
	{ ID502_18B, 0, 1, 0 },
	{ ID502_18C, 0, 1, 0 },

	{ ID502_19A, 0, 1, 0 },
	{ ID502_19B, 0, 1, 0 },
	{ ID502_19C, 0, 1, 0 },

	{ 0, 0, 0, 0 }
};

static FCSUPDOWN_INFO FCS_Fhyo5_02[] = {
	{ ID502_1A  },
	{ ID502_2A  },
	{ ID502_3A  },
	{ ID502_4A  },
	{ ID502_5A  },
	{ ID502_6A  },
	{ ID502_7A  },
	{ ID502_8A  },
	{ ID502_9A  },
	{ ID502_10A },
	{ ID502_11A },
	{ ID502_12A },
	{ ID502_13A },
	{ ID502_14A },
	{ ID502_15A },
	{ ID502_16A },
	{ ID502_17A },
	{ ID502_18A },
	{ ID502_19A },

	{ ID502_1B  },
	{ ID502_2B  },
	{ ID502_3B  },
	{ ID502_4B  },
	{ ID502_5B  },
	{ ID502_6B  },
	{ ID502_7B  },
	{ ID502_8B  },
	{ ID502_9B  },
	{ ID502_10B },
	{ ID502_11B },
	{ ID502_12B },
	{ ID502_13B },
	{ ID502_14B },
	{ ID502_15B },
	{ ID502_16B },
	{ ID502_17B },
	{ ID502_18B },
	{ ID502_19B },

	{ ID502_1C  },
	{ ID502_2C  },
	{ ID502_3C  },
	{ ID502_4C  },
	{ ID502_5C  },
	{ ID502_6C  },
	{ ID502_7C  },
	{ ID502_8C  },
	{ ID502_9C  },
	{ ID502_10C },
	{ ID502_11C },
	{ ID502_12C },
	{ ID502_13C },
	{ ID502_14C },
	{ ID502_15C },
	{ ID502_16C },
	{ ID502_17C },
	{ ID502_18C },
	{ ID502_19C },

	{ ID502_1X  },
	{ ID502_2X  },
	{ ID502_3X  },
	{ ID502_4X  },
	{ ID502_5X  },
	{ ID502_6X  },
	{ ID502_7X  },
	{ ID502_8X  },
	{ ID502_9X  },
	{ ID502_10X },
	{ ID502_11X },
	{ ID502_12X },
	{ ID502_13X },
	{ ID502_14X },
	{ ID502_15X },
	{ ID502_16X },
	{ ID502_17X },
	{ ID502_18X },
	{ ID502_19X }

};

#define		FCS_FHY5_02CNT	75
