#pragma once

/*#define ID5012_NO20_S   8		// 20の項目名　開始
#define ID5012_NO20_E   15		//			　 終了

#define ID5012_NO21_S	28
#define ID5012_NO21_E	30

#define ID5012_NO22_S	50
#define ID5012_NO22_E	56

#define ID5012_NO23_S	65
#define ID5012_NO23_E	71

#define ID5012_NO24_S	76
#define ID5012_NO24_E	82

#define ID5012_NO25_S	87
#define ID5012_NO25_E	93

#define ID5012_NO26_S	98
#define ID5012_NO26_E	104

#define ID5012_NO27_S	109
#define ID5012_NO27_E	115

#define ID5012_NO28_S	120
#define ID5012_NO28_E	126

#define ID5012_NO29_S	131
#define ID5012_NO29_E	137

#define ID5012_NO30_S	142
#define ID5012_NO30_E	148

#define ID5012_NO31_S	153
#define ID5012_NO31_E	159

#define ID5012_NO32_S	164
#define ID5012_NO32_E	170

#define ID5012_NO33_S	175
#define ID5012_NO33_E	181

#define ID5012_NO34_S	186
#define ID5012_NO34_E	192

#define ID5012_NO35_S	197
#define ID5012_NO35_E	203

#define ID5012_NO36_S	208
#define ID5012_NO36_E	214*/

#define ID5012_20X 236		// 4×みなし仕入率 旧税率分小計    X
#define ID5012_20D 237		// 4×みなし仕入率 税率6.24%適用分 D
#define ID5012_20E 238		// 4×みなし仕入率 税率7.8%適用分  E
#define ID5012_20F 239		// 4×みなし仕入率 合計            F

#define ID5012_21X 240		// 4×みなし仕入率 旧税率分小計    X
#define ID5012_21D 241		// 4×みなし仕入率 税率6.24%適用分 D
#define ID5012_21E 242		// 4×みなし仕入率 税率7.8%適用分  E
#define ID5012_21F 243		// 4×みなし仕入率 合計            F

#define ID5012_22X 244		// 第一種事業及び第二種事業 旧税率分小計    X
#define ID5012_22D 245		// 第一種事業及び第二種事業 税率6.24%適用分 D
#define ID5012_22E 246		// 第一種事業及び第二種事業 税率7.8%適用分  E
#define ID5012_22F 247		// 第一種事業及び第二種事業 合計            F

#define ID5012_23X 248		// 第一種事業及び第三種事業 旧税率分小計    X
#define ID5012_23D 249		// 第一種事業及び第三種事業 税率6.24%適用分 D
#define ID5012_23E 250		// 第一種事業及び第三種事業 税率7.8%適用分  E
#define ID5012_23F 251		// 第一種事業及び第三種事業 合計            F

#define ID5012_24X 252		// 第一種事業及び第四種事業 旧税率分小計    X
#define ID5012_24D 253		// 第一種事業及び第四種事業 税率6.24%適用分 D
#define ID5012_24E 254		// 第一種事業及び第四種事業 税率7.8%適用分  E
#define ID5012_24F 255		// 第一種事業及び第四種事業 合計            F

#define ID5012_25X 256		// 第一種事業及び第五種事業 旧税率分小計    X
#define ID5012_25D 257		// 第一種事業及び第五種事業 税率6.24%適用分 D
#define ID5012_25E 258		// 第一種事業及び第五種事業 税率7.8%適用分  E
#define ID5012_25F 259		// 第一種事業及び第五種事業 合計            F

#define ID5012_26X 260		// 第一種事業及び第六種事業 旧税率分小計    X
#define ID5012_26D 261		// 第一種事業及び第六種事業 税率6.24%適用分 D
#define ID5012_26E 262		// 第一種事業及び第六種事業 税率7.8%適用分  E
#define ID5012_26F 263		// 第一種事業及び第六種事業 合計            F

#define ID5012_27X 264		// 第二種事業及び第三種事業 旧税率分小計    X
#define ID5012_27D 265		// 第二種事業及び第三種事業 税率6.24%適用分 D
#define ID5012_27E 266		// 第二種事業及び第三種事業 税率7.8%適用分  E
#define ID5012_27F 267		// 第二種事業及び第三種事業 合計            F

#define ID5012_28X 268		// 第二種事業及び第四種事業 旧税率分小計    X
#define ID5012_28D 269		// 第二種事業及び第四種事業 税率6.24%適用分 D
#define ID5012_28E 270		// 第二種事業及び第四種事業 税率7.8%適用分  E
#define ID5012_28F 271		// 第二種事業及び第四種事業 合計            F

#define ID5012_29X 272		// 第二種事業及び第五種事業 旧税率分小計    X
#define ID5012_29D 273		// 第二種事業及び第五種事業 税率6.24%適用分 D
#define ID5012_29E 274		// 第二種事業及び第五種事業 税率7.8%適用分  E
#define ID5012_29F 275		// 第二種事業及び第五種事業 合計            F

#define ID5012_30X 276		// 第二種事業及び第六種事業 旧税率分小計    X
#define ID5012_30D 277		// 第二種事業及び第六種事業 税率6.24%適用分 D
#define ID5012_30E 278		// 第二種事業及び第六種事業 税率7.8%適用分  E
#define ID5012_30F 279		// 第二種事業及び第六種事業 合計            F

#define ID5012_31X 280		// 第三種事業及び第四種事業 旧税率分小計    X
#define ID5012_31D 281		// 第三種事業及び第四種事業 税率6.24%適用分 D
#define ID5012_31E 282		// 第三種事業及び第四種事業 税率7.8%適用分  E
#define ID5012_31F 283		// 第三種事業及び第四種事業 合計            F

#define ID5012_32X 284		// 第三種事業及び第五種事業 旧税率分小計    X
#define ID5012_32D 285		// 第三種事業及び第五種事業 税率6.24%適用分 D
#define ID5012_32E 286		// 第三種事業及び第五種事業 税率7.8%適用分  E
#define ID5012_32F 287		// 第三種事業及び第五種事業 合計            F

#define ID5012_33X 288		// 第三種事業及び第六種事業 旧税率分小計    X
#define ID5012_33D 289		// 第三種事業及び第六種事業 税率6.24%適用分 D
#define ID5012_33E 290		// 第三種事業及び第六種事業 税率7.8%適用分  E
#define ID5012_33F 291		// 第三種事業及び第六種事業 合計            F

#define ID5012_34X 292		// 第四種事業及び第五種事業 旧税率分小計    X
#define ID5012_34D 293		// 第四種事業及び第五種事業 税率6.24%適用分 D
#define ID5012_34E 294		// 第四種事業及び第五種事業 税率7.8%適用分  E
#define ID5012_34F 295		// 第四種事業及び第五種事業 合計            F

#define ID5012_35X 296		// 第四種事業及び第六種事業 旧税率分小計    X
#define ID5012_35D 297		// 第四種事業及び第六種事業 税率6.24%適用分 D
#define ID5012_35E 298		// 第四種事業及び第六種事業 税率7.8%適用分  E
#define ID5012_35F 299		// 第四種事業及び第六種事業 合計            F

#define ID5012_36X 300		// 第五種事業及び第六種事業 旧税率分小計    X
#define ID5012_36D 301		// 第五種事業及び第六種事業 税率6.24%適用分 D
#define ID5012_36E 302		// 第五種事業及び第六種事業 税率7.8%適用分  E
#define ID5012_36F 303		// 第五種事業及び第六種事業 合計            F

#define ID5012_37X 304		// 選択可能な計算式区分の内から選択した金額 旧税率分小計    X
#define ID5012_37D 305		// 選択可能な計算式区分の内から選択した金額 税率6.24%適用分 D
#define ID5012_37E 306		// 選択可能な計算式区分の内から選択した金額 税率7.8%適用分  E
#define ID5012_37F 307		// 選択可能な計算式区分の内から選択した金額 合計            F

//#define SELECTITEM 309		// 控除対象仕入税額の選択

static SH_ITEMINDEX Fhyo5_012[] = {
	{ ID5012_20D, 0, 1, 0 },
	{ ID5012_20E, 0, 1, 0 },
	{ ID5012_20F, 0, 1, 0 },

	{ ID5012_21D, 0, 1, 0 },
	{ ID5012_21E, 0, 1, 0 },
	{ ID5012_21F, 0, 1, 0 },

	{ ID5012_22D, 0, 1, 0 },
	{ ID5012_22E, 0, 1, 0 },
	{ ID5012_22F, 0, 1, 0 },

	{ ID5012_23D, 0, 1, 0 },
	{ ID5012_23E, 0, 1, 0 },
	{ ID5012_23F, 0, 1, 0 },

	{ ID5012_24D, 0, 1, 0 },
	{ ID5012_24E, 0, 1, 0 },
	{ ID5012_24F, 0, 1, 0 },

	{ ID5012_25D, 0, 1, 0 },
	{ ID5012_25E, 0, 1, 0 },
	{ ID5012_25F, 0, 1, 0 },

	{ ID5012_26D, 0, 1, 0 },
	{ ID5012_26E, 0, 1, 0 },
	{ ID5012_26F, 0, 1, 0 },

	{ ID5012_27D, 0, 1, 0 },
	{ ID5012_27E, 0, 1, 0 },
	{ ID5012_27F, 0, 1, 0 },

	{ ID5012_28D, 0, 1, 0 },
	{ ID5012_28E, 0, 1, 0 },
	{ ID5012_28F, 0, 1, 0 },

	{ ID5012_29D, 0, 1, 0 },
	{ ID5012_29E, 0, 1, 0 },
	{ ID5012_29F, 0, 1, 0 },

	{ ID5012_30D, 0, 1, 0 },
	{ ID5012_30E, 0, 1, 0 },
	{ ID5012_30F, 0, 1, 0 },

	{ ID5012_31D, 0, 1, 0 },
	{ ID5012_31E, 0, 1, 0 },
	{ ID5012_31F, 0, 1, 0 },

	{ ID5012_32D, 0, 1, 0 },
	{ ID5012_32E, 0, 1, 0 },
	{ ID5012_32F, 0, 1, 0 },

	{ ID5012_33D, 0, 1, 0 },
	{ ID5012_33E, 0, 1, 0 },
	{ ID5012_33F, 0, 1, 0 },

	{ ID5012_34D, 0, 1, 0 },
	{ ID5012_34E, 0, 1, 0 },
	{ ID5012_34F, 0, 1, 0 },

	{ ID5012_35D, 0, 1, 0 },
	{ ID5012_35E, 0, 1, 0 },
	{ ID5012_35F, 0, 1, 0 },

	{ ID5012_36D, 0, 1, 0 },
	{ ID5012_36E, 0, 1, 0 },
	{ ID5012_36F, 0, 1, 0 },

	{ 0, 0, 0, 0 }
};

static FCSUPDOWN_INFO FCS_Fhyo5_012[] = {
	{ ID5012_20X },
	{ ID5012_21X },
	{ ID5012_22X },
	{ ID5012_23X },
	{ ID5012_24X },
	{ ID5012_25X },
	{ ID5012_26X },
	{ ID5012_27X },
	{ ID5012_28X },
	{ ID5012_29X },
	{ ID5012_30X },
	{ ID5012_31X },
	{ ID5012_32X },
	{ ID5012_33X },
	{ ID5012_34X },
	{ ID5012_35X },
	{ ID5012_36X },
	{ ID5012_37X },

	{ ID5012_20D },
	{ ID5012_21D },
	{ ID5012_22D },
	{ ID5012_23D },
	{ ID5012_24D },
	{ ID5012_25D },
	{ ID5012_26D },
	{ ID5012_27D },
	{ ID5012_28D },
	{ ID5012_29D },
	{ ID5012_30D },
	{ ID5012_31D },
	{ ID5012_32D },
	{ ID5012_33D },
	{ ID5012_34D },
	{ ID5012_35D },
	{ ID5012_36D },
	{ ID5012_37D },

	{ ID5012_20E },
	{ ID5012_21E },
	{ ID5012_22E },
	{ ID5012_23E },
	{ ID5012_24E },
	{ ID5012_25E },
	{ ID5012_26E },
	{ ID5012_27E },
	{ ID5012_28E },
	{ ID5012_29E },
	{ ID5012_30E },
	{ ID5012_31E },
	{ ID5012_32E },
	{ ID5012_33E },
	{ ID5012_34E },
	{ ID5012_35E },
	{ ID5012_36E },
	{ ID5012_37E },

	{ ID5012_20F },
	{ ID5012_21F },
	{ ID5012_22F },
	{ ID5012_23F },
	{ ID5012_24F },
	{ ID5012_25F },
	{ ID5012_26F },
	{ ID5012_27F },
	{ ID5012_28F },
	{ ID5012_29F },
	{ ID5012_30F },
	{ ID5012_31F },
	{ ID5012_32F },
	{ ID5012_33F },
	{ ID5012_34F },
	{ ID5012_35F },
	{ ID5012_36F },
	{ ID5012_37F },
};

#define		FCS_FHY5_012CNT	72
