#pragma once

/*#define ID5022_NO20_S   8	// 20の項目名　開始
#define ID5022_NO20_E   15	//			　 終了

#define ID5022_NO21_S	33
#define ID5022_NO21_E	35

#define ID5022_NO22_S	52
#define ID5022_NO22_E	58

#define ID5022_NO23_S	67
#define ID5022_NO23_E	73

#define ID5022_NO24_S	78
#define ID5022_NO24_E	84

#define ID5022_NO25_S	89
#define ID5022_NO25_E	95

#define ID5022_NO26_S	100
#define ID5022_NO26_E	106

#define ID5022_NO27_S	111
#define ID5022_NO27_E	117

#define ID5022_NO28_S	122
#define ID5022_NO28_E	128

#define ID5022_NO29_S	133
#define ID5022_NO29_E	139

#define ID5022_NO30_S	144
#define ID5022_NO30_E	150

#define ID5022_NO31_S	155
#define ID5022_NO31_E	161

#define ID5022_NO32_S	166
#define ID5022_NO32_E	172

#define ID5022_NO33_S	177
#define ID5022_NO33_E	183

#define ID5022_NO34_S	188
#define ID5022_NO34_E	194

#define ID5022_NO35_S	199
#define ID5022_NO35_E	205

#define ID5022_NO36_S	210
#define ID5022_NO36_E	216*/

#define ID5022_20A 238		// 4×みなし仕入率 旧税率分小計    A
#define ID5022_20B 239		// 4×みなし仕入率 税率6.24%適用分 B
#define ID5022_20C 240		// 4×みなし仕入率 税率7.8%適用分  C
#define ID5022_20X 241		// 4×みなし仕入率 合計            X

#define ID5022_21A 242		// 4×みなし仕入率 旧税率分小計    A
#define ID5022_21B 243		// 4×みなし仕入率 税率6.24%適用分 B
#define ID5022_21C 244		// 4×みなし仕入率 税率7.8%適用分  C
#define ID5022_21X 245		// 4×みなし仕入率 合計            X

#define ID5022_22A 246		// 第一種事業及び第二種事業 旧税率分小計    A
#define ID5022_22B 247		// 第一種事業及び第二種事業 税率6.24%適用分 B
#define ID5022_22C 248		// 第一種事業及び第二種事業 税率7.8%適用分  C
#define ID5022_22X 249		// 第一種事業及び第二種事業 合計            X

#define ID5022_23A 250		// 第一種事業及び第三種事業 旧税率分小計    A
#define ID5022_23B 251		// 第一種事業及び第三種事業 税率6.24%適用分 B
#define ID5022_23C 252		// 第一種事業及び第三種事業 税率7.8%適用分  C
#define ID5022_23X 253		// 第一種事業及び第三種事業 合計            X

#define ID5022_24A 254		// 第一種事業及び第四種事業 旧税率分小計    A
#define ID5022_24B 255		// 第一種事業及び第四種事業 税率6.24%適用分 B
#define ID5022_24C 256		// 第一種事業及び第四種事業 税率7.8%適用分  C
#define ID5022_24X 257		// 第一種事業及び第四種事業 合計            X

#define ID5022_25A 258		// 第一種事業及び第五種事業 旧税率分小計    A
#define ID5022_25B 259		// 第一種事業及び第五種事業 税率6.24%適用分 B
#define ID5022_25C 260		// 第一種事業及び第五種事業 税率7.8%適用分  C
#define ID5022_25X 261		// 第一種事業及び第五種事業 合計            X

#define ID5022_26A 262		// 第一種事業及び第六種事業 旧税率分小計    A
#define ID5022_26B 263		// 第一種事業及び第六種事業 税率6.24%適用分 B
#define ID5022_26C 264		// 第一種事業及び第六種事業 税率7.8%適用分  C
#define ID5022_26X 265		// 第一種事業及び第六種事業 合計            X

#define ID5022_27A 266		// 第二種事業及び第三種事業 旧税率分小計    A
#define ID5022_27B 267		// 第二種事業及び第三種事業 税率6.24%適用分 B
#define ID5022_27C 268		// 第二種事業及び第三種事業 税率7.8%適用分  C
#define ID5022_27X 269		// 第二種事業及び第三種事業 合計            X

#define ID5022_28A 270		// 第二種事業及び第四種事業 旧税率分小計    A
#define ID5022_28B 271		// 第二種事業及び第四種事業 税率6.24%適用分 B
#define ID5022_28C 272		// 第二種事業及び第四種事業 税率7.8%適用分  C
#define ID5022_28X 273		// 第二種事業及び第四種事業 合計            X

#define ID5022_29A 274		// 第二種事業及び第五種事業 旧税率分小計    A
#define ID5022_29B 275		// 第二種事業及び第五種事業 税率6.24%適用分 B
#define ID5022_29C 276		// 第二種事業及び第五種事業 税率7.8%適用分  C
#define ID5022_29X 277		// 第二種事業及び第五種事業 合計            X

#define ID5022_30A 278		// 第二種事業及び第六種事業 旧税率分小計    A
#define ID5022_30B 279		// 第二種事業及び第六種事業 税率6.24%適用分 B
#define ID5022_30C 280		// 第二種事業及び第六種事業 税率7.8%適用分  C
#define ID5022_30X 281		// 第二種事業及び第六種事業 合計            X

#define ID5022_31A 282		// 第三種事業及び第四種事業 旧税率分小計    A
#define ID5022_31B 283		// 第三種事業及び第四種事業 税率6.24%適用分 B
#define ID5022_31C 284		// 第三種事業及び第四種事業 税率7.8%適用分  C
#define ID5022_31X 285		// 第三種事業及び第四種事業 合計            X

#define ID5022_32A 286		// 第三種事業及び第五種事業 旧税率分小計    A
#define ID5022_32B 287		// 第三種事業及び第五種事業 税率6.24%適用分 B
#define ID5022_32C 288		// 第三種事業及び第五種事業 税率7.8%適用分  C
#define ID5022_32X 289		// 第三種事業及び第五種事業 合計            X

#define ID5022_33A 290		// 第三種事業及び第六種事業 旧税率分小計    A
#define ID5022_33B 291		// 第三種事業及び第六種事業 税率6.24%適用分 B
#define ID5022_33C 292		// 第三種事業及び第六種事業 税率7.8%適用分  C
#define ID5022_33X 293		// 第三種事業及び第六種事業 合計            X

#define ID5022_34A 294		// 第四種事業及び第五種事業 旧税率分小計    A
#define ID5022_34B 295		// 第四種事業及び第五種事業 税率6.24%適用分 B
#define ID5022_34C 296		// 第四種事業及び第五種事業 税率7.8%適用分  C
#define ID5022_34X 297		// 第四種事業及び第五種事業 合計            X

#define ID5022_35A 298		// 第四種事業及び第六種事業 旧税率分小計    A
#define ID5022_35B 299		// 第四種事業及び第六種事業 税率6.24%適用分 B
#define ID5022_35C 300		// 第四種事業及び第六種事業 税率7.8%適用分  C
#define ID5022_35X 301		// 第四種事業及び第六種事業 合計            X

#define ID5022_36A 302		// 第五種事業及び第六種事業 旧税率分小計    A
#define ID5022_36B 303		// 第五種事業及び第六種事業 税率6.24%適用分 B
#define ID5022_36C 304		// 第五種事業及び第六種事業 税率7.8%適用分  C
#define ID5022_36X 305		// 第五種事業及び第六種事業 合計            X

#define ID5022_37A 306		// 選択可能な計算式区分の内から選択した金額 旧税率分小計    A
#define ID5022_37B 307		// 選択可能な計算式区分の内から選択した金額 税率6.24%適用分 B
#define ID5022_37C 308		// 選択可能な計算式区分の内から選択した金額 税率7.8%適用分  C
#define ID5022_37X 309		// 選択可能な計算式区分の内から選択した金額 合計            X

//#define SELECTITEM 311		// 控除対象仕入税額の選択

static SH_ITEMINDEX Fhyo5_022[] = {
	{ ID5022_20A, 0, 1, 0 },
	{ ID5022_20B, 0, 1, 0 },
	{ ID5022_20C, 0, 1, 0 },
	{ ID5022_20X, 0, 1, 0 },

	{ ID5022_21A, 0, 1, 0 },
	{ ID5022_21B, 0, 1, 0 },
	{ ID5022_21C, 0, 1, 0 },
	{ ID5022_21X, 0, 1, 0 },

	{ ID5022_22A, 0, 1, 0 },
	{ ID5022_22B, 0, 1, 0 },
	{ ID5022_22C, 0, 1, 0 },
	{ ID5022_22X, 0, 1, 0 },
	{ ID5022_23A, 0, 1, 0 },
	{ ID5022_23B, 0, 1, 0 },
	{ ID5022_23C, 0, 1, 0 },
	{ ID5022_23X, 0, 1, 0 },
	{ ID5022_24A, 0, 1, 0 },
	{ ID5022_24B, 0, 1, 0 },
	{ ID5022_24C, 0, 1, 0 },
	{ ID5022_24X, 0, 1, 0 },
	{ ID5022_25A, 0, 1, 0 },
	{ ID5022_25B, 0, 1, 0 },
	{ ID5022_25C, 0, 1, 0 },
	{ ID5022_25X, 0, 1, 0 },
	{ ID5022_26A, 0, 1, 0 },
	{ ID5022_26B, 0, 1, 0 },
	{ ID5022_26C, 0, 1, 0 },
	{ ID5022_26X, 0, 1, 0 },
	{ ID5022_27A, 0, 1, 0 },
	{ ID5022_27B, 0, 1, 0 },
	{ ID5022_27C, 0, 1, 0 },
	{ ID5022_27X, 0, 1, 0 },
	{ ID5022_28A, 0, 1, 0 },
	{ ID5022_28B, 0, 1, 0 },
	{ ID5022_28C, 0, 1, 0 },
	{ ID5022_28X, 0, 1, 0 },
	{ ID5022_29A, 0, 1, 0 },
	{ ID5022_29B, 0, 1, 0 },
	{ ID5022_29C, 0, 1, 0 },
	{ ID5022_29X, 0, 1, 0 },
	{ ID5022_30A, 0, 1, 0 },
	{ ID5022_30B, 0, 1, 0 },
	{ ID5022_30C, 0, 1, 0 },
	{ ID5022_30X, 0, 1, 0 },
	{ ID5022_31A, 0, 1, 0 },
	{ ID5022_31B, 0, 1, 0 },
	{ ID5022_31C, 0, 1, 0 },
	{ ID5022_31X, 0, 1, 0 },
	{ ID5022_32A, 0, 1, 0 },
	{ ID5022_32B, 0, 1, 0 },
	{ ID5022_32C, 0, 1, 0 },
	{ ID5022_32X, 0, 1, 0 },
	{ ID5022_33A, 0, 1, 0 },
	{ ID5022_33B, 0, 1, 0 },
	{ ID5022_33C, 0, 1, 0 },
	{ ID5022_33X, 0, 1, 0 },
	{ ID5022_34A, 0, 1, 0 },
	{ ID5022_34B, 0, 1, 0 },
	{ ID5022_34C, 0, 1, 0 },
	{ ID5022_34X, 0, 1, 0 },
	{ ID5022_35A, 0, 1, 0 },
	{ ID5022_35B, 0, 1, 0 },
	{ ID5022_35C, 0, 1, 0 },
	{ ID5022_35X, 0, 1, 0 },
	{ ID5022_36A, 0, 1, 0 },
	{ ID5022_36B, 0, 1, 0 },
	{ ID5022_36C, 0, 1, 0 },
	{ ID5022_36X, 0, 1, 0 },

	{ 0, 0, 0, 0 }
};

static FCSUPDOWN_INFO FCS_Fhyo5_022[] = {
	{ ID5022_20A },
	{ ID5022_21A },
	{ ID5022_22A },
	{ ID5022_23A },
	{ ID5022_24A },
	{ ID5022_25A },
	{ ID5022_26A },
	{ ID5022_27A },
	{ ID5022_28A },
	{ ID5022_29A },
	{ ID5022_30A },
	{ ID5022_31A },
	{ ID5022_32A },
	{ ID5022_33A },
	{ ID5022_34A },
	{ ID5022_35A },
	{ ID5022_36A },
	{ ID5022_37A },

	{ ID5022_20B },
	{ ID5022_21B },
	{ ID5022_22B },
	{ ID5022_23B },
	{ ID5022_24B },
	{ ID5022_25B },
	{ ID5022_26B },
	{ ID5022_27B },
	{ ID5022_28B },
	{ ID5022_29B },
	{ ID5022_30B },
	{ ID5022_31B },
	{ ID5022_32B },
	{ ID5022_33B },
	{ ID5022_34B },
	{ ID5022_35B },
	{ ID5022_36B },
	{ ID5022_37B },

	{ ID5022_20C },
	{ ID5022_21C },
	{ ID5022_22C },
	{ ID5022_23C },
	{ ID5022_24C },
	{ ID5022_25C },
	{ ID5022_26C },
	{ ID5022_27C },
	{ ID5022_28C },
	{ ID5022_29C },
	{ ID5022_30C },
	{ ID5022_31C },
	{ ID5022_32C },
	{ ID5022_33C },
	{ ID5022_34C },
	{ ID5022_35C },
	{ ID5022_36C },
	{ ID5022_37C },

	{ ID5022_20X },
	{ ID5022_21X },
	{ ID5022_22X },
	{ ID5022_23X },
	{ ID5022_24X },
	{ ID5022_25X },
	{ ID5022_26X },
	{ ID5022_27X },
	{ ID5022_28X },
	{ ID5022_29X },
	{ ID5022_30X },
	{ ID5022_31X },
	{ ID5022_32X },
	{ ID5022_33X },
	{ ID5022_34X },
	{ ID5022_35X },
	{ ID5022_36X },
	{ ID5022_37X },
};

#define		FCS_FHY5_022CNT	72
