#pragma once

#define ID403_1A	98		// 課税標準額 税率6.24%適用分 A
#define ID403_1B	99		// 課税標準額 税率7.8%適用分  B
#define ID403_1C	100		// 課税標準額 合計            C

#define ID403_1_1A	101		// 課税資産の譲渡等の対価の額 税率6.24%適用分 A
#define ID403_1_1B	102		// 課税資産の譲渡等の対価の額 税率7.8%適用分  B
#define ID403_1_1C	103		// 課税資産の譲渡等の対価の額 合計            C

#define ID403_2A	104		// 消費税額 税率6.24%適用分 A
#define ID403_2B	105		// 消費税額 税率7.8%適用分  B
#define ID403_2C	106		// 消費税額 合計            C

#define ID403_3A	107		// 貸倒回収に係る消費税額 税率6.24%適用分 A
#define ID403_3B	108		// 貸倒回収に係る消費税額 税率7.8%適用分  B
#define ID403_3C	109		// 貸倒回収に係る消費税額 合計            C

#define ID403_4A	110		// 控除対象仕入れ税額 税率6.24%適用分 A
#define ID403_4B	111		// 控除対象仕入れ税額 税率7.8%適用分  B
#define ID403_4C	112		// 控除対象仕入れ税額 合計            C

#define ID403_5A	113		// 返還等対価に係る税額 税率6.24%適用分 A
#define ID403_5B	114		// 返還等対価に係る税額 税率7.8%適用分  B
#define ID403_5C	115		// 返還等対価に係る税額 合計            C

#define ID403_6A	116		// 貸倒れに係る税額 税率6.24%適用分 A
#define ID403_6B	117		// 貸倒れに係る税額 税率7.8%適用分  B
#define ID403_6C	118		// 貸倒れに係る税額 合計            C

#define ID403_7A	119		// 控除税額小計 税率6.24%適用分 A
#define ID403_7B	120		// 控除税額小計 税率7.8%適用分  B
#define ID403_7C	121		// 控除税額小計 合計            C

#define ID403_8C	122		// 控除不足還付税額 合計 C

#define ID403_9C	123		// 差引税額 合計 C

#define ID403_10C	124		// 地方消費税の課税標準となる消費税 控除不足還付税額 合計 C

#define ID403_11C	125		// 地方消費税の課税標準となる消費税 差引税額 合計 C

#define ID403_12C	126		// 譲渡割額 還付額 合計 C

#define ID403_13C	127		// 譲渡割額 納税額 合計 C


static SH_ITEMINDEX Fhyo4_03[] = {

	{ ID403_1A, 0, 0, 0 },
	{ ID403_1B, 0, 0, 0 },

	{ ID403_1_1A, 0, 1, 0 },
	{ ID403_1_1B, 0, 1, 0 },

	{ ID403_2A, 0, 1, 0 },
	{ ID403_2B, 0, 1, 0 },

	{ ID403_3A, 0, 1, 0 },
	{ ID403_3B, 0, 1, 0 },

	{ ID403_5A, 0, 1, 0 },
	{ ID403_5B, 0, 1, 0 },

	{ ID403_6A, 0, 1, 0 },
	{ ID403_6B, 0, 1, 0 },

	{ 0, 0, 0, 0 }
};

static FCSUPDOWN_INFO FCS_Fhyo4_03[] = {

	{ ID403_1A   },
	{ ID403_1_1A },
	{ ID403_2A   },
	{ ID403_3A   },
	{ ID403_4A   },
	{ ID403_5A   },
	{ ID403_6A   },
	{ ID403_7A   },

	{ ID403_1B   },
	{ ID403_1_1B },
	{ ID403_2B   },
	{ ID403_3B   },
	{ ID403_4B   },
	{ ID403_5B   },
	{ ID403_6B   },
	{ ID403_7B   },

	{ ID403_1C   },
	{ ID403_1_1C },
	{ ID403_2C   },
	{ ID403_3C   },
	{ ID403_4C   },
	{ ID403_5C   },
	{ ID403_6C   },
	{ ID403_7C   },
	{ ID403_8C   },
	{ ID403_9C   },
	{ ID403_10C  },
	{ ID403_11C  },
	{ ID403_12C  },
	{ ID403_13C  },

};

#define FCS_FHY4_03CNT	30