#pragma once

#define	ID501_1A		50 //1. （税率６．２４％）調整前の課税仕入れ等の税額の合計額
#define	ID501_2A		51 //2. （税率６．２４％）課税仕入れ等（税率６．２４％）のみに使途が特定されている特定収入
#define	ID501_3A		52 //3. （税率６．２４％）２×６．２４／１０８
#define	ID501_6A		53 //6. （税率６．２４％）１－３
#define	ID501_7_bunshi  48 //7. 　調整割合（計算表４４）　分子
#define	ID501_7_bunbo   49 //7.   調整割合（計算表４４）　分母
#define	ID501_8A		54 //8. （税率６．２４％）３×７（１円未満の端数切捨て）
#define	ID501_9A		55 //9. （税率６．２４％）特定収入に係る課税仕入れ等の税額（３＋８）
#define	ID501_10A		56 //10.（税率６．２４％）控除対象仕入税額（１－９）

#define	ID501_1B		57 //1. （税率７．８％）調整前の課税仕入れ等の税額の合計額
#define	ID501_4B		58 //4. （税率７．８％）課税仕入れ等（税率７．８％）のみに使途が特定されている特定収入
#define	ID501_5B		59 //5. （税率７．８％）４×７．８／１１０
#define ID501_6B		60 //6. （税率７．８％）１－５
#define ID501_8B		61 //8. （税率７．８％）３×７（１円未満の端数切捨て）
#define	ID501_9B		62 //9. （税率７．８％）特定収入に係る課税仕入れ等の税額（５＋８）
#define	ID501_10B		63 //10.（税率７．８％）控除対象仕入税額（１－９）
