#pragma once
//-----------------------------------------------------------------------------
// 計算表１：インデックスファイル
//-----------------------------------------------------------------------------

#define	ID101_1A 36		// 1A.課税売上（免税・非課税売上・値引を含まない）６．２４％ [SpKzur]
#define	ID101_2A 37		// 2A.課税売上（免税・非課税売上・値引を含まない）６．２４％ [SpKzur]
#define	ID101_1B 38		// 1B.課税売上（免税・非課税売上・値引を含まない）７．８％	 [SpKzur]
#define	ID101_2B 39 	// 2B.課税売上（免税・非課税売上・値引を含まない）７．８％	 [SpKzur]
#define	ID101_1C 40		// 1C.課税売上（免税・非課税売上・値引を含まない）合計　　　 [SpKzur]
#define	ID101_2C 41		// 2C.課税売上（免税・非課税売上・値引を含まない）合計　　　 [SpKzur]
#define ID101_3C 42     // 3C.免税売上                                               [SpMzur]
#define ID101_4C 43     // 4C.非課税売上（有価証券を金額で含む）                     [SpHkur]
#define ID101_5C 44     // 5C.国外における資産の譲渡等の対価の額                     [SpKgjt]
#define ID101_6C 45     // 6C.資産の譲渡等の対価の額の合計額                         [SpTuwb]


//入力の可不可
//｛インデックス、連動時、非連動時、確定時入力不可｝
SH_ITEMINDEX Specific1_31Ex[] = {
{	ID101_1A,	0, 1, 0		},
{	ID101_2A,	0, 1, 0		},
{	ID101_1B,	0, 1, 0		},
{	ID101_2B,	0, 1, 0		},
{	ID101_3C,	0, 1, 0		},
{	ID101_4C,	0, 1, 0		},//4Cは非連動時のみ入力可
{	ID101_5C,	1, 1, 0		},//5Cは連動時、非連動時に入力可
{	       0,	0, 0, 0		}//この構造体の終わりを示している
};

//入力ボックスのインデックス
//縦方向
static FCSUPDOWN_INFO	FCS_Specific1_31Ex[] = {
{	ID101_1A 		},
{	ID101_2A 		},
{	ID101_1B 		},
{	ID101_2B 		},
{	ID101_1C 		},
{	ID101_2C 		},
{	ID101_3C 		},
{	ID101_4C 		},
{	ID101_5C 		},
{	ID101_6C 		}
};
//横方向
static FCSUPDOWN_INFO	FCS_Specific1_31Ex_LR[] = {
{	ID101_1A 		},
{	ID101_2A 		},
{	ID101_1B 		},
{	ID101_2B 		},
{	ID101_1C 		},
{	ID101_2C 		},
{	ID101_3C 		},
{	ID101_4C 		},
{	ID101_5C 		},
{	ID101_6C 		}
};


//入力ボックスの数
#define		FCS_SPECIFIC1CNT	10