//yokono
#pragma once

#define	ID202_1ITEM 56		// 1行目　内容
#define	ID202_1KEI1 57		// 1行目　課税仕入等に係る特定収入４％
#define	ID202_1G 58			// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID202_1H 59			// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H
#define	ID202_1KEI2 60		// 1行目　課税仕入等に係る特定収入６．３％
#define	ID202_1I 61			// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　I
#define	ID202_1J 62			// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　J

#define	ID202_2ITEM 63		// 2行目　内容
#define	ID202_2KEI1 64		// 2行目　課税仕入等に係る特定収入４％
#define	ID202_2G 65			// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID202_2H 66			// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H
#define	ID202_2KEI2 67		// 2行目　課税仕入等に係る特定収入６．３％
#define	ID202_2I 68			// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　I
#define	ID202_2J 69			// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　J

#define	ID202_3ITEM 70		// 3行目　内容
#define	ID202_3KEI1 71		// 3行目　課税仕入等に係る特定収入４％
#define	ID202_3G 72			// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID202_3H 73			// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H
#define	ID202_3KEI2 74		// 3行目　課税仕入等に係る特定収入６．３％
#define	ID202_3I 75			// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　I
#define	ID202_3J 76			// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　J

#define	ID202_4ITEM 77		// 4行目　内容
#define	ID202_4KEI1 78		// 4行目　課税仕入等に係る特定収入４％
#define	ID202_4G 79			// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID202_4H 80			// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H
#define	ID202_4KEI2 81		// 4行目　課税仕入等に係る特定収入６．３％
#define	ID202_4I 82			// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　I
#define	ID202_4J 83			// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　J

#define	ID202_5ITEM 84		// 5行目　内容
#define	ID202_5KEI1 85		// 5行目　課税仕入等に係る特定収入４％
#define	ID202_5G 86			// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID202_5H 87			// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H
#define	ID202_5KEI2 88		// 5行目　課税仕入等に係る特定収入６．３％
#define	ID202_5I 89			// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　I
#define	ID202_5J 90			// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　J

#define	ID202_6ITEM 91		// 6行目　内容
#define	ID202_6KEI1 92		// 6行目　課税仕入等に係る特定収入４％
#define	ID202_6G 93			// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID202_6H 94			// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H
#define	ID202_6KEI2 95		// 6行目　課税仕入等に係る特定収入６．３％
#define	ID202_6I 96			// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　I
#define	ID202_6J 97			// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　J

#define	ID202_7ITEM 98		// 7行目　内容
#define	ID202_7KEI1 99		// 7行目　課税仕入等に係る特定収入４％
#define	ID202_7G 100		// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID202_7H 101		// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H
#define	ID202_7KEI2 102		// 7行目　課税仕入等に係る特定収入６．３％
#define	ID202_7I 103		// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　I
#define	ID202_7J 104		// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　J

#define	ID202_17KEI1 8		//課税仕入等に係る特定収入４％　 合計
#define	ID202_17G 9			//課税売上にのみ要する課税仕入れ等に特定されている特定収入　G 合計
#define	ID202_17H 10		//課税売上にのみ要する課税仕入れ等に特定されている特定収入　H 合計
#define	ID202_17KEI2 11		//課税仕入等に係る特定収入６．３％　 合計
#define	ID202_17I 12		//課税売上にのみ要する課税仕入れ等に特定されている特定収入　I 合計
#define	ID202_17J 13		//課税売上にのみ要する課税仕入れ等に特定されている特定収入　J 合計


SH_ITEMINDEX	Specific22_31[]	=	{
{	ID202_1G,	0, 1, 0		},
{	ID202_1H,	0, 1, 0		},
{	ID202_1I,	0, 1, 0		},
{	ID202_1J,	0, 1, 0		},

{	ID202_2G,	0, 1, 0		},
{	ID202_2H,	0, 1, 0		},
{	ID202_2I,	0, 1, 0		},
{	ID202_2J,	0, 1, 0		},

{	ID202_3G,	0, 1, 0		},
{	ID202_3H,	0, 1, 0		},
{	ID202_3I,	0, 1, 0		},
{	ID202_3J,	0, 1, 0		},

{	ID202_4G,	0, 1, 0		},
{	ID202_4H,	0, 1, 0		},
{	ID202_4I,	0, 1, 0		},
{	ID202_4J,	0, 1, 0		},

{	ID202_5G,	0, 1, 0		},
{	ID202_5H,	0, 1, 0		},
{	ID202_5I,	0, 1, 0		},
{	ID202_5J,	0, 1, 0		},

{	ID202_6G,	0, 1, 0		},
{	ID202_6H,	0, 1, 0		},
{	ID202_6I,	0, 1, 0		},
{	ID202_6J,	0, 1, 0		},

{	ID202_7G,	0, 1, 0		},
{	ID202_7H,	0, 1, 0		},
{	ID202_7I,	0, 1, 0		},
{	ID202_7J,	0, 1, 0		},

{	   0,	0, 0, 0		}
};


static FCSUPDOWN_INFO	FCS_Specific22_31[]	=	{

{	ID202_1G	},
{	ID202_2G	},
{	ID202_3G	},
{	ID202_4G	},
{	ID202_5G	},
{	ID202_6G	},
{	ID202_7G	},

{	ID202_1H	},
{	ID202_2H	},
{	ID202_3H	},
{	ID202_4H	},
{	ID202_5H	},
{	ID202_6H	},
{	ID202_7H	},

{	ID202_1I	},
{	ID202_2I	},
{	ID202_3I	},
{	ID202_4I	},
{	ID202_5I	},
{	ID202_6I	},
{	ID202_7I	},

{	ID202_1J	},
{	ID202_2J	},
{	ID202_3J	},
{	ID202_4J	},
{	ID202_5J	},
{	ID202_6J	},
{	ID202_7J	},
};

static FCSUPDOWN_INFO	FCS_Specific22_31_LR[]	=	{
{	ID202_1G	},
{	ID202_1H	},
{	ID202_1I	},
{	ID202_1J	},

{	ID202_2G	},
{	ID202_2H	},
{	ID202_2I	},
{	ID202_2J	},

{	ID202_3G	},
{	ID202_3H	},
{	ID202_3I	},
{	ID202_3J	},

{	ID202_4G	},
{	ID202_4H	},
{	ID202_4I	},
{	ID202_4J	},

{	ID202_5G	},
{	ID202_5H	},
{	ID202_5I	},
{	ID202_5J	},

{	ID202_6G	},
{	ID202_6H	},
{	ID202_6I	},
{	ID202_6J	},

{	ID202_7G	},
{	ID202_7H	},
{	ID202_7I	},
{	ID202_7J	},
};

#define		FCS_SPECIFIC22CNT	28
