#pragma once
//yokono 
//-----------------------------------------------------------------------------
// 計算表１：インデックスファイル
//-----------------------------------------------------------------------------

#define	ID101_1A 50		// 1A.課税売上（免税・非課税売上・値引を含まない）４％		[SpKzur]
#define	ID101_2A 51		// 2A.課税売上（免税・非課税売上・値引を含まない）４％		[SpKzur]
#define	ID101_1B 52		// 1B.課税売上（免税・非課税売上・値引を含まない）６．３％	[SpKzur]
#define	ID101_2B 53 	// 2B.課税売上（免税・非課税売上・値引を含まない）６．３％	[SpKzur]
#define	ID101_1C 54		// 1C.課税売上（免税・非課税売上・値引を含まない）６．２４％[SpKzur]
#define	ID101_2C 55		// 2C.課税売上（免税・非課税売上・値引を含まない）６．２４％[SpKzur]
#define ID101_1D 56     // 1D.課税売上（免税・非課税売上・値引を含まない）７．８％  [SpKzur]
#define ID101_2D 57     // 2D.課税売上（免税・非課税売上・値引を含まない）７．８％  [SpKzur]
#define ID101_1E 58     // 1E.課税売上（免税・非課税売上・値引を含まない）合計      [SpKzur]
#define ID101_2E 59     // 2E.課税売上（免税・非課税売上・値引を含まない）合計      [SpKzur]
#define	ID101_3E 60		// 3E.免税売上                                              [SpMzur]
#define	ID101_4E 61		// 4E.非課税売上（有価証券を金額で含む）                    [SpHkur]
#define	ID101_5E 62		// 5E.国外における資産の譲渡等の対価の額                    [SpKgjt]
#define	ID101_6E 63		// 6E.資産の譲渡等の対価の額の合計額                        [SpTuwb]

//入力の可不可
//｛インデックス、連動時、非連動時、確定時入力不可｝
SH_ITEMINDEX	Specific1_31[]	=	{
{	ID101_1A,	0, 1, 0		},//1Aは連動時、非連動時、確定時すべて入力不可
{	ID101_2A,	0, 1, 0		},//2Aは連動時、非連動時、確定時すべて入力不可
{	ID101_1B,	0, 1, 0		},//...
{	ID101_2B,	0, 1, 0		},
{	ID101_1C,	0, 1, 0		},
{	ID101_2C,	0, 1, 0		},
{	ID101_1D,	0, 1, 0		},
{	ID101_2D,	0, 1, 0		},
//{	ID101_1E,	0, 0, 0		},
//{	ID101_2E,	0, 0, 0		},
{	ID101_3E,	0, 1, 0		},
{	ID101_4E,	0, 1, 0		},//4Eは非連動時のみ入力可
{	ID101_5E,	1, 1, 0		},//5Eは連動時、非連動時に入力可
{	   0,	0, 0, 0		}//この構造体の終わりを示している
};

//入力ボックスのインデックス
//縦方向
static FCSUPDOWN_INFO	FCS_Specific1_31[]	=	{
{	ID101_1A 		},
{	ID101_2A 		},
{	ID101_1B 		},
{	ID101_2B 		},
{	ID101_1C 		},
{	ID101_2C 		},
{	ID101_1D 		},
{	ID101_2D 		},
{	ID101_1E 		},
{	ID101_2E 		},
{	ID101_3E 		},
{	ID101_4E 		},
{	ID101_5E 		},
{	ID101_6E 		}
};
//横方向
static FCSUPDOWN_INFO	FCS_Specific1_31_LR[]	=	{
{	ID101_1A 		},
{	ID101_2A 		},
{	ID101_1B 		},
{	ID101_2B 		},
{	ID101_1C 		},
{	ID101_2C 		},
{	ID101_1D 		},
{	ID101_2D 		},
{	ID101_1E 		},
{	ID101_2E 		},
{	ID101_3E 		},
{	ID101_4E 		},
{	ID101_5E 		},
{	ID101_6E 		}
};

//入力ボックスの数
#define		FCS_SPECIFIC1CNT	14

