#pragma once


#define ID503_1A		60  //1.    （税率６．２４％）調整前の課税仕入れ等の税額の合計額
#define ID503_2A		61  //2.    （税率６．２４％）課税仕入れ等（税率６．２４％）にのみ使途が特定されている特定収入
#define ID503_3A		62  //3.    （税率６．２４％）２×６．２４／１０８
#define ID503_6_bunshi  56  //6.     課税売上割合 分子
#define ID503_6_bunbo   57  //6.     課税売上割合 分母
#define ID503_7A		63  //7.    （税率６．２４％）３×６
#define ID503_8A		64  //8.    （税率６．２４％）１－７ 
#define ID503_9_bunshi  58  //9.     調整割合（計算表４④）　分子
#define ID503_9_bunbo   59  //9.     調整割合（計算表４④）　分母
#define ID503_10A		65  //10.   （税率６．２４％）８×９（１円未満の端数切捨て）
#define ID503_11A		66  //11.   （税率６．２４％）特定収入に係る課税仕入れ等の税額	（７＋１０）
#define ID503_12A		67  //12.   （税率６．２４％）控除対象仕入税額（１－１１）

#define ID503_1B		68  //1.    （税率７．８％）調整前の課税仕入れ等の税額の合計額
#define ID503_4B		69  //4.    （税率７．８％）課税仕入れ等（税率７．８％）にのみ使途が特定されている特定収入
#define ID503_5B		70  //5.    （税率７．８％）４×７．８／１１０
#define ID503_7B		71  //7.    （税率７．８％）５×６
#define ID503_8B		72  //8.    （税率７．８％）１－７
#define ID503_10B		73  //10.   （税率７．８％）８×９（１円未満の端数切捨て）
#define ID503_11B		74  //11.   （税率７．８％）特定収入に係る課税仕入れ等の税額	（７＋１０）
#define ID503_12B		75  //12.   （税率７．８％）控除対象仕入税額（１－１１）


#define ID503_6_wariai  79  //6.     課税売上割合