#pragma once


#define ID503_1A		64  //1.    iÅ—¦‚UD‚Q‚S“j’²®‘O‚Ì‰ÛÅd“ü‚ê“™‚ÌÅŠz‚Ì‡ŒvŠz
#define ID503_2A		65  //2.    iÅ—¦‚UD‚Q‚S“j‰ÛÅd“ü‚ê“™iÅ—¦‚UD‚Q‚S“j‚É‚Ì‚İg“r‚ª“Á’è‚³‚ê‚Ä‚¢‚é“Á’èû“ü
#define ID503_3A		66  //3.    iÅ—¦‚UD‚Q‚S“j‚Q~‚UD‚Q‚S^‚P‚O‚W
#define ID503_6_bunshi  60  //6.     ‰ÛÅ”„ãŠ„‡ •ªq
#define ID503_6_bunbo   61  //6.     ‰ÛÅ”„ãŠ„‡ •ª•ê
#define ID503_7A		67  //7.    iÅ—¦‚UD‚Q‚S“j‚R~‚U
#define ID503_8A		68  //8.    iÅ—¦‚UD‚Q‚S“j‚P|‚V 
#define ID503_9_bunshi  62  //9.     ’²®Š„‡iŒvZ•\‚S‡Cj@•ªq
#define ID503_9_bunbo   63  //9.     ’²®Š„‡iŒvZ•\‚S‡Cj@•ª•ê
#define ID503_10A		69  //10.   iÅ—¦‚UD‚Q‚S“j‚W~‚Xi‚P‰~–¢–‚Ì’[”ØÌ‚Äj
#define ID503_11A		70  //11.   iÅ—¦‚UD‚Q‚S“j“Á’èû“ü‚ÉŒW‚é‰ÛÅd“ü‚ê“™‚ÌÅŠz	i‚V{‚P‚Oj
#define ID503_12A		71  //12.   iÅ—¦‚UD‚Q‚S“jTœ‘ÎÛŠOd“ü‚ê‚ÉŒW‚é’²®Šz‚Ì‡ŒvŠz
#define ID503_13A		72  //13.	iÅ—¦‚UD‚Q‚S“jTœ‘ÎÛd“üÅŠzi‚P{‚P‚Q|‚P‚Pj

#define ID503_1B		73  //1.    iÅ—¦‚VD‚W“j’²®‘O‚Ì‰ÛÅd“ü‚ê“™‚ÌÅŠz‚Ì‡ŒvŠz
#define ID503_4B		74  //4.    iÅ—¦‚VD‚W“j‰ÛÅd“ü‚ê“™iÅ—¦‚VD‚W“j‚É‚Ì‚İg“r‚ª“Á’è‚³‚ê‚Ä‚¢‚é“Á’èû“ü
#define ID503_5B		75  //5.    iÅ—¦‚VD‚W“j‚S~‚VD‚W^‚P‚P‚O
#define ID503_7B		76  //7.    iÅ—¦‚VD‚W“j‚T~‚U
#define ID503_8B		77  //8.    iÅ—¦‚VD‚W“j‚P|‚V
#define ID503_10B		78  //10.   iÅ—¦‚VD‚W“j‚W~‚Xi‚P‰~–¢–‚Ì’[”ØÌ‚Äj
#define ID503_11B		79  //11.   iÅ—¦‚VD‚W“j“Á’èû“ü‚ÉŒW‚é‰ÛÅd“ü‚ê“™‚ÌÅŠz	i‚V{‚P‚Oj
#define ID503_12B		80  //12.   iÅ—¦‚VD‚W“jTœ‘ÎÛŠOd“ü‚ê‚ÉŒW‚é’²®Šz‚Ì‡ŒvŠz
#define ID503_13B		81  //13.   iÅ—¦‚VD‚W“jTœ‘ÎÛd“üÅŠzi‚P{‚P‚Q|‚P‚Pj

#define ID503_6_wariai  85  //6.     ‰ÛÅ”„ãŠ„‡