#pragma once

#define	ID502_1_bunshi		10  //1. 取戻し対象特定収入のあった課税期間の調整割合　分子
#define	ID502_1_bunbo		11  //1. 取戻し対象特定収入のあった課税期間の調整割合　分母
#define	ID502_2_bunshi		12  //2. １－［１］　分子
#define	ID502_2_bunbo		13  //2. １－［１］　分母

#define	ID502_3A			43  //3. （税率６．２４％）控除対象外仕入れに係る支払対価の額の合計額
#define	ID502_4A			44  //4. （税率６．２４％）３×６．２４／１０８
#define	ID502_7A			45  //7. （税率６．２４％）控除対象外仕入れに係る調整額

#define	ID502_5B			46  //5. （税率７．８％）控除対象外仕入れに係る支払対価の額の合計額
#define	ID502_6B			47  //6. （税率７．８％）５×７．８／１１０
#define	ID502_7B			48  //7. （税率７．８％）控除対象外仕入れに係る調整額

#define	ID502_8A			87  //8. （税率６．２４％）28年改正法附則第52条第1項(80%控除)の適用を受ける控除対象外仕入れに係る支払対価の額(税率6.24%)の合計額
#define	ID502_9A			88  //9. （税率６．２４％）８×６．２４／１０８
#define	ID502_12A			89  //12.（税率６．２４％）９×２
#define	ID502_13A			90  //13.（税率６．２４％）控除対象外仕入れに係る調整額

#define	ID502_10B			91  //10.（税率７．８％）28年改正法附則第52条第1項(50%控除)の適用を受ける控除対象外仕入れに係る支払対価の額(税率7.8%)の合計額
#define	ID502_11B			92  //11.（税率７．８％）１０×７．８／１１０
#define	ID502_12B			93  //12.（税率７．８％）１１×２
#define	ID502_13B			94  //13.（税率７．８％）控除対象外仕入れに係る調整額

#define	ID502_14A			132 //14.（税率６．２４％）28年改正法附則第53条第1項(50%控除)の適用を受ける控除対象外仕入れに係る支払対価の額(税率6.24%)の合計額
#define	ID502_15A			133 //15.（税率６．２４％）１４×６．２４／１０８
#define	ID502_18A			134 //18.（税率６．２４％）１５×２
#define	ID502_19A			135 //19.（税率６．２４％）控除対象外仕入れに係る調整額

#define	ID502_16B			136 //16.（税率７．８％）28年改正法附則第53条第1項(50%控除)の適用を受ける控除対象外仕入れに係る支払対価の額(税率7.8%)の合計額
#define	ID502_17B			137 //17.（税率７．８％）１６×７．８／１１０
#define	ID502_18B			138 //18.（税率７．８％）１７×２
#define	ID502_19B			139 //19.（税率７．８％）控除対象外仕入れに係る調整額


#define	ID502_20A			147 //20.（税率６．２４％）控除対象外仕入れに係る調整額の合計額

#define	ID502_20B			148 //20.（税率７．８％）控除対象外仕入れに係る調整額の合計額


//入力の可不可
//｛インデックス、連動時、非連動時、確定時入力不可｝
SH_ITEMINDEX Specific52_2_31[] = {
{	ID502_1_bunshi	,1, 1, 0		},
{	ID502_1_bunbo	,1, 1, 0		},
{	ID502_2_bunshi	,0, 0, 0		},
{	ID502_2_bunbo	,0, 0, 0		},
{	ID502_3A		,1, 1, 0		},
{	ID502_4A		,1, 1, 0		},
{	ID502_7A		,0, 0, 0		},
{	ID502_5B		,1, 1, 0		},
{	ID502_6B		,1, 1, 0		},
{	ID502_7B		,0, 0, 0		},
{	ID502_8A		,1, 1, 0		},
{	ID502_9A		,1, 1, 0		},
{	ID502_12A		,0, 0, 0		},
{	ID502_13A		,0, 0, 0		},
{	ID502_10B		,1, 1, 0		},
{	ID502_11B		,1, 1, 0		},
{	ID502_12B		,0, 0, 0		},
{	ID502_13B		,0, 0, 0		},
{	ID502_14A		,1, 1, 0		},
{	ID502_15A		,1, 1, 0		},
{	ID502_18A		,0, 0, 0		},
{	ID502_19A		,0, 0, 0		},
{	ID502_16B		,1, 1, 0		},
{	ID502_17B		,1, 1, 0		},
{	ID502_18B		,0, 0, 0		},
{	ID502_19B		,0, 0, 0		},
{	ID502_20A		,0, 0, 0		},
{	ID502_20B		,0, 0, 0		},
{					 0,	0, 0, 0		}//この構造体の終わりを示している
};

//入力ボックスのインデックス
//縦方向
static FCSUPDOWN_INFO	FCS_Specific52_2_31[] = {
{	ID502_1_bunshi			},
{	ID502_1_bunbo			},
{	ID502_3A				},
{	ID502_4A				},
{	ID502_5B				},
{	ID502_6B				},
{	ID502_8A				},
{	ID502_9A				},
{	ID502_10B				},
{	ID502_11B				},
{	ID502_14A				},
{	ID502_15A				},
{	ID502_16B				},
{	ID502_17B				}
};
//横方向
static FCSUPDOWN_INFO	FCS_Specific52_2_31_LR[] = {
{	ID502_1_bunshi			},
{	ID502_1_bunbo			},
{	ID502_3A				},
{	ID502_4A				},
{	ID502_5B				},
{	ID502_6B				},
{	ID502_8A				},
{	ID502_9A				},
{	ID502_10B				},
{	ID502_11B				},
{	ID502_14A				},
{	ID502_15A				},
{	ID502_16B				},
{	ID502_17B				}
};

//入力ボックスの数
#define		FCS_SPECIFIC1CNT	14
