#pragma once

#define	ID501_1A		54 //1. （税率６．２４％）調整前の課税仕入れ等の税額の合計額
#define	ID501_2A		55 //2. （税率６．２４％）課税仕入れ等（税率６．２４％）のみに使途が特定されている特定収入
#define	ID501_3A		56 //3. （税率６．２４％）２×６．２４／１０８
#define	ID501_6A		57 //6. （税率６．２４％）１－３、１－５
#define	ID501_7_bunshi  52 //7. 　調整割合（計算表４４）　分子
#define	ID501_7_bunbo   53 //7.   調整割合（計算表４４）　分母
#define	ID501_8A		58 //8. （税率６．２４％）６×７（１円未満の端数切捨て）
#define	ID501_9A		59 //9. （税率６．２４％）特定収入に係る課税仕入れ等の税額（３＋８、５＋８）
#define	ID501_10A		60 //10.（税率６．２４％）控除対象外仕入れに係る調整額の合計額
#define	ID501_11A		61 //11.（税率６．２４％）控除対象仕入税額（１＋１０－９）

#define	ID501_1B		62 //1. （税率７．８％）調整前の課税仕入れ等の税額の合計額
#define	ID501_4B		63 //4. （税率７．８％）課税仕入れ等（税率７．８％）のみに使途が特定されている特定収入
#define	ID501_5B		64 //5. （税率７．８％）４×７．８／１１０
#define ID501_6B		65 //6. （税率７．８％）１－３、１－５
#define ID501_8B		66 //8. （税率７．８％）６×７（１円未満の端数切捨て）
#define	ID501_9B		67 //9. （税率７．８％）特定収入に係る課税仕入れ等の税額（３＋８、５＋８）
#define	ID501_10B		68 //10.（税率７．８％）控除対象外仕入れに係る調整額の合計額
#define	ID501_11B		69 //11.（税率７．８％）控除対象仕入税額（１＋１０－９）
