#pragma once

#define	ID2022_1ITEM 56		// 1行目　内容
#define	ID2022_1KEI1 57		// 1行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_1E	 58		// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2022_1F	 59		// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2022_1KEI2 60		// 1行目　課税仕入等に係る特定収入７．８％
#define	ID2022_1G	 61		// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2022_1H	 62		// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2022_2ITEM 63		// 2行目　内容
#define	ID2022_2KEI1 64		// 2行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_2E	 65		// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2022_2F	 66		// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2022_2KEI2 67		// 2行目　課税仕入等に係る特定収入７．８％
#define	ID2022_2G	 68		// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2022_2H	 69		// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2022_3ITEM 70		// 3行目　内容
#define	ID2022_3KEI1 71		// 3行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_3E	 72		// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2022_3F	 73		// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2022_3KEI2 74		// 3行目　課税仕入等に係る特定収入７．８％
#define	ID2022_3G	 75		// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2022_3H	 76		// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2022_4ITEM 77		// 4行目　内容
#define	ID2022_4KEI1 78		// 4行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_4E	 79		// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2022_4F	 80		// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2022_4KEI2 81		// 4行目　課税仕入等に係る特定収入７．８％
#define	ID2022_4G	 82		// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2022_4H	 83		// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2022_5ITEM 84		// 5行目　内容
#define	ID2022_5KEI1 85		// 5行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_5E	 86		// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2022_5F	 87		// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2022_5KEI2 88		// 5行目　課税仕入等に係る特定収入７．８％
#define	ID2022_5G	 89		// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2022_5H	 90		// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2022_6ITEM 91		// 6行目　内容
#define	ID2022_6KEI1 92		// 6行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_6E	 93		// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2022_6F	 94		// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2022_6KEI2 95		// 6行目　課税仕入等に係る特定収入７．８％
#define	ID2022_6G	 96		// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2022_6H	 97		// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2022_7ITEM 98		// 7行目　内容
#define	ID2022_7KEI1 99		// 7行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_7E	 100	// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　E
#define	ID2022_7F	 101	// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　F
#define	ID2022_7KEI2 102	// 7行目　課税仕入等に係る特定収入７．８％
#define	ID2022_7G	 103	// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　G
#define	ID2022_7H	 104	// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　H

#define	ID2022_17KEI1 8		//課税仕入等に係る特定収入６．２４％　 合計
#define	ID2022_17E	  9		//課税売上にのみ要する課税仕入れ等に特定されている特定収入　E 合計
#define	ID2022_17F	  10	//課税売上にのみ要する課税仕入れ等に特定されている特定収入　F 合計
#define	ID2022_17KEI2 11	//課税仕入等に係る特定収入７．８％　 合計
#define	ID2022_17G	  12	//課税売上にのみ要する課税仕入れ等に特定されている特定収入　G 合計
#define	ID2022_17H	  13	//課税売上にのみ要する課税仕入れ等に特定されている特定収入　H 合計


SH_ITEMINDEX	Specific22_2_31Ex[] = {
{	ID2022_1E,	0, 1, 0		},
{	ID2022_1F,	0, 1, 0		},
{	ID2022_1G,	0, 1, 0		},
{	ID2022_1H,	0, 1, 0		},

{	ID2022_2E,	0, 1, 0		},
{	ID2022_2F,	0, 1, 0		},
{	ID2022_2G,	0, 1, 0		},
{	ID2022_2H,	0, 1, 0		},

{	ID2022_3E,	0, 1, 0		},
{	ID2022_3F,	0, 1, 0		},
{	ID2022_3G,	0, 1, 0		},
{	ID2022_3H,	0, 1, 0		},

{	ID2022_4E,	0, 1, 0		},
{	ID2022_4F,	0, 1, 0		},
{	ID2022_4G,	0, 1, 0		},
{	ID2022_4H,	0, 1, 0		},

{	ID2022_5E,	0, 1, 0		},
{	ID2022_5F,	0, 1, 0		},
{	ID2022_5G,	0, 1, 0		},
{	ID2022_5H,	0, 1, 0		},

{	ID2022_6E,	0, 1, 0		},
{	ID2022_6F,	0, 1, 0		},
{	ID2022_6G,	0, 1, 0		},
{	ID2022_6H,	0, 1, 0		},

{	ID2022_7E,	0, 1, 0		},
{	ID2022_7F,	0, 1, 0		},
{	ID2022_7G,	0, 1, 0		},
{	ID2022_7H,	0, 1, 0		},

{	        0,	0, 0, 0		}
};


static FCSUPDOWN_INFO	FCS_Specific22_2_31Ex[] = {

{	ID2022_1E	},
{	ID2022_2E	},
{	ID2022_3E	},
{	ID2022_4E	},
{	ID2022_5E	},
{	ID2022_6E	},
{	ID2022_7E	},

{	ID2022_1F	},
{	ID2022_2F	},
{	ID2022_3F	},
{	ID2022_4F	},
{	ID2022_5F	},
{	ID2022_6F	},
{	ID2022_7F	},

{	ID2022_1G	},
{	ID2022_2G	},
{	ID2022_3G	},
{	ID2022_4G	},
{	ID2022_5G	},
{	ID2022_6G	},
{	ID2022_7G	},

{	ID2022_1H	},
{	ID2022_2H	},
{	ID2022_3H	},
{	ID2022_4H	},
{	ID2022_5H	},
{	ID2022_6H	},
{	ID2022_7H	},
};

static FCSUPDOWN_INFO	FCS_Specific22_2_31Ex_LR[] = {
{	ID2022_1E	},
{	ID2022_1F	},
{	ID2022_1G	},
{	ID2022_1H	},

{	ID2022_2E	},
{	ID2022_2F	},
{	ID2022_2G	},
{	ID2022_2H	},

{	ID2022_3E	},
{	ID2022_3F	},
{	ID2022_3G	},
{	ID2022_3H	},

{	ID2022_4E	},
{	ID2022_4F	},
{	ID2022_4G	},
{	ID2022_4H	},

{	ID2022_5E	},
{	ID2022_5F	},
{	ID2022_5G	},
{	ID2022_5H	},

{	ID2022_6E	},
{	ID2022_6F	},
{	ID2022_6G	},
{	ID2022_6H	},

{	ID2022_7E	},
{	ID2022_7F	},
{	ID2022_7G	},
{	ID2022_7H	},
};


#define		FCS_SPECIFIC22CNT	28
