#pragma once


#define	ID201_1ITEM 63	// 1行目　内容
#define	ID201_1KEI 64	// 1行目　資産の譲渡等の対価以外の収入
#define	ID201_1A 65	// 1行目　左のうち特定収入　A
#define	ID201_1B 66	// 1行目　課税仕入れ等に係る特定収入　B　４％
#define	ID201_1C 67	// 1行目　課税仕入れ等に係る特定収入　C　６．３％
#define	ID201_1D 68	// 1行目　課税仕入れ等に係る特定収入　D　６．２４％
#define	ID201_1E 69	// 1行目　課税仕入れ等に係る特定収入　E　７．８％
#define	ID201_1F 70	// 1行目　A－（B＋C＋D＋E)の金額　F

#define	ID201_2ITEM 71	// 2行目　内容
#define	ID201_2KEI 72	// 2行目　資産の譲渡等の対価以外の収入
#define	ID201_2A 73	// 2行目　左のうち特定収入　A
#define	ID201_2B 74	// 2行目　課税仕入れ等に係る特定収入　B　４％
#define	ID201_2C 75	// 2行目　課税仕入れ等に係る特定収入　C　６．３％
#define	ID201_2D 76	// 2行目　課税仕入れ等に係る特定収入　D　６．２４％
#define	ID201_2E 77	// 2行目　課税仕入れ等に係る特定収入　E　７．８％
#define	ID201_2F 78	// 2行目　A－（B＋C＋D＋E)の金額　F

#define	ID201_3ITEM 79	// 3行目　内容
#define	ID201_3KEI 80	// 3行目　資産の譲渡等の対価以外の収入
#define	ID201_3A 81	// 3行目　左のうち特定収入　A
#define	ID201_3B 82	// 3行目　課税仕入れ等に係る特定収入　B　４％
#define	ID201_3C 83	// 3行目　課税仕入れ等に係る特定収入　C　６．３％
#define	ID201_3D 84	// 3行目　課税仕入れ等に係る特定収入　D　６．２４％
#define	ID201_3E 85	// 3行目　課税仕入れ等に係る特定収入　E　７．８％
#define	ID201_3F 86	// 3行目　A－（B＋C＋D＋E)の金額　F

#define	ID201_4ITEM 87	// 4行目　内容
#define	ID201_4KEI 88	// 4行目　資産の譲渡等の対価以外の収入
#define	ID201_4A 89	// 4行目　左のうち特定収入　A
#define	ID201_4B 90	// 4行目　課税仕入れ等に係る特定収入　B　４％
#define	ID201_4C 91	// 4行目　課税仕入れ等に係る特定収入　C　６．３％
#define	ID201_4D 92	// 4行目　課税仕入れ等に係る特定収入　D　６．２４％
#define	ID201_4E 93	// 4行目　課税仕入れ等に係る特定収入　E　７．８％
#define	ID201_4F 94	// 4行目　A－（B＋C＋D＋E)の金額　F

#define	ID201_5ITEM 95	// 5行目　内容
#define	ID201_5KEI 96	// 5行目　資産の譲渡等の対価以外の収入
#define	ID201_5A 97	// 5行目　左のうち特定収入　A
#define	ID201_5B 98	// 5行目　課税仕入れ等に係る特定収入　B　４％
#define	ID201_5C 99	// 5行目　課税仕入れ等に係る特定収入　C　６．３％
#define	ID201_5D 100	// 5行目　課税仕入れ等に係る特定収入　D　６．２４％
#define	ID201_5E 101	// 5行目　課税仕入れ等に係る特定収入　E　７．８％
#define	ID201_5F 102	// 5行目　A－（B＋C＋D＋E)の金額　F

#define	ID201_6ITEM 103	// 6行目　内容
#define	ID201_6KEI 104	// 6行目　資産の譲渡等の対価以外の収入
#define	ID201_6A 105	// 6行目　左のうち特定収入　A
#define	ID201_6B 106	// 6行目　課税仕入れ等に係る特定収入　B　４％
#define	ID201_6C 107	// 6行目　課税仕入れ等に係る特定収入　C　６．３％
#define	ID201_6D 108	// 6行目　課税仕入れ等に係る特定収入　D　６．２４％
#define	ID201_6E 109	// 6行目　課税仕入れ等に係る特定収入　E　７．８％
#define	ID201_6F 110	// 6行目　A－（B＋C＋D＋E)の金額　F

#define	ID201_7ITEM 111	// 7行目　内容
#define	ID201_7KEI 112	// 7行目　資産の譲渡等の対価以外の収入
#define	ID201_7A 113	// 7行目　左のうち特定収入　A
#define	ID201_7B 114	// 7行目　課税仕入れ等に係る特定収入　B　４％
#define	ID201_7C 115	// 7行目　課税仕入れ等に係る特定収入　C　６．３％
#define	ID201_7D 116	// 7行目　課税仕入れ等に係る特定収入　D　６．２４％
#define	ID201_7E 117	// 7行目　課税仕入れ等に係る特定収入　E　７．８％
#define	ID201_7F 118	// 7行目　A－（B＋C＋D＋E)の金額　F


#define	ID201_17KEI 9		// 資産の譲渡等の対価以外の収入 合計
#define	ID201_17A 10		// 左のうち特定収入　A
#define	ID201_17B 11		// 課税仕入れ等に係る特定収入　B　４％
#define	ID201_17C 12		// 課税仕入れ等に係る特定収入　C　６．３％
#define	ID201_17D 13     //課税仕入れ等に係る特定収入　D　６．２４％
#define	ID201_17E 14     //課税仕入れ等に係る特定収入　E　７．８％
#define	ID201_17F 15		// A－（B＋C＋D＋E)の金額　F

//{インデックス、連動、非連動、確定｝　
SH_ITEMINDEX	Specific21_31[]	=	{
	{	ID201_1ITEM,	0, 1, 0		},
{	ID201_1KEI,	0, 1, 0		},
{	ID201_1A,	0, 1, 0		},
{	ID201_1B,	0, 1, 0		},
{	ID201_1C,	0, 1, 0		},
{	ID201_1D,	0, 1, 0		},
{	ID201_1E,	0, 1, 0		},
{	ID201_1F,	0, 0, 0		},

{	ID201_2ITEM,	0, 1, 0		},
{	ID201_2KEI,	0, 1, 0		},
{	ID201_2A,	0, 1, 0		},
{	ID201_2B,	0, 1, 0		},
{	ID201_2C,	0, 1, 0		},
{	ID201_2D,	0, 1, 0		},
{	ID201_2E,	0, 1, 0		},
{	ID201_2F,	0, 0, 0		},

{	ID201_3ITEM,	0, 1, 0		},
{	ID201_3KEI,	0, 1, 0		},
{	ID201_3A,	0, 1, 0		},
{	ID201_3B,	0, 1, 0		},
{	ID201_3C,	0, 1, 0		},
{	ID201_3D,	0, 1, 0		},
{	ID201_3E,	0, 1, 0		},
{	ID201_3F,	0, 0, 0		},

{	ID201_4ITEM,	0, 1, 0		},
{	ID201_4KEI,	0, 1, 0		},
{	ID201_4A,	0, 1, 0		},
{	ID201_4B,	0, 1, 0		},
{	ID201_4C,	0, 1, 0		},
{	ID201_4D,	0, 1, 0		},
{	ID201_4E,	0, 1, 0		},
{	ID201_4F,	0, 0, 0		},

{	ID201_5ITEM,	0, 1, 0		},
{	ID201_5KEI,	0, 1, 0		},
{	ID201_5A,	0, 1, 0		},
{	ID201_5B,	0, 1, 0		},
{	ID201_5C,	0, 1, 0		},
{	ID201_5D,	0, 1, 0		},
{	ID201_5E,	0, 1, 0		},
{	ID201_5F,	0, 0, 0		},

{	ID201_6ITEM,	0, 1, 0		},
{	ID201_6KEI,	0, 1, 0		},
{	ID201_6A,	0, 1, 0		},
{	ID201_6B,	0, 1, 0		},
{	ID201_6C,	0, 1, 0		},
{	ID201_6D,	0, 1, 0		},
{	ID201_6E,	0, 1, 0		},
{	ID201_6F,	0, 0, 0		},

{	ID201_7ITEM,	0, 1, 0		},
{	ID201_7KEI,	0, 1, 0		},
{	ID201_7A,	0, 1, 0		},
{	ID201_7B,	0, 1, 0		},
{	ID201_7C,	0, 1, 0		},
{	ID201_7D,	0, 1, 0		},
{	ID201_7E,	0, 1, 0		},
{	ID201_7F,	0, 0, 0		},

{	   0,	0, 0, 0		}
};

static FCSUPDOWN_INFO	FCS_Specific21_31[]	=	{
	{	ID201_1ITEM 		},
{	ID201_2ITEM 		},
{	ID201_3ITEM 		},
{	ID201_4ITEM 		},
{	ID201_5ITEM 		},
{	ID201_6ITEM 		},
{	ID201_7ITEM 		},

{	ID201_1KEI 		},
{	ID201_2KEI 		},
{	ID201_3KEI		},
{	ID201_4KEI		},
{	ID201_5KEI		},
{	ID201_6KEI		},
{	ID201_7KEI		},

{	ID201_1A 		},
{	ID201_2A 		},
{	ID201_3A 		},
{	ID201_4A 		},
{	ID201_5A 		},
{	ID201_6A 		},
{	ID201_7A 		},

{	ID201_1B 		},
{	ID201_2B 		},
{	ID201_3B 		},
{	ID201_4B 		},
{	ID201_5B 		},
{	ID201_6B 		},
{	ID201_7B 		},

{	ID201_1C 		},
{	ID201_2C 		},
{	ID201_3C 		},
{	ID201_4C 		},
{	ID201_5C    	},
{	ID201_6C 		},
{	ID201_7C 		},

{	ID201_1D 		},	
{	ID201_2D 		},	
{	ID201_3D 		},		
{	ID201_4D 		},		
{	ID201_5D 		},	
{	ID201_6D 		},	
{	ID201_7D 		},

{	ID201_1E 		},	
{	ID201_2E 		},	
{	ID201_3E 		},		
{	ID201_4E 		},		
{	ID201_5E 		},	
{	ID201_6E 		},	
{	ID201_7E 		},

{	ID201_1F 		},	
{	ID201_2F 		},	
{	ID201_3F 		},		
{	ID201_4F 		},		
{	ID201_5F 		},	
{	ID201_6F 		},	
{	ID201_7F 		},
};

static FCSUPDOWN_INFO	FCS_Specific21_31_LR[]	=	{
	{	ID201_1ITEM 		},
{	ID201_1KEI 		},
{	ID201_1A 		},
{	ID201_1B 		},
{	ID201_1C 		},
{	ID201_1D 		},
{	ID201_1E 		},
{	ID201_1F 		},

{	ID201_2ITEM 	},
{	ID201_2KEI  	},
{	ID201_2A    	},
{	ID201_2B		},
{	ID201_2C 		},
{	ID201_2D 		},
{	ID201_2E 		},
{	ID201_2F 		},

{	ID201_3ITEM 	},
{	ID201_3KEI		},
{	ID201_3A 		},
{	ID201_3B 		},
{	ID201_3C 		},
{	ID201_3D 		},
{	ID201_3E 		},
{	ID201_3F 		},

{	ID201_4ITEM 	},
{	ID201_4KEI		},
{	ID201_4A 		},
{	ID201_4B 		},
{	ID201_4C 		},
{	ID201_4D 		},
{	ID201_4E    	},
{	ID201_4F 		},

{	ID201_5ITEM 	},
{	ID201_5KEI		},
{	ID201_5A 		},
{	ID201_5B 		},
{	ID201_5C 		},
{	ID201_5D 		},
{	ID201_5E 		},
{	ID201_5F 		},

{	ID201_6ITEM 	},
{	ID201_6KEI		},
{	ID201_6A 		},
{	ID201_6B 		},
{	ID201_6C 		},
{	ID201_6D 		},
{	ID201_6E 		},
{	ID201_6F 		},

{	ID201_7ITEM 		},
{	ID201_7KEI		},
{	ID201_7A 		},
{	ID201_7B 		},
{	ID201_7C 		},
{	ID201_7D 		},
{	ID201_7E 		},
{	ID201_7F 		},
};

#define		FCS_SPECIFIC21CNT	56