#pragma once

#define	ID502_1A		88  //1. （税率６．２４％）調整前の課税仕入れ等の税額の合計額
#define	ID502_2A		89  //2. （税率６．２４％）課税売上にのみ要する課税仕入れ等（税率６．２４%)にのみ使途が特定されている特定収入
#define	ID502_3A		90  //3. （税率６．２４％）２×６．２４／１０８
#define	ID502_4A		91  //4. （税率６．２４％）課税・非課税売上げに共通して要する課税仕入れ等（税率６．２４%)にのみ使途が特定されている特定収入
#define	ID502_5A		92  //5. （税率６．２４％）４×６．２４／１１０
#define	ID502_10_bunshi 84  //10. 課税売上割合（準ずる割合の承認を受けている場合はその割合）分子
#define	ID502_10_bunbo  85  //10. 課税売上割合（準ずる割合の承認を受けている場合はその割合）分母
#define	ID502_11A		93  //11.（税率６．２４％）５×１０
#define	ID502_12A		94  //12.（税率６．２４％）３＋１１
#define	ID502_13A		95  //13.（税率６．２４％）１－１２
#define	ID502_14_bunshi 86  //14. 調整割合（計算表４４）分子
#define	ID502_14_bunbo  87  //14. 調整割合（計算表４４）分母
#define	ID502_15A		96  //15.（税率６．２４％）１３×１４
#define	ID502_16A		97  //16.（税率６．２４％）特定収入に係る課税仕入れ等の税額（１２＋１５）
#define	ID502_17A		98  //17.（税率６．２４％）控除対象外仕入れに係る調整額の合計額
#define	ID502_18A		99  //18.（税率６．２４％）控除対象仕入税額（１＋１７－１６）

#define	ID502_1B		100  //1. （税率７．８％）調整前の課税仕入れ等の税額の合計額
#define	ID502_6B		101  //6. （税率７．８％）課税売上にのみ要する課税仕入れ等（税率７．８%)にのみ使途が特定されている特定収入
#define	ID502_7B		102  //7. （税率７．８％）６×７．８／１０８
#define	ID502_8B		103  //8. （税率７．８％）課税・非課税売上げに共通して要する課税仕入れ等（税率７．８%)にのみ使途が特定されている特定収入
#define	ID502_9B		104  //9. （税率７．８％）８×７．８／１１０
#define	ID502_11B		105 //11.（税率７．８％）９×１０（１円未満の端数切捨て）
#define	ID502_12B		106 //12.（税率７．８％）７＋１１
#define	ID502_13B		107 //13.（税率７．８％）１－１２
#define	ID502_15B		108 //15.（税率７．８％）１３×１４（１円未満の端数切捨て）
#define	ID502_16B		109 //16.（税率７．８％）特定収入に係る課税仕入れ等の税額（１２＋１５）
#define	ID502_17B		110 //17.（税率７．８％）控除対象外仕入れに係る調整額の合計額
#define	ID502_18B		111 //18.（税率７．８％）控除対象仕入税額（１＋１７－１６）

#define	ID502_10_wariai 119  //10. 課税売上割合に準ずる割合