//yokono
#pragma once

#define	ID2022_1ITEM 56		// 1行目　内容
#define	ID2022_1KEI1 57		// 1行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_1K 58		// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　K
#define	ID2022_1L 59		// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　L
#define	ID2022_1KEI2 60		// 1行目　課税仕入等に係る特定収入７．８％
#define	ID2022_1M 61		// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　M
#define	ID2022_1N 62		// 1行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　N

#define	ID2022_2ITEM 63		// 2行目　内容
#define	ID2022_2KEI1 64		// 2行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_2K 65		// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　K
#define	ID2022_2L 66		// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　L
#define	ID2022_2KEI2 67		// 2行目　課税仕入等に係る特定収入７．８％
#define	ID2022_2M 68		// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　M
#define	ID2022_2N 69		// 2行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　N

#define	ID2022_3ITEM 70		// 3行目　内容
#define	ID2022_3KEI1 71		// 3行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_3K 72		// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　K
#define	ID2022_3L 73		// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　L
#define	ID2022_3KEI2 74		// 3行目　課税仕入等に係る特定収入７．８％
#define	ID2022_3M 75		// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　M
#define	ID2022_3N 76		// 3行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　N

#define	ID2022_4ITEM 77		// 4行目　内容
#define	ID2022_4KEI1 78		// 4行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_4K 79		// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　K
#define	ID2022_4L 80		// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　L
#define	ID2022_4KEI2 81		// 4行目　課税仕入等に係る特定収入７．８％
#define	ID2022_4M 82		// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　M
#define	ID2022_4N 83		// 4行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　N

#define	ID2022_5ITEM 84		// 5行目　内容
#define	ID2022_5KEI1 85		// 5行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_5K 86		// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　K
#define	ID2022_5L 87		// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　L
#define	ID2022_5KEI2 88		// 5行目　課税仕入等に係る特定収入７．８％
#define	ID2022_5M 89		// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　M
#define	ID2022_5N 90		// 5行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　N

#define	ID2022_6ITEM 91		// 6行目　内容
#define	ID2022_6KEI1 92		// 6行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_6K 93		// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　K
#define	ID2022_6L 94		// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　L
#define	ID2022_6KEI2 95		// 6行目　課税仕入等に係る特定収入７．８％
#define	ID2022_6M 96		// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　M
#define	ID2022_6N 97		// 6行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　N

#define	ID2022_7ITEM 98		// 7行目　内容
#define	ID2022_7KEI1 99		// 7行目　課税仕入等に係る特定収入６．２４％
#define	ID2022_7K 100		// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　K
#define	ID2022_7L 101		// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　L
#define	ID2022_7KEI2 102	// 7行目　課税仕入等に係る特定収入７．８％
#define	ID2022_7M 103		// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　M
#define	ID2022_7N 104		// 7行目　課税売上にのみ要する課税仕入れ等に特定されている特定収入　N

#define	ID2022_17KEI1 8		//課税仕入等に係る特定収入６．２４％　 合計
#define	ID2022_17K 9		//課税売上にのみ要する課税仕入れ等に特定されている特定収入　K 合計
#define	ID2022_17L 10		//課税売上にのみ要する課税仕入れ等に特定されている特定収入　L 合計
#define	ID2022_17KEI2 11	//課税仕入等に係る特定収入７．８％　 合計
#define	ID2022_17M 12		//課税売上にのみ要する課税仕入れ等に特定されている特定収入　M 合計
#define	ID2022_17N 13		//課税売上にのみ要する課税仕入れ等に特定されている特定収入　N 合計


SH_ITEMINDEX	Specific22_2_31[]	=	{
{	ID2022_1K,	0, 1, 0		},
{	ID2022_1L,	0, 1, 0		},
{	ID2022_1M,	0, 1, 0		},
{	ID2022_1N,	0, 1, 0		},

{	ID2022_2K,	0, 1, 0		},
{	ID2022_2L,	0, 1, 0		},
{	ID2022_2M,	0, 1, 0		},
{	ID2022_2N,	0, 1, 0		},

{	ID2022_3K,	0, 1, 0		},
{	ID2022_3L,	0, 1, 0		},
{	ID2022_3M,	0, 1, 0		},
{	ID2022_3N,	0, 1, 0		},

{	ID2022_4K,	0, 1, 0		},
{	ID2022_4L,	0, 1, 0		},
{	ID2022_4M,	0, 1, 0		},
{	ID2022_4N,	0, 1, 0		},

{	ID2022_5K,	0, 1, 0		},
{	ID2022_5L,	0, 1, 0		},
{	ID2022_5M,	0, 1, 0		},
{	ID2022_5N,	0, 1, 0		},

{	ID2022_6K,	0, 1, 0		},
{	ID2022_6L,	0, 1, 0		},
{	ID2022_6M,	0, 1, 0		},
{	ID2022_6N,	0, 1, 0		},

{	ID2022_7K,	0, 1, 0		},
{	ID2022_7L,	0, 1, 0		},
{	ID2022_7M,	0, 1, 0		},
{	ID2022_7N,	0, 1, 0		},

{	   0,	0, 0, 0		}
};


static FCSUPDOWN_INFO	FCS_Specific22_2_31[]	=	{

{	ID2022_1K	},
{	ID2022_2K	},
{	ID2022_3K	},
{	ID2022_4K	},
{	ID2022_5K	},
{	ID2022_6K	},
{	ID2022_7K	},

{	ID2022_1L	},
{	ID2022_2L	},
{	ID2022_3L	},
{	ID2022_4L	},
{	ID2022_5L	},
{	ID2022_6L	},
{	ID2022_7L	},

{	ID2022_1M	},
{	ID2022_2M	},
{	ID2022_3M	},
{	ID2022_4M	},
{	ID2022_5M	},
{	ID2022_6M	},
{	ID2022_7M	},

{	ID2022_1N	},
{	ID2022_2N	},
{	ID2022_3N	},
{	ID2022_4N	},
{	ID2022_5N	},
{	ID2022_6N	},
{	ID2022_7N	},
};

static FCSUPDOWN_INFO	FCS_Specific22_2_31_LR[]	=	{
{	ID2022_1K	},
{	ID2022_1L	},
{	ID2022_1M	},
{	ID2022_1N	},

{	ID2022_2K	},
{	ID2022_2L	},
{	ID2022_2M	},
{	ID2022_2N	},

{	ID2022_3K	},
{	ID2022_3L	},
{	ID2022_3M	},
{	ID2022_3N	},

{	ID2022_4K	},
{	ID2022_4L	},
{	ID2022_4M	},
{	ID2022_4N	},

{	ID2022_5K	},
{	ID2022_5L	},
{	ID2022_5M	},
{	ID2022_5N	},

{	ID2022_6K	},
{	ID2022_6L	},
{	ID2022_6M	},
{	ID2022_6N	},

{	ID2022_7K	},
{	ID2022_7L	},
{	ID2022_7M	},
{	ID2022_7N	},
};

#define		FCS_SPECIFIC22CNT	28

