// midori 152133 add	※当ダイアログを新規に作成

// dlgDisplay2.cpp : 実装ファイル
//

#include "stdafx.h"
#include "UCHIWAKE.h"
#include "dlgDisplay2.h"

// midori 190301 add -->
extern	BOOL	bG_Kanso;
// midori 190301 add <--
// インボイス登録番号追加対応_23/09/11 add -->
extern BOOL		bG_InvNo;		// インボイス番号使用サイン（決算期末が令和6年3月1日を超えている）
// インボイス登録番号追加対応_23/09/11 add <--

// No.200602 add -->
// 対応前のレポート幅
// 簡素化様式、現行の列幅
int	R_Width_1[30][20]={
// ID_FORMNO_011 預貯金
//{196, 196, 213, 135, 153, 689},
{(11*17)+ 9, (11*17)+ 9, (12*17)+ 9, (14* 9)+ 9, (16* 9)+ 9, (40*17)+ 9},
// ID_FORMNO_021 受取手形
{(12*17)+ 9, (20*17)+ 9, (12* 9)+ 9, (12* 9)+ 9, (11*17)+ 9, (11*17)+ 9, (16*9)+9, (21*17)+9, (32*17)+9},
// ID_FORMNO_031 売掛金
{(12*17)+ 9, (20*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (26*17)+ 9},
// ID_FORMNO_041 仮払金
{(12*17)+ 9, (20*17)+ 9, (40*17)+ 9, ( 7*18)+18, (14* 9)+ 9, (20*17)+ 9},
// ID_FORMNO_042 貸付金
{(20*17)+ 9, (40*17)+ 9, (10*18)+18, (14* 9)+ 9, ( 8*17)+18, ( 6* 9)+ 9, (30*17)+9},
// ID_FORMNO_051 棚卸資産
{(12*17)+ 9, (20*17)+ 9, (12* 9)+ 9, ( 3*17)+ 9, (13* 9)+ 9, (15* 9)+ 9, (30*17)+9},
// ID_FORMNO_061 有価証券
{(12*17)+ 9, ( 8*17)+ 9, ( 8*17)+ 9, ( 9*18)+18, ( 9*18)+18, ( 9*18)+18, (9*18)+18, ( 5*18)+18, (12*17)+ 9, (15* 9)+9, ( 3*17)+ 9, (14* 9)+ 9, (30*17)+9, (30*17)+9, (30*17)+9},
// ID_FORMNO_071 固定資産
{(14*17)+ 9, (10*17)+ 9, (13* 9)+ 9, (40*17)+ 9, (15* 9)+ 9, ( 5*18)+18, (12*17)+9, (14* 9)+ 9, (14* 9)+ 9, (30*17)+9, (30*17)+ 9, ( 2*17)+(5*9)+18},
// ID_FORMNO_081 支払手形
{(20*17)+ 9, ( 5*18)+18, ( 5*18)+18, (11*17)+ 9, (11*17)+ 9, (16* 9)+ 9, (40*17)+9},
// ID_FORMNO_091 買掛金
{(12*17)+ 9, (20*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (20*17)+ 9},
// ID_FORMNO_101 仮受金
{(12*17)+ 9, (20*17)+ 9, (40*17)+ 9, ( 7*18)+18, (14* 9)+ 9, (20*17)+ 9},
// ID_FORMNO_102 源泉所得税
{10, 12, 14, 64},
// ID_FORMNO_111 借入金
{(12*17)+ 9, (20*17)+ 9, (40*17)+ 9, (10*18)+18, (14* 9)+ 9, ( 8*18)+18, ( 7* 9)+ 9, (26*17)+ 9},
// ID_FORMNO_121 土地の売上高等
{( 5*17)+ 9, (30*17)+ 9, ( 8*17)+ 9, (13* 9)+ 9, ( 4*18)+18, (20*17)+ 9, (40*17)+ 9, (13* 9)+ 9, ( 8*18)+18, ( 8*18)+18, ( 8*18)+18},
// ID_FORMNO_131 売上高等の事業所別
{(20*17)+ 9, (40*17)+ 9, (16*17)+ 9, ( 8*17)+ 9, (15*17)+ 9, (14* 9)+ 9, (14* 9)+ 9, ( 6*18)+18, (10*17)+ 9, (24*17)+ 9},
// ID_FORMNO_141 役員報酬手当金等
//{( 8*17)+ 9, ( 8*17)+ 9, (24*17)+ 9, ( 7*18)+18, (40*17)+ 9, ( 8*18)+18, ( 6*18)+18, ( 6*18)+18, ( 8*18)+18, ( 6*18)+18, (11* 9)+ 9, (11* 9)+ 9, (13* 9)+ 9},	// 改良No.23-0961 del
{( 8*17)+ 9, ( 8*17)+ 9, (24*17)+ 9, ( 7*18)+18, (40*17)+ 9, ( 8*18)+18, ( 6*18)+18, ( 6*18)+18, ( 8*18)+18, ( 6*18)+18, (11* 9)+18, (11* 9)+18, (13* 9)+ 9},	// 改良No.23-0961 add
// ID_FORMNO_142 人件費（※保管参照なし）
{0},
// ID_FORMNO_151 地代家賃等
{( 8*18)+18, (40*17)+ 9, (40*17)+ 9, (20*17)+ 9, (40*17)+ 9, 17+(24*9)+ 9, (14* 9)+ 9, (42*17)+ 9},
// ID_FORMNO_152 権利金等の期中支払
{(20*17)+ 9, (40*17)+ 9, ( 5*18)+18, (14* 9)+ 9, (26*17)+ 9, (33*17)+ 9},
// ID_FORMNO_153 工業所有権等の使用料
{(10*17)+ 9, (20*17)+ 9, (40*17)+ 9, ( 5*17)+(10*9)+9, (5*17)+(10* 9)+ 9, (14* 9)+ 9, (30*17)+ 9},
// ID_FORMNO_161 雑益
{(12*17)+ 9, (24*17)+ 9, (20*17)+ 9, (40*17)+ 9, (14* 9)+ 9},
// ID_FORMNO_162 雑損失
{(12*17)+ 9, (24*17)+ 9, (20*17)+ 9, (40*17)+ 9, (14* 9)+ 9},
// ID_FORMNO_171 その他科目の内訳書①
{(12*17)+ 9, (20*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (26*17)+ 9},
// ID_FORMNO_181 その他科目の内訳書②
{(12*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (40*17)+ 9},
{0}
};

// 簡素化様式、簡略化した列幅
// 拡大タイプ
//// レポート幅トータル 1715(1920×1080)として調整
//int	R_Width_2[30][20]={
//// ID_FORMNO_011 預貯金
//{220, 220, 250, 168, 198, 659},
//// ID_FORMNO_021 受取手形
//{200, 200, 142, 142, 198, 198, 198, 240, 197},
//// ID_FORMNO_031 売掛金
//{250, 340, 557, 198, 370},
//// ID_FORMNO_041 仮払金
//{250, 340, 450, 142, 176, 357},
//// ID_FORMNO_042 貸付金
//{326, 445, 142, 176, 154, 76, 396},
//// ID_FORMNO_051 棚卸資産
//{250, 360, 142, 76, 154, 198, 535},
//// ID_FORMNO_061 有価証券
//{120, 120, 120, 118,  76, 118, 118, 128, 109, 118, 76, 118, 135, 135, 106},
//// ID_FORMNO_071 固定資産
//{150, 148, 146, 151, 158, 142, 144, 134, 134, 150, 148, 110},
//// ID_FORMNO_081 支払手形
//{340, 142, 142, 210, 210, 198, 473},
//// ID_FORMNO_091 買掛金
//{260, 360, 537, 198, 360},
//// ID_FORMNO_101 仮受金
//{250, 340, 444, 142, 176, 363},
//// ID_FORMNO_102 源泉取得税
//{171, 205, 240,1099},
//// ID_FORMNO_111 借入金
//{210, 254, 405, 142, 176, 154, 88, 286},
//// ID_FORMNO_121 土地の売上高等
//{120, 201, 150, 154, 110, 162, 193, 154, 198, 198, 75},
//// ID_FORMNO_131 売上高等の事業所別
//{160, 269, 206, 142, 190, 176, 176, 86, 164, 146},
//// ID_FORMNO_141 役員報酬手当金等
//{120, 120, 150, 142, 207,  30, 132, 132, 132, 132, 132, 132, 154},
//// ID_FORMNO_142 人件費（※保管参照なし）
//{0},
//// ID_FORMNO_151 地代家賃等
//{140, 230, 230, 180, 230, 300, 176, 229},
//// ID_FORMNO_152 権利金等の期中支払
//{230, 450, 142, 176, 340, 377},
//// ID_FORMNO_153 工業所有権等の使用料
//{182, 230, 390, 233, 233, 176, 271},
//// ID_FORMNO_161 雑益
//{180, 410, 370, 579, 176},
//// ID_FORMNO_162 雑損失
//{180, 410, 370, 579, 176},
//// ID_FORMNO_171 その他科目の内訳書①
//{180, 370, 557, 198, 410},
//// ID_FORMNO_181 その他科目の内訳書②
//{200, 659, 198, 658},
////
//{0}
//};

// レポート幅トータル 920(1024×768)として調整
int	R_Width_2[30][20]={
// 1.ID_FORMNO_011 預貯金
{124, 124, 148, 88, 106, 330},
// 2.ID_FORMNO_021 受取手形
{110, 124, 76, 76, 99, 99, 106, 131, 99},
// 3.ID_FORMNO_031 売掛金
{110, 171, 327, 106, 206},
// 4.ID_FORMNO_041 仮払金
{110, 194, 261, 68, 94, 193},
// 5.ID_FORMNO_042 貸付金
{172, 256, 68, 94, 82, 40, 208},
// 6.ID_FORMNO_051 棚卸資産
{110, 208, 76, 40, 82, 106, 298},
// 7.ID_FORMNO_061 有価証券
{64, 64, 64, 63, 40, 63, 63, 68, 58, 63, 40, 63, 68, 76, 63},
// 8.ID_FORMNO_071 固定資産
{80, 80, 78, 80, 84, 76, 77, 71, 71, 80, 84, 59},
// 9.ID_FORMNO_081 支払手形
{182, 76, 76, 112, 112, 106, 256},
// 10.ID_FORMNO_091 買掛金
{139, 193, 288, 106, 194},
// 11.ID_FORMNO_101 仮受金
{134, 182, 238, 76, 94, 196},
// 12.ID_FORMNO_102 源泉取得税
{171, 205, 240,1099},
// 13.ID_FORMNO_111 借入金
{112, 136, 217, 76, 94, 82, 47, 156},
// 14.ID_FORMNO_121 土地の売上高等
{64, 107, 80, 82, 59, 86, 108, 82, 106, 106, 40},
// 15.ID_FORMNO_131 売上高等の事業所別
{85, 144, 110, 76, 101, 94, 94, 46, 84, 83},
// 16.ID_FORMNO_141 役員報酬手当金等
//{64, 64, 80, 76, 118, 16, 70, 70, 70, 70, 70, 70, 82},	// 改良No.23-0961 del
{64, 64, 80, 76, 118, 16, 70, 70, 70, 70, 70, 70, 82},		// 改良No.23-0961 add
// 17.ID_FORMNO_142 人件費（※保管参照なし）
{0},
// 18.ID_FORMNO_151 地代家賃等
{75, 123, 123, 96, 123, 160, 94, 126},
// 19.ID_FORMNO_152 権利金等の期中支払
{123, 241, 76, 94, 182, 204},
// 20.ID_FORMNO_153 工業所有権等の使用料
{97, 123, 209, 124, 124, 94, 149},
// 21.ID_FORMNO_161 雑益
{96, 219, 198, 313, 94},
// 22.ID_FORMNO_162 雑損失
{96, 219, 198, 313, 94},
// 101.ID_FORMNO_171 その他科目の内訳書①
{96, 198, 298, 106, 222},
// 201.ID_FORMNO_181 その他科目の内訳書②
{107, 353, 106, 354},
//
{0}
};

// インボイス登録番号追加対応_23/09/11 add -->
// インボイス番号対応版　通常の列幅
// 修正No.168380 del -->
//int	R_Width_3[30][20]={
//// ID_FORMNO_011 預貯金
//{(11*17)+ 9, (11*17)+ 9, (12*17)+ 9, (14* 9)+ 9, (16* 9)+ 9, (40*17)+ 9},
//// ID_FORMNO_021 受取手形
//{(12*17)+ 9, (13* 9)+ 9, (20*17)+ 9, (12* 9)+ 9, (12* 9)+ 9, (11*17)+ 9, (11*17)+ 9, (16*9)+9, (21*17)+9, (32*17)+9},
//// ID_FORMNO_031 売掛金
//{(13* 9)+ 9, (12*17)+ 9, (20*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (26*17)+ 9},
//// ID_FORMNO_041 仮払金
//{(12*17)+ 9, (13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, ( 7*18)+18, (14* 9)+ 9, (20*17)+ 9},
//// ID_FORMNO_042 貸付金
//{(20*17)+ 9, (13* 9)+ 9, (40*17)+ 9, (10*18)+18, (14* 9)+ 9, ( 8*17)+18, ( 6* 9)+ 9, (30*17)+9},
//// ID_FORMNO_051 棚卸資産
//{(12*17)+ 9, (20*17)+ 9, (12* 9)+ 9, ( 3*17)+ 9, (13* 9)+ 9, (15* 9)+ 9, (30*17)+9},
//// ID_FORMNO_061 有価証券
//{(12*17)+ 9, ( 8*17)+ 9, ( 8*17)+ 9, ( 9*18)+18, ( 9*18)+18, ( 9*18)+18, (9*18)+18, ( 5*18)+18, (12*17)+ 9, (15* 9)+9, ( 3*17)+ 9, (14* 9)+ 9, (30*17)+9, (30*17)+9, (30*17)+9},
//// ID_FORMNO_071 固定資産
//{(14*17)+ 9, (10*17)+ 9, (13* 9)+ 9, (40*17)+ 9, (15* 9)+ 9, ( 5*18)+18, (12*17)+9, (14* 9)+ 9, (14* 9)+ 9, (13* 9)+ 9, (30*17)+9, (30*17)+ 9, ( 2*17)+(5*9)+18},
//// ID_FORMNO_081 支払手形
//{(13* 9)+ 9, (20*17)+ 9, ( 5*18)+18, ( 5*18)+18, (11*17)+ 9, (11*17)+ 9, (16* 9)+ 9, (40*17)+9},
//// ID_FORMNO_091 買掛金
//{(12*17)+ 9, (13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (20*17)+ 9},
//// ID_FORMNO_101 仮受金
//{(12*17)+ 9, (13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, ( 7*18)+18, (14* 9)+ 9, (20*17)+ 9},
//// ID_FORMNO_102 源泉所得税
//{10, 12, 14, 64},
//// ID_FORMNO_111 借入金
//{(12*17)+ 9, (20*17)+ 9, (40*17)+ 9, (10*18)+18, (14* 9)+ 9, ( 8*18)+18, ( 7* 9)+ 9, (26*17)+ 9},
//// ID_FORMNO_121 土地の売上高等
//{( 5*17)+ 9, (30*17)+ 9, ( 8*17)+ 9, (13* 9)+ 9, ( 4*18)+18, (13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (13* 9)+ 9, ( 8*18)+18, ( 8*18)+18, ( 8*18)+18},
//// ID_FORMNO_131 売上高等の事業所別
//{(20*17)+ 9, (40*17)+ 9, (16*17)+ 9, ( 8*17)+ 9, (15*17)+ 9, (14* 9)+ 9, (14* 9)+ 9, ( 6*18)+18, (10*17)+ 9, (24*17)+ 9},
//// ID_FORMNO_141 役員報酬手当金等
//{( 8*17)+ 9, ( 8*17)+ 9, (24*17)+ 9, ( 7*18)+18, (40*17)+ 9, ( 8*18)+18, ( 6*18)+18, ( 6*18)+18, ( 8*18)+18, ( 6*18)+18, (11* 9)+ 9, (11* 9)+ 9, (13* 9)+ 9},
//// ID_FORMNO_142 人件費（※保管参照なし）
//{0},
//// ID_FORMNO_151 地代家賃等
//{( 8*18)+18, (40*17)+ 9, (40*17)+ 9, (13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, 17+(24*9)+ 9, (14* 9)+ 9, (42*17)+ 9},
//// ID_FORMNO_152 権利金等の期中支払
//{(13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, ( 5*18)+18, (14* 9)+ 9, (26*17)+ 9, (33*17)+ 9},
//// ID_FORMNO_153 工業所有権等の使用料
//{(10*17)+ 9, (13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, ( 5*17)+(10*9)+9, (5*17)+(10* 9)+ 9, (14* 9)+ 9, (30*17)+ 9},
//// ID_FORMNO_161 雑益
//{(12*17)+ 9, (24*17)+ 9, (13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (14* 9)+ 9},
//// ID_FORMNO_162 雑損失
//{(12*17)+ 9, (24*17)+ 9, (13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (14* 9)+ 9},
//// ID_FORMNO_171 その他科目の内訳書①
//{(12*17)+ 9, (13* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (26*17)+ 9},
//// ID_FORMNO_181 その他科目の内訳書②
//{(12*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (40*17)+ 9},
//{0}
//};
// 修正No.168380 del <--
// 修正No.168380 add -->
int	R_Width_3[30][20]={
// ID_FORMNO_011 預貯金
{(11*17)+ 9, (11*17)+ 9, (12*17)+ 9, (14* 9)+ 9, (16* 9)+ 9, (40*17)+ 9},
// ID_FORMNO_021 受取手形
{(12*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (12* 9)+ 9, (12* 9)+ 9, (11*17)+ 9, (11*17)+ 9, (16*9)+9, (21*17)+9, (32*17)+9},
// ID_FORMNO_031 売掛金
{(12*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (26*17)+ 9},
// ID_FORMNO_041 仮払金
{(12*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, ( 7*18)+18, (14* 9)+ 9, (20*17)+ 9},
// ID_FORMNO_042 貸付金
{(16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (10*18)+18, (14* 9)+ 9, ( 8*17)+18, ( 6* 9)+ 9, (30*17)+9},
// ID_FORMNO_051 棚卸資産
{(12*17)+ 9, (20*17)+ 9, (12* 9)+ 9, ( 3*17)+ 9, (13* 9)+ 9, (15* 9)+ 9, (30*17)+9},
// ID_FORMNO_061 有価証券
{(12*17)+ 9, ( 8*17)+ 9, ( 8*17)+ 9, ( 9*18)+18, ( 9*18)+18, ( 9*18)+18, (9*18)+18, ( 5*18)+18, (12*17)+ 9, (15* 9)+9, ( 3*17)+ 9, (14* 9)+ 9, (30*17)+9, (30*17)+9, (30*17)+9},
// ID_FORMNO_071 固定資産
{(14*17)+ 9, (10*17)+ 9, (13* 9)+ 9, (40*17)+ 9, (15* 9)+ 9, ( 5*18)+18, (12*17)+9, (14* 9)+ 9, (14* 9)+ 9, (16* 9)+ 9, (30*17)+9, (30*17)+ 9, ( 2*17)+(5*9)+18},
// ID_FORMNO_081 支払手形
//{(16* 9)+ 9, (20*17)+ 9, ( 5*18)+18, ( 5*18)+18, (11*17)+ 9, (11*17)+ 9, (16* 9)+ 9, (40*17)+9},				// 改良No.21-0086,21-0529 del
{(12*17)+ 9, (16* 9)+ 9, (20*17)+ 9, ( 5*18)+18, ( 5*18)+18, (11*17)+ 9, (11*17)+ 9, (16* 9)+ 9, (40*17)+9},	// 改良No.21-0086,21-0529 add
// ID_FORMNO_091 買掛金
{(12*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (20*17)+ 9},
// ID_FORMNO_101 仮受金
{(12*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, ( 7*18)+18, (14* 9)+ 9, (20*17)+ 9},
// ID_FORMNO_102 源泉所得税
{10, 12, 14, 64},
// ID_FORMNO_111 借入金
{(12*17)+ 9, (20*17)+ 9, (40*17)+ 9, (10*18)+18, (14* 9)+ 9, ( 8*18)+18, ( 7* 9)+ 9, (26*17)+ 9},
// ID_FORMNO_121 土地の売上高等
{( 5*17)+ 9, (30*17)+ 9, ( 8*17)+ 9, (13* 9)+ 9, ( 4*18)+18, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (13* 9)+ 9, ( 8*18)+18, ( 8*18)+18, ( 8*18)+18},
// ID_FORMNO_131 売上高等の事業所別
{(20*17)+ 9, (40*17)+ 9, (16*17)+ 9, ( 8*17)+ 9, (15*17)+ 9, (14* 9)+ 9, (14* 9)+ 9, ( 6*18)+18, (10*17)+ 9, (24*17)+ 9},
// ID_FORMNO_141 役員報酬手当金等
//{( 8*17)+ 9, ( 8*17)+ 9, (24*17)+ 9, ( 7*18)+18, (40*17)+ 9, ( 8*18)+18, ( 6*18)+18, ( 6*18)+18, ( 8*18)+18, ( 6*18)+18, (11* 9)+ 9, (11* 9)+ 9, (13* 9)+ 9},	// 改良No.23-0961 del
{( 8*17)+ 9, ( 8*17)+ 9, (24*17)+ 9, ( 7*18)+18, (40*17)+ 9, ( 8*18)+18, ( 6*18)+18, ( 6*18)+18, ( 8*18)+18, ( 6*18)+18, (11* 9)+18, (11* 9)+18, (13* 9)+ 9},	// 改良No.23-0961 add

// ID_FORMNO_142 人件費（※保管参照なし）
{0},
// ID_FORMNO_151 地代家賃等
{( 8*18)+18, (40*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, 17+(24*9)+ 9, (14* 9)+ 9, (42*17)+ 9},
// ID_FORMNO_152 権利金等の期中支払
{(16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, ( 5*18)+18, (14* 9)+ 9, (26*17)+ 9, (33*17)+ 9},
// ID_FORMNO_153 工業所有権等の使用料
{(10*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, ( 5*17)+(10*9)+9, (5*17)+(10* 9)+ 9, (14* 9)+ 9, (30*17)+ 9},
// ID_FORMNO_161 雑益
{(12*17)+ 9, (24*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (14* 9)+ 9},
// ID_FORMNO_162 雑損失
{(12*17)+ 9, (24*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (14* 9)+ 9},
// ID_FORMNO_171 その他科目の内訳書①
{(12*17)+ 9, (16* 9)+ 9, (20*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (26*17)+ 9},
// ID_FORMNO_181 その他科目の内訳書②
{(12*17)+ 9, (40*17)+ 9, (16* 9)+ 9, (40*17)+ 9},
{0}
};
// 修正No.168380 add <--

// インボイス番号対応版　簡略化した列幅
int	R_Width_4[30][20]={
// 1.ID_FORMNO_011 預貯金
{124, 124, 148, 88, 106, 330},
// 2.ID_FORMNO_021 受取手形
{90, 88, 99, 76, 76, 89, 89, 106, 112, 90},
// 3.ID_FORMNO_031 売掛金
{88, 88, 149, 305, 106, 184},
// 4.ID_FORMNO_041 仮払金
{88, 88, 182, 239, 68, 94, 161},
// 5.ID_FORMNO_042 貸付金
{88, 143, 226, 68, 94, 82, 40, 179},
// 6.ID_FORMNO_051 棚卸資産
{110, 208, 76, 40, 82, 106, 298},
// 7.ID_FORMNO_061 有価証券
{64, 64, 64, 63, 40, 63, 63, 68, 58, 63, 40, 63, 68, 76, 63},
// 8.ID_FORMNO_071 固定資産
{72, 72, 70, 73, 76, 76, 69, 64, 64, 77, 72, 76, 59},
// 9.ID_FORMNO_081 支払手形
//{88, 180, 76, 76, 112, 112, 106, 170},	// 改良No.21-0086,21-0529 del
{90, 88, 146, 76, 76, 102, 102, 106, 134},	// 改良No.21-0086,21-0529 add
// 10.ID_FORMNO_091 買掛金
{117, 88, 171, 266, 106, 172},
// 11.ID_FORMNO_101 仮受金
{112, 88, 160, 216, 76, 94, 174},
// 12.ID_FORMNO_102 源泉取得税
{171, 205, 240,1099},
// 13.ID_FORMNO_111 借入金
{112, 136, 217, 76, 94, 82, 47, 156},
// 14.ID_FORMNO_121 土地の売上高等
{56, 97, 72, 74, 59, 80, 78, 98, 74, 96, 96, 40},
// 15.ID_FORMNO_131 売上高等の事業所別
{85, 144, 110, 76, 101, 94, 94, 46, 84, 83},
// 16.ID_FORMNO_141 役員報酬手当金等
//{64, 64, 80, 76, 118, 16, 70, 70, 70, 70, 70, 70, 82},	// 改良No.23-0961 del
{64, 64, 80, 76, 118, 16, 70, 70, 70, 70, 70, 70, 82},		// 改良No.23-0961 add
// 17.ID_FORMNO_142 人件費（※保管参照なし）
{0},
// 18.ID_FORMNO_151 地代家賃等
{73, 101, 123, 88, 80, 101, 160, 94, 100},
// 19.ID_FORMNO_152 権利金等の期中支払
{88, 103, 218, 76, 94, 159, 181},
// 20.ID_FORMNO_153 工業所有権等の使用料
{79, 88, 108, 183, 124, 124, 94, 120},
// 21.ID_FORMNO_161 雑益
{88, 194, 88, 172, 284, 94},
// 22.ID_FORMNO_162 雑損失
{88, 194, 88, 172, 284, 94},
// 101.ID_FORMNO_171 その他科目の内訳書①
{88, 88, 178, 268, 106, 192},
// 201.ID_FORMNO_181 その他科目の内訳書②
{107, 353, 106, 354},
//
{0}
};
// インボイス登録番号追加対応_23/09/11 add <--

// 簡素化様式、現行のタイトル
CString	R_Title_1[30][20]={
// ID_FORMNO_011 預貯金
{"金融機関名","支店名","種類","口座番号","期末現在高","摘要"},
// ID_FORMNO_021 受取手形
{"科目","振出人","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","割引銀行名及び支店名等","摘要"},
// ID_FORMNO_031 売掛金
{"科目","相手先（名称）","相手先（所在地）","期末現在高","摘要"},
// ID_FORMNO_041 仮払金
{"科目","相手先（名称）","相手先（所在地）","相手先（関係）","期末現在高","摘要"},
// ID_FORMNO_042 貸付金
{"貸付先（名称）","貸付先（所在地）","貸付先（関係）","期末現在高","期中の受取利息額","利率","担保の内容"},
// ID_FORMNO_051 棚卸資産
{"科目","品目","数量","単位","単価","期末現在高","摘要"},
// ID_FORMNO_061 有価証券
{"区分","種類","銘柄","期末現在高（数量）","期末現在高（単位）","期末現在高（上段）","期末現在高（下段）","異動年月日","異動事由","数量","単位","金額","売却先（名称）","売却先（所在地）","摘要"},
// ID_FORMNO_071 固定資産
{"種類・構造","用途","面積","物件の所在地","期末現在高","異動年月日","異動事由","取得価額","帳簿価額","売却先（名称）","売却先（所在地）","取得年月"},
// ID_FORMNO_081 支払手形
{"支払先","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","摘要"},
// ID_FORMNO_091 買掛金
{"科目","相手先（名称）","相手先（所在地）","期末現在高","摘要"},
// ID_FORMNO_101 仮受金
{"科目","相手先（名称）","相手先（所在地）","相手先（関係）","期末現在高","摘要"},
// ID_FORMNO_102 源泉取得税
{"支払年月","所得の種類","期末現在高",""},
// ID_FORMNO_111 借入金
{"科目","借入先（名称）","借入先（所在地）","借入先（関係）","期末現在高","期中の支払利子額","利率","担保の内容"},
// ID_FORMNO_121 土地の売上高等
{"区分","商品の所在地","地目","総面積","売上年月","売上先（名称）","売上先（所在地）","売上面積","売上金額（上段）","売上金額（下段）","売上商品の取得年"},
// ID_FORMNO_131 売上高等の事業所別
{"事業所の名称","事業所（所在地）","責任者氏名","代表者との関係","事業等の内容","売上高","期末棚卸高","期末従事員数","源泉所得税納付署","摘要"},
// ID_FORMNO_141 役員報酬手当金等
{"役職名","担当業務","氏名","代表者との関係","住所","常勤・非常勤の別","使用人職務分","定期同額給与","事前確定届出給与","業績連動給与","その他","退職給与","役員給与計"},
// ID_FORMNO_142 人件費
{""},
// ID_FORMNO_151 地代家賃等
{"地代・家賃の区分","借地物件の用途","所在地","貸主の名称","貸主の所在地","支払対象期間","支払賃借料","摘要"},
// ID_FORMNO_152 権利金等の期中支払
{"支払先の名称","支払先の所在地","支払年月日","支払金額","権利金等の内容","摘要"},
// ID_FORMNO_153 工業所有権等の使用料
{"名称","支払先の名称","支払先の所在地","契約期間","支払対象期間","支払金額","摘要"},
// ID_FORMNO_161 雑益
{"科目","取引の内容","相手先（名称）","相手先（所在地）","金額"},
// ID_FORMNO_162 雑損失
{"科目","取引の内容","相手先（名称）","相手先（所在地）","金額"},
// ID_FORMNO_171 その他科目の内訳書①
{"科目","相手先（名称）","相手先（所在地）","期末現在高","摘要"},
// ID_FORMNO_181 その他科目の内訳書②
{"科目","","期末現在高","摘要"},
{""}
};

// 簡素化様式、簡略化したタイトル
CString	R_Title_2[30][20]={
// ID_FORMNO_011 預貯金
{"金融機関名","支店名","種類","口座番号","期末現在高","摘要"},
// ID_FORMNO_021 受取手形
{"科目","振出人","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","割引銀行及び支店等","摘要"},
// ID_FORMNO_031 売掛金
{"科目","相手先(名称)","相手先(所在地)","期末現在高","摘要"},
// ID_FORMNO_041 仮払金
{"科目","相手先(名称)","相手先(所在地)","相手先(関係)","期末現在高","摘要"},
// ID_FORMNO_042 貸付金
{"貸付先(名称)","貸付先(所在地)","貸付先(関係)","期末現在高","受取利息","利率","担保の内容"},
// ID_FORMNO_051 棚卸資産
{"科目","品目","数量","単位","単価","期末現在高","摘要"},
// ID_FORMNO_061 有価証券
{"区分","種類","銘柄","期末(数量)","(単位)","期末(上段)","期末(下段)","異動年月日","異動事由","数量","単位","金額","売却先(名称)","売却先(所在地)","摘要"},
// ID_FORMNO_071 固定資産
{"種類･構造","用途","面積","物件の所在地","期末現在高","異動年月日","異動事由","取得価額","帳簿価額","売却先(名称)","売却先(所在地)","取得年月"},
// ID_FORMNO_081 支払手形
{"支払先","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","摘要"},
// ID_FORMNO_091 買掛金
{"科目","相手先(名称)","相手先(所在地)","期末現在高","摘要"},
// ID_FORMNO_101 仮受金
{"科目","相手先(名称)","相手先(所在地)","相手先(関係)","期末現在高","摘要"},
// ID_FORMNO_102 源泉取得税
{"支払年月","所得の種類","期末現在高",""},
// ID_FORMNO_111 借入金
{"科目","借入先(名称)","借入先(所在地)","借入先(関係)","期末現在高","支払利子","利率","担保の内容"},
// ID_FORMNO_121 土地の売上高等
{"区分","商品の所在地","地目","総面積","売上年月","売上先(名称)","売上先(所在地)","売上面積","売上金額(上段)","売上金額(下段)","取得年"},
// ID_FORMNO_131 売上高等の事業所別
{"事業所の名称","事業所(所在地)","責任者氏名","代表者との関係","事業等の内容","売上高","期末棚卸高","従事員数","源泉所得税納付署","摘要"},
// ID_FORMNO_141 役員報酬手当金等
{"役職名","担当業務","氏名","代表者との関係","住所","別","使用人職務分","定期同額給与","事前確定届出給与","業績連動給与","その他","退職給与","役員給与計"},
// ID_FORMNO_142 人件費
{""},
// ID_FORMNO_151 地代家賃等
{"地代･家賃区分","借地物件の用途","所在地","貸主の名称","貸主の所在地","支払対象期間","支払賃借料","摘要"},
// ID_FORMNO_152 権利金等の期中支払
{"支払先の名称","支払先の所在地","支払年月日","支払金額","権利金等の内容","摘要"},
// ID_FORMNO_153 工業所有権等の使用料
{"名称","支払先の名称","支払先の所在地","契約期間","支払対象期間","支払金額","摘要"},
// ID_FORMNO_161 雑益
{"科目","取引の内容","相手先(名称)","相手先(所在地)","金額"},
// ID_FORMNO_162 雑損失
{"科目","取引の内容","相手先(名称)","相手先(所在地)","金額"},
// ID_FORMNO_171 その他科目の内訳書①
{"科目","相手先(名称)","相手先(所在地)","期末現在高","摘要"},
// ID_FORMNO_181 その他科目の内訳書②
{"科目","","期末現在高","摘要"},
{""}
};
// No.200602 add <--

// インボイス登録番号追加対応_23/09/11 add -->
// インボイス番号対応版　通常タイトル
CString	R_Title_3[30][20]={
// ID_FORMNO_011 預貯金
{"金融機関名","支店名","種類","口座番号","期末現在高","摘要"},
// ID_FORMNO_021 受取手形
{"科目","登録番号（法人番号）","振出人","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","割引銀行名及び支店名等","摘要"},
// ID_FORMNO_031 売掛金
{"科目","登録番号（法人番号）","相手先（名称）","相手先（所在地）","期末現在高","摘要"},
// ID_FORMNO_041 仮払金
{"科目","登録番号（法人番号）","相手先（名称）","相手先（所在地）","相手先（関係）","期末現在高","摘要"},
// ID_FORMNO_042 貸付金
{"登録番号（法人番号）","貸付先（名称）","貸付先（所在地）","貸付先（関係）","期末現在高","期中の受取利息額","利率","担保の内容"},
// ID_FORMNO_051 棚卸資産
{"科目","品目","数量","単位","単価","期末現在高","摘要"},
// ID_FORMNO_061 有価証券
{"区分","種類","銘柄","期末現在高（数量）","期末現在高（単位）","期末現在高（上段）","期末現在高（下段）","異動年月日","異動事由","数量","単位","金額","売却先（名称）","売却先（所在地）","摘要"},
// ID_FORMNO_071 固定資産
{"種類・構造","用途","面積","物件の所在地","期末現在高","異動年月日","異動事由","取得価額","帳簿価額","登録番号（法人番号）","売却先（名称）","売却先（所在地）","取得年月"},
// ID_FORMNO_081 支払手形
// 改良No.21-0086,21-0529 cor -->
//{"登録番号（法人番号）","支払先","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","摘要"},
// ------------------------------
{"科目","登録番号（法人番号）","支払先","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","摘要"},
// 改良No.21-0086,21-0529 cor <--
// ID_FORMNO_091 買掛金
{"科目","登録番号（法人番号）","相手先（名称）","相手先（所在地）","期末現在高","摘要"},
// ID_FORMNO_101 仮受金
{"科目","登録番号（法人番号）","相手先（名称）","相手先（所在地）","相手先（関係）","期末現在高","摘要"},
// ID_FORMNO_102 源泉取得税
{"支払年月","所得の種類","期末現在高",""},
// ID_FORMNO_111 借入金
{"科目","借入先（名称）","借入先（所在地）","借入先（関係）","期末現在高","期中の支払利子額","利率","担保の内容"},
// ID_FORMNO_121 土地の売上高等
{"区分","商品の所在地","地目","総面積","売上年月","登録番号（法人番号）","売上先（名称）","売上先（所在地）","売上面積","売上金額（上段）","売上金額（下段）","売上商品の取得年"},
// ID_FORMNO_131 売上高等の事業所別
{"事業所の名称","事業所（所在地）","責任者氏名","代表者との関係","事業等の内容","売上高","期末棚卸高","期末従事員数","源泉所得税納付署","摘要"},
// ID_FORMNO_141 役員報酬手当金等
{"役職名","担当業務","氏名","代表者との関係","住所","常勤・非常勤の別","使用人職務分","定期同額給与","事前確定届出給与","業績連動給与","その他","退職給与","役員給与計"},
// ID_FORMNO_142 人件費
{""},
// ID_FORMNO_151 地代家賃等
{"地代・家賃の区分","借地物件の用途","所在地","登録番号（法人番号）","貸主の名称","貸主の所在地","支払対象期間","支払賃借料","摘要"},
// ID_FORMNO_152 権利金等の期中支払
{"登録番号（法人番号）","支払先の名称","支払先の所在地","支払年月日","支払金額","権利金等の内容","摘要"},
// ID_FORMNO_153 工業所有権等の使用料
{"名称","登録番号（法人番号）","支払先の名称","支払先の所在地","契約期間","支払対象期間","支払金額","摘要"},
// ID_FORMNO_161 雑益
{"科目","取引の内容","登録番号（法人番号）","相手先（名称）","相手先（所在地）","金額"},
// ID_FORMNO_162 雑損失
{"科目","取引の内容","登録番号（法人番号）","相手先（名称）","相手先（所在地）","金額"},
// ID_FORMNO_171 その他科目の内訳書①
{"科目","登録番号（法人番号）","相手先（名称）","相手先（所在地）","期末現在高","摘要"},
// ID_FORMNO_181 その他科目の内訳書②
{"科目","","期末現在高","摘要"},
{""}
};

// インボイス番号対応版　簡略化したタイトル
CString	R_Title_4[30][20]={
// ID_FORMNO_011 預貯金
{"金融機関名","支店名","種類","口座番号","期末現在高","摘要"},
// ID_FORMNO_021 受取手形
{"科目","登録番号","振出人","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","割引銀行及び支店等","摘要"},
// ID_FORMNO_031 売掛金
{"科目","登録番号","相手先(名称)","相手先(所在地)","期末現在高","摘要"},
// ID_FORMNO_041 仮払金
{"科目","登録番号","相手先(名称)","相手先(所在地)","相手先(関係)","期末現在高","摘要"},
// ID_FORMNO_042 貸付金
{"登録番号","貸付先(名称)","貸付先(所在地)","貸付先(関係)","期末現在高","受取利息","利率","担保の内容"},
// ID_FORMNO_051 棚卸資産
{"科目","品目","数量","単位","単価","期末現在高","摘要"},
// ID_FORMNO_061 有価証券
{"区分","種類","銘柄","期末(数量)","(単位)","期末(上段)","期末(下段)","異動年月日","異動事由","数量","単位","金額","売却先(名称)","売却先(所在地)","摘要"},
// ID_FORMNO_071 固定資産
{"種類･構造","用途","面積","物件の所在地","期末現在高","異動年月日","異動事由","取得価額","帳簿価額","登録番号","売却先(名称)","売却先(所在地)","取得年月"},
// ID_FORMNO_081 支払手形
// 改良No.21-0086,21-0529 cor -->
//{"登録番号","支払先","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","摘要"},
// ------------------------------
{"科目","登録番号","支払先","振出年月日","支払期日","支払銀行名称","支払銀行支店名","金額","摘要"},
// 改良No.21-0086,21-0529 cor <--
// ID_FORMNO_091 買掛金
{"科目","登録番号","相手先(名称)","相手先(所在地)","期末現在高","摘要"},
// ID_FORMNO_101 仮受金
{"科目","登録番号","相手先(名称)","相手先(所在地)","相手先(関係)","期末現在高","摘要"},
// ID_FORMNO_102 源泉取得税
{"支払年月","所得の種類","期末現在高",""},
// ID_FORMNO_111 借入金
{"科目","借入先(名称)","借入先(所在地)","借入先(関係)","期末現在高","支払利子","利率","担保の内容"},
// ID_FORMNO_121 土地の売上高等
{"区分","商品の所在地","地目","総面積","売上年月","登録番号","売上先(名称)","売上先(所在地)","売上面積","売上金額(上段)","売上金額(下段)","取得年"},
// ID_FORMNO_131 売上高等の事業所別
{"事業所の名称","事業所(所在地)","責任者氏名","代表者との関係","事業等の内容","売上高","期末棚卸高","従事員数","源泉所得税納付署","摘要"},
// ID_FORMNO_141 役員報酬手当金等
{"役職名","担当業務","氏名","代表者との関係","住所","別","使用人職務分","定期同額給与","事前確定届出給与","業績連動給与","その他","退職給与","役員給与計"},
// ID_FORMNO_142 人件費
{""},
// ID_FORMNO_151 地代家賃等
{"地代･家賃区分","借地物件の用途","所在地","登録番号","貸主の名称","貸主の所在地","支払対象期間","支払賃借料","摘要"},
// ID_FORMNO_152 権利金等の期中支払
{"登録番号","支払先の名称","支払先の所在地","支払年月日","支払金額","権利金等の内容","摘要"},
// ID_FORMNO_153 工業所有権等の使用料
{"名称","登録番号","支払先の名称","支払先の所在地","契約期間","支払対象期間","支払金額","摘要"},
// ID_FORMNO_161 雑益
{"科目","取引の内容","登録番号","相手先(名称)","相手先(所在地)","金額"},
// ID_FORMNO_162 雑損失
{"科目","取引の内容","登録番号","相手先(名称)","相手先(所在地)","金額"},
// ID_FORMNO_171 その他科目の内訳書①
{"科目","登録番号","相手先(名称)","相手先(所在地)","期末現在高","摘要"},
// ID_FORMNO_181 その他科目の内訳書②
{"科目","","期末現在高","摘要"},
{""}
};
// インボイス登録番号追加対応_23/09/11 add <--

// No.158072 add -->
int						MSign=0;
// No.158072 add <--

// CdlgDisplay2 ダイアログ

IMPLEMENT_DYNAMIC(CdlgDisplay2, ICSDialog)

//--------------------------------------------------
//	標準コンストラクタ
//--------------------------------------------------
CdlgDisplay2::CdlgDisplay2(CWnd* pParent /*=NULL*/) : ICSDialog(CdlgDisplay2::IDD, pParent)
{
}

//--------------------------------------------------
//	コンストラクタ
//--------------------------------------------------
CdlgDisplay2::CdlgDisplay2(UINT id, CWnd* pParent /*=NULL*/) : ICSDialog(id, pParent)
{
}

//--------------------------------------------------
//	デストラクタ
//--------------------------------------------------
CdlgDisplay2::~CdlgDisplay2()
{
}

void CdlgDisplay2::DoDataExchange(CDataExchange* pDX)
{
	ICSDialog::DoDataExchange(pDX);
	DDX_Control(pDX, IDC_DISPLAY_REPORT, m_RepDisplay);
	DDX_Control(pDX, IDC_HOSOKU_LABEL, m_lblHosoku);
	DDX_Control(pDX, ID_DELETE_BUTTON, m_btnDelete);
	DDX_Control(pDX, ID_OK_BUTTON, m_btnOK);
	DDX_Control(pDX, IDCANCEL, m_btnCancel);
	DDX_Control(pDX, ID_ALL_BUTTON_ON, m_btnAllOn);
	DDX_Control(pDX, ID_ALL_BUTTON_OFF, m_btnAllOff);
// No.200602 add -->
	DDX_Control(pDX, IDC_CHECK_RYAKU, m_chkRyaku);
// No.200602 add <--
}

BEGIN_MESSAGE_MAP(CdlgDisplay2, ICSDialog)
	ON_WM_SIZE()
	ON_WM_CTLCOLOR()
	ON_BN_CLICKED(ID_OK_BUTTON, &CdlgDisplay2::OnBnClickedOkButton)
	ON_BN_CLICKED(ID_DELETE_BUTTON, &CdlgDisplay2::OnBnClickedDeleteButton)
	ON_BN_CLICKED(ID_ALL_BUTTON_ON, &CdlgDisplay2::OnBnClickedAllButtonOn)
	ON_BN_CLICKED(ID_ALL_BUTTON_OFF, &CdlgDisplay2::OnBnClickedAllButtonOff)
	ON_NOTIFY(ICS_NM_REPORT_LBUTTONDOWN, IDC_DISPLAY_REPORT, OnNMReportLbuttondownDISPLAY_REPORT)
	ON_MESSAGE(WM_USER_RCCLICK, OnUserRcclick)
	ON_MESSAGE(WM_USER_FOCUSSET, OnUserFocusset)
	ON_BN_SETFOCUS(ID_DELETE_BUTTON, &CdlgDisplay2::OnBnSetfocusDeleteButton)
	ON_BN_SETFOCUS(ID_OK_BUTTON, &CdlgDisplay2::OnBnSetfocusOkButton)
	ON_BN_SETFOCUS(IDCANCEL, &CdlgDisplay2::OnBnSetfocusCancelButton)
	ON_BN_SETFOCUS(ID_ALL_BUTTON_ON, &CdlgDisplay2::OnBnSetfocusAllButtonOn)
	ON_BN_SETFOCUS(ID_ALL_BUTTON_OFF, &CdlgDisplay2::OnBnSetfocusAllButtonOff)
// No.200602 add -->
	ON_BN_CLICKED(IDC_CHECK_RYAKU, &CdlgDisplay2::OnBnClickedCheckRyaku)
	ON_BN_SETFOCUS(IDC_CHECK_RYAKU, &CdlgDisplay2::OnBnSetfocusCheckRyaku)
// No.200602 add <--
// No.158072 add -->
	ON_MESSAGE(WM_USER_REPORT_SORT, OnUserReportSort)
// No.158072 add <--
END_MESSAGE_MAP()


// CdlgDisplay2 メッセージ ハンドラ

void CdlgDisplay2::OnSize(UINT nType, int cx, int cy)
{
	ICSDialog::OnSize(nType, cx, cy);
}

HBRUSH CdlgDisplay2::OnCtlColor(CDC* pDC, CWnd* pWnd, UINT nCtlColor)
{
	HBRUSH hbr = ICSDialog::OnCtlColor(pDC, pWnd, nCtlColor);

	return hbr;
}

//--------------------------------------------------
//	ダイアログ表示
//--------------------------------------------------
//	【引数】	CDBZmSub*		…	財務クラス
//				nFormSeq		…	様式シーケンス番号
//				nType			…	種別
//				nNumGroup		…	グループ番号
//				pDataKakutei	…	入力データを確定する
//	【戻値】	ID_DLG_BACK		…	戻すが選択された
//				ID_DLG_BACKALL	…	全て戻すが選択された
//				ID_DLG_CANCEL	…	キャンセルが選択された
//--------------------------------------------------
int CdlgDisplay2::ShowDialog( CDBZmSub* pZmSub /*=NULL*/, short nFormSeq /*=ID_FORMNO_011*/,
							 EnumIdFgShow nType /*=ID_FGSHOW_ZERO*/, int nNumGroup /*=0*/, BOOL pDataKakutei /*=0x04*/ )
{
	m_nRet = ID_DLG_CANCEL;		//	戻値初期化
	m_DataKakutei = pDataKakutei;

	//	データベースハンドルあり？
	if(pZmSub->m_database != NULL)	{
		try{
			//	データベース開いてる？
			if ( pZmSub->m_database->IsOpen() ){
				m_ZmSub = pZmSub;
				m_pDB = pZmSub->m_database;	//	データベースハンドル取得
				m_nFormSeq = nFormSeq;		//	様式シーケンス番号取得
				m_nType = nType;			//	種別取得
				m_nNumGroup = nNumGroup;	//	グループ番号

// No.158072 add -->
				MSign = 0;
// No.158072 add <--

				DoModal();					//	モーダルで表示

// No.200602 del -->
//// midori 190301 del -->
//				//m_RepDisplay.SaveEnv(m_ZmSub,m_nFormSeq);
//// midori 190301 del <--
//// midori 190301 add -->
//				if(bG_Kanso == TRUE)	m_Ofs = 1000;
//				else					m_Ofs = 0;
//				m_RepDisplay.SaveEnv(m_ZmSub,m_nFormSeq+m_Ofs);
//// midori 190301 add <--
// No.200602 del <--
// No.200602 add -->
				// 列幅を保存する
				SaveReportnWidth();
				// 「全項目を１画面に表示する」のチェックを保存する
				CdbUcInfSub		m_fcRec(m_pDB);
				if(m_fcRec.RequeryFormSeq(m_nFormSeq) == DB_ERR_OK)	{
					if( !(m_fcRec.IsEOF()) )	{
						CCtrlSubGeneralVar cs(m_fcRec);
						m_fcRec.Edit();
						cs.bKanryakuSw		= m_Flg1;
						cs.Set(m_fcRec);
						m_fcRec.Update();
					}
				}
// No.200602 add <--
			}
		}
		catch(...){
		}
	}
	
	//	戻値を返す
	return( m_nRet );
}

//--------------------------------------------------
//	ダイアログ初期化
//--------------------------------------------------
BOOL CdlgDisplay2::OnInitDialog()
{
	ICSDialog::OnInitDialog();

	m_SelectColor = RGB(127,127,127);

	//	種別で分岐
	switch( m_nType ){
	//------------------------------
	//	一括金額
	//------------------------------
	case ID_FGSHOW_IKKATU:
		SetWindowText( "一括金額参照" );		//	ダイアログタイトル変更
		m_btnDelete.ShowWindow( FALSE );		//	削除ボタンを非表示
		break;
	//------------------------------
	//	一時保管
	//------------------------------
	case ID_FGSHOW_HOKAN:
		SetWindowText( "保管参照" );			//	ダイアログタイトル変更
		m_btnDelete.ShowWindow( TRUE );			//	削除ボタンを表示
		break;
	}

	if(m_DataKakutei)	{
		// 入力確定済み
		m_lblHosoku.ShowWindow(SW_HIDE);
	}
	else	{
		// 操作の補足メッセージを表示
		VERIFY(m_font.CreatePointFont(105, "MS ｺﾞｼｯｸ"));
		m_lblHosoku.SetFont(&m_font);		//	フォントサイズの設定
		m_lblHosoku.UpdateCaption( _T("クリック又はスペースキーで選択/解除（複数選択可能）\n※選択データはグレーで表示"), 0 );
	}
	
	// 背景色取得
	ICSColorInfo	icsColInfo;
	m_ViewColor = GetSysColor(COLOR_WINDOW);
	if(((ICSWinApp *)AfxGetApp())->GetStanderdColor(icsColInfo) == 0)	{
		if(icsColInfo.m_swOnOff == ID_ICS_STANDARDCOLOR_ON)	{
			m_ViewColor = icsColInfo.BackColor();
		}
	}

// No.200602 del -->
	//// レポートコントロールの初期化、ヘッダ部作成
	//InitReportHeader(m_nFormSeq);

	//// レポートコントロールのデータ作成
	//InitReportData(m_nFormSeq, m_pDB, m_nType);
// No.200602 del <--
// No.200602 add -->
	// 「全項目を１画面に表示する」のサインを取得
	m_Flg1 = 0;
	if(bG_Kanso == TRUE && m_nFormSeq != ID_FORMNO_102) {
		CdbUcInfSub		m_fcRec(m_pDB);
		if(m_fcRec.RequeryFormSeq(m_nFormSeq) == DB_ERR_OK)	{
			if( !(m_fcRec.IsEOF()) )	{
				CCtrlSubGeneralVar	cs(m_fcRec);
				if(cs.bKanryakuSw)		m_Flg1 = 1;
			}
		}
	}

	// 「全項目を１画面に表示する」のチェックを設定
	m_chkRyaku.SetCheck(m_Flg1);
// No.200602 add <--

	// リサイズ
	OnInitDialogEX();

// No.200602 add -->
	CRect				rec;

	// レポートの幅を取得
	m_RepDisplay.GetClientRect( &rec );
	ScreenToClient( rec );
	m_widthAll = rec.Width();

// No.158072 add -->
	m_SortSw[0] = -1;	// ソートカラム
	m_SortSw[1] = 0;		// ソートサイン 0:なし、1:昇順、2:降順
// No.158072 add <--
// 21/06/24_01 add -->
	for(int ii = 0; ii < 20; ii++) {
		m_DtUse[ii] = 0;
	}
// 21/06/24_01 add <--

	// レポートコントロールの初期化、ヘッダ部作成
// No.158013 del -->
	//InitReportHeader(m_nFormSeq);
// No.158013 del <--
// No.158013 add -->
	InitReportHeader(m_nFormSeq, 0);
// No.158013 add <--

	// レポートコントロールのデータ作成
	InitReportData(m_nFormSeq, m_pDB, m_nType);

	int		ii=0;
	int		sign=0;
	if(bG_Kanso == FALSE)	{
		// 簡素化前様式の場合、「全項目を１画面に表示する」は非表示
		m_chkRyaku.EnableWindow(FALSE);
		m_chkRyaku.ShowWindow(SW_HIDE);
	}
	else	{
		sign = 0;
// No.158014 del -->
		//m_chkRyaku.ShowWindow(SW_SHOW);
		//// 簡素化様式でデータが１件も無い場合、「全項目を１画面に表示する」はDisable
		//if(m_nFormSeq == ID_FORMNO_102)	m_chkRyaku.EnableWindow(FALSE);
		//else							m_chkRyaku.EnableWindow(TRUE);
// No.158014 del <--
// No.158014 add -->
		// 簡素化様式で様式⑩－２は「全項目を１画面に表示する」はHide
		if(m_nFormSeq == ID_FORMNO_102)	{
			m_chkRyaku.EnableWindow(FALSE);
			m_chkRyaku.ShowWindow(SW_HIDE);
		}
		else {
			m_chkRyaku.ShowWindow(SW_SHOW);
			m_chkRyaku.EnableWindow(TRUE);
		}
// No.158014 add <--
	}
// No.200602 add <--

	// フォーカスセット
	m_RepDisplay.SetFocus();
	m_RepDisplay.SetFocusedRow(0);

	//	戻値を返す
	return( TRUE );
}

// No.200602 del -->
////--------------------------------------------------
////	レポートコントロールの初期化、ヘッダ部作成
////--------------------------------------------------
////	【引数】	nFormSeq	…	様式シーケンス番号
////	【戻値】	なし
////--------------------------------------------------
//void CdlgDisplay2::InitReportHeader(short nFormSeq)
//{
//	int			ii=0;
//	int			cnt=0;
//	BOOL		flg=FALSE;		// 自動リサイズフラグ 様式⑩－２のみ列数が少ないため、1頁内で自動調整を行う
//	CFont*		pFont;
//	CRect		rec;
//	LOGFONT		font={0};
//	ICSReportColumns* clms;
//	ICSReportColumn* clm;
//
//	// レポートをクリア
//	m_RepDisplay.RemoveAllRecords();
//	m_RepDisplay.RemoveColumn(-1);
//
//	// カラムタイトルをクリア
//	for(ii=0; ii<20; ii++)	{
//		m_nColumnTitle[ii].Empty();
//		m_nColumnWidth[ii] = 0;
//	}
//
//	//-----------------------------------
//	//	カラムを追加
//	//-----------------------------------
//	//	様式で分岐
//	//	カラムのサイズは下記の幅で計算して設定
//	//	データ部 全角1文字幅:17
//	//	データ部 半角1文字幅:9
//	//	タイトル部：全角1文字幅:18
//	//	各列に+9の幅を余白として持たせる、タイトル部で計算を行った場合は+18の幅を余白として持たせる
//	//	※様式⑩－２のみ自動調整を行うため、幅調整の計算方法が異なる
//	switch(nFormSeq)	{
//		//	①.預貯金等［様式011］
//		case ID_FORMNO_011:
//// midori 190301 del -->
//			////	カラム最大値
//			//m_nColumnMax = 5;
//			////	カラムタイトル設定
//			//m_nColumnTitle[0] = "金融機関名";
//			//m_nColumnTitle[1] = "種類";
//			//m_nColumnTitle[2] = "口座番号";
//			//m_nColumnTitle[3] = "期末現在高";
//			//m_nColumnTitle[4] = "摘要";
//			////	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			//m_nColumnWidth[0] = (21 * 17) + 9;
//			//m_nColumnWidth[1] = (12 * 17) + 9;
//			//m_nColumnWidth[2] = (14 *  9) + 9;
//			//m_nColumnWidth[3] = (14 *  9) + 9;
//			//m_nColumnWidth[4] = (40 * 17) + 9;
//			////自動調整を行わない
//			//flg = FALSE;
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				//	カラム最大値
//				m_nColumnMax = 6;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "金融機関名";
//				m_nColumnTitle[1] = "支店名";
//				m_nColumnTitle[2] = "種類";
//				m_nColumnTitle[3] = "口座番号";
//				m_nColumnTitle[4] = "期末現在高";
//				m_nColumnTitle[5] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = (11 * 17) + 9;
//				m_nColumnWidth[1] = (11 * 17) + 9;
//				m_nColumnWidth[2] = (12 * 17) + 9;
//				m_nColumnWidth[3] = (14 *  9) + 9;
//// No.200903 del -->
//				//m_nColumnWidth[4] = (14 *  9) + 9;
//// No.200903 del <--
//// No.200903 add -->
//				m_nColumnWidth[4] = (16 *  9) + 9;
//// No.200903 add <--
//				m_nColumnWidth[5] = (40 * 17) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//			else	{
//				//	カラム最大値
//				m_nColumnMax = 5;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "金融機関名";
//				m_nColumnTitle[1] = "種類";
//				m_nColumnTitle[2] = "口座番号";
//				m_nColumnTitle[3] = "期末現在高";
//				m_nColumnTitle[4] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = (21 * 17) + 9;
//				m_nColumnWidth[1] = (12 * 17) + 9;
//				m_nColumnWidth[2] = (14 *  9) + 9;
//				m_nColumnWidth[3] = (14 *  9) + 9;
//				m_nColumnWidth[4] = (40 * 17) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//// midori 190301 add <--
//			break;
//		//	②.受取手形［様式021］
//		case ID_FORMNO_021:
//// midori 190301 del -->
////			//	カラム最大値
////			m_nColumnMax = 8;
////			//	カラムタイトル設定
////			m_nColumnTitle[0] = "科目";
////			m_nColumnTitle[1] = "振出人";
////			m_nColumnTitle[2] = "振出年月日";
////			m_nColumnTitle[3] = "支払期日";
////			m_nColumnTitle[4] = "支払銀行名";
////			m_nColumnTitle[5] = "金額";
//			//m_nColumnTitle[6] = "割引銀行名";
////			m_nColumnTitle[7] = "摘要";
////			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
////			m_nColumnWidth[0] = (12 * 17) + 9;
////			m_nColumnWidth[1] = (20 * 17) + 9;
////			m_nColumnWidth[2] = (12 *  9) + 9;
////			m_nColumnWidth[3] = (10 *  9) + 9;
////			m_nColumnWidth[4] = (21 * 17) + 9;
////			m_nColumnWidth[5] = (14 *  9) + 9;
////			m_nColumnWidth[6] = (21 * 17) + 9;
////			m_nColumnWidth[7] = (32 * 17) + 9;
////			//自動調整を行わない
////			flg = FALSE;
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				//	カラム最大値
//				m_nColumnMax = 9;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "科目";
//				m_nColumnTitle[1] = "振出人";
//				m_nColumnTitle[2] = "振出年月日";
//				m_nColumnTitle[3] = "支払期日";
//				m_nColumnTitle[4] = "支払銀行名称";
//				m_nColumnTitle[5] = "支払銀行支店名";
//				m_nColumnTitle[6] = "金額";
//				m_nColumnTitle[7] = "割引銀行名及び支店名等";
//				m_nColumnTitle[8] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = (12 * 17) + 9;
//				m_nColumnWidth[1] = (20 * 17) + 9;
//				m_nColumnWidth[2] = (12 *  9) + 9;
//// midori 200101 del -->
//				//m_nColumnWidth[3] = (10 *  9) + 9;
//// midori 200101 del <--
//// midori 200101 add -->
//				m_nColumnWidth[3] = (12 *  9) + 9;
//// midori 200101 add <--
//				m_nColumnWidth[4] = (11 * 17) + 9;
//				m_nColumnWidth[5] = (11 * 17) + 9;
//// No.200903 del -->
//				//m_nColumnWidth[6] = (14 *  9) + 9;
//// No.200903 del <--
//// No.200903 add -->
//				m_nColumnWidth[6] = (16 *  9) + 9;
//// No.200903 add <--
//				m_nColumnWidth[7] = (21 * 17) + 9;
//				m_nColumnWidth[8] = (32 * 17) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//			else	{
//				//	カラム最大値
//				m_nColumnMax = 8;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "科目";
//				m_nColumnTitle[1] = "振出人";
//				m_nColumnTitle[2] = "振出年月日";
//				m_nColumnTitle[3] = "支払期日";
//				m_nColumnTitle[4] = "支払銀行名";
//				m_nColumnTitle[5] = "金額";
//				m_nColumnTitle[6] = "割引銀行名";
//				m_nColumnTitle[7] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = (12 * 17) + 9;
//				m_nColumnWidth[1] = (20 * 17) + 9;
//				m_nColumnWidth[2] = (12 *  9) + 9;
//				m_nColumnWidth[3] = (10 *  9) + 9;
//				m_nColumnWidth[4] = (21 * 17) + 9;
//				m_nColumnWidth[5] = (14 *  9) + 9;
//				m_nColumnWidth[6] = (21 * 17) + 9;
//				m_nColumnWidth[7] = (32 * 17) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//// midori 190301 add <--
//			break;
//		//	③.売掛金［様式031］
//		case ID_FORMNO_031:
//			//	カラム最大値
//			m_nColumnMax = 5;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "科目";
//			m_nColumnTitle[1] = "相手先（名称）";
//			m_nColumnTitle[2] = "相手先（所在地）";
//			m_nColumnTitle[3] = "期末現在高";
//			m_nColumnTitle[4] = "摘要";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//// No.200903 del -->
//			//m_nColumnWidth[3] = ( 14 *  9 ) + 9;
//// No.200903 del <--
//// No.200903 add -->
//			m_nColumnWidth[3] = ( 16 *  9 ) + 9;
//// No.200903 add <--
//			m_nColumnWidth[4] = ( 26 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	④－１.仮払金［様式041］
//		case ID_FORMNO_041:
//			//	カラム最大値
//			m_nColumnMax = 6;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "科目";
//			m_nColumnTitle[1] = "相手先（名称）";
//			m_nColumnTitle[2] = "相手先（所在地）";
//			m_nColumnTitle[3] = "相手先（関係）";
//			m_nColumnTitle[4] = "期末現在高";
//// midori 190301 del -->
//			//m_nColumnTitle[5] = "取引の内容";
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				m_nColumnTitle[5] = "摘要";
//			}
//			else	{
//				m_nColumnTitle[5] = "取引の内容";
//			}
//// midori 190301 add <--
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//			m_nColumnWidth[3] = (  7 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[4] = ( 14 *  9 ) + 9;
//			m_nColumnWidth[5] = ( 20 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	④－２.貸付金［様式042］
//		case ID_FORMNO_042:
//// midori 190301 del -->
//			////	カラム最大値
//			//m_nColumnMax = 8;
//			////	カラムタイトル設定
//			//m_nColumnTitle[0] = "貸付先";
//			//m_nColumnTitle[1] = "法人・代表者との関係";
//			//m_nColumnTitle[2] = "所在地";
//			//m_nColumnTitle[3] = "期末現在高";
//			//m_nColumnTitle[4] = "期中の受取利息額";
//			//m_nColumnTitle[5] = "利率";
//			//m_nColumnTitle[6] = "貸付理由";
//			//m_nColumnTitle[7] = "担保の内容";
//			////	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			//m_nColumnWidth[0] = ( 20 * 17 ) + 9;
//			//m_nColumnWidth[1] = ( 10 * 18 ) + 18;		//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//			//m_nColumnWidth[3] = ( 14 *  9 ) + 9;
//			//m_nColumnWidth[4] = (  8 * 17 ) + 18;		//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[5] = (  6 *  9 ) + 9;
//			//m_nColumnWidth[6] = ( 24 * 17 ) + 9;
//			//m_nColumnWidth[7] = ( 30 * 17 ) + 9;
//			////自動調整を行わない
//			//flg = FALSE;
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				//	カラム最大値
//				m_nColumnMax = 7;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "貸付先（名称）";
//				m_nColumnTitle[1] = "貸付先（所在地）";
//				m_nColumnTitle[2] = "貸付先（関係）";
//				m_nColumnTitle[3] = "期末現在高";
//				m_nColumnTitle[4] = "期中の受取利息額";
//				m_nColumnTitle[5] = "利率";
//				m_nColumnTitle[6] = "担保の内容";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = ( 20 * 17 ) + 9;
//				m_nColumnWidth[1] = ( 40 * 17 ) + 9;
//				m_nColumnWidth[2] = ( 10 * 18 ) + 18;		//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[3] = ( 14 *  9 ) + 9;
//				m_nColumnWidth[4] = (  8 * 17 ) + 18;		//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[5] = (  6 *  9 ) + 9;
//				m_nColumnWidth[6] = ( 30 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//			else	{
//				//	カラム最大値
//				m_nColumnMax = 8;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "貸付先";
//				m_nColumnTitle[1] = "法人・代表者との関係";
//				m_nColumnTitle[2] = "所在地";
//				m_nColumnTitle[3] = "期末現在高";
//				m_nColumnTitle[4] = "期中の受取利息額";
//				m_nColumnTitle[5] = "利率";
//				m_nColumnTitle[6] = "貸付理由";
//				m_nColumnTitle[7] = "担保の内容";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = ( 20 * 17 ) + 9;
//				m_nColumnWidth[1] = ( 10 * 18 ) + 18;		//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//				m_nColumnWidth[3] = ( 14 *  9 ) + 9;
//				m_nColumnWidth[4] = (  8 * 17 ) + 18;		//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[5] = (  6 *  9 ) + 9;
//				m_nColumnWidth[6] = ( 24 * 17 ) + 9;
//				m_nColumnWidth[7] = ( 30 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//// midori 190301 add <--
//			break;
//		//	⑤.棚卸資産［様式051］
//		case ID_FORMNO_051:
//			//	カラム最大値
//			m_nColumnMax = 7;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "科目";
//			m_nColumnTitle[1] = "品目";
//			m_nColumnTitle[2] = "数量";
//			m_nColumnTitle[3] = "単位";
//			m_nColumnTitle[4] = "単価";
//			m_nColumnTitle[5] = "期末現在高";
//			m_nColumnTitle[6] = "摘要";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 12 *  9 ) + 9;
//			m_nColumnWidth[3] = (  3 * 17 ) + 9;
//			m_nColumnWidth[4] = ( 13 * 9 ) + 9;
//			m_nColumnWidth[5] = ( 15 * 9 ) + 9;			//	※自動計算で桁あふれするケースがあり12桁以上は「************」と表示させるため
//			m_nColumnWidth[6] = ( 30 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑥.有価証券［様式061］
//		case ID_FORMNO_061:
//			//	カラム最大値
//// midori 190301 del -->
//			//m_nColumnMax = 14;
//			////	カラムタイトル設定
//			//m_nColumnTitle[0]  = "区分";
//			//m_nColumnTitle[1]  = "種類・銘柄";
//			//m_nColumnTitle[2]  = "期末現在高（数量）";	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnTitle[3]  = "期末現在高（単位）";
//			//m_nColumnTitle[4]  = "期末現在高（上段）";
//			//m_nColumnTitle[5]  = "期末現在高（下段）";
//			//m_nColumnTitle[6]  = "異動年月日";
//			//m_nColumnTitle[7]  = "異動事由";
//			//m_nColumnTitle[8]  = "数量";
//			//m_nColumnTitle[9]  = "単位";
//			//m_nColumnTitle[10] = "金額";
//			//m_nColumnTitle[11] = "売却先（名称）";
//			//m_nColumnTitle[12] = "売却先（所在地）";
//			//m_nColumnTitle[13] = "摘要";
//			////	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			//m_nColumnWidth[0]  = ( 12 * 17 ) + 9;
//			//m_nColumnWidth[1]  = ( 16 * 17 ) + 9;
//			//m_nColumnWidth[2]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[3]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[4]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[5]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[6]  = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[7]  = ( 12 * 17 ) + 9;
//			//m_nColumnWidth[8]  = ( 15 *  9 ) + 9;
//			//m_nColumnWidth[9]  = (  3 * 17 ) + 9;	//	データ部の幅が足りない為、+3（調整値）を加算
//			//m_nColumnWidth[10] = ( 14 *  9 ) + 9;
//			//m_nColumnWidth[11] = ( 30 * 17 ) + 9;
//			//m_nColumnWidth[12] = ( 30 * 17 ) + 9;
//			//m_nColumnWidth[13] = ( 30 * 17 ) + 9;
//			////自動調整を行わない
//			//flg = FALSE;
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				m_nColumnMax = 15;
//				//	カラムタイトル設定
//				m_nColumnTitle[0]  = "区分";
//				m_nColumnTitle[1]  = "種類";
//				m_nColumnTitle[2]  = "銘柄";
//				m_nColumnTitle[3]  = "期末現在高（数量）";	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnTitle[4]  = "期末現在高（単位）";
//				m_nColumnTitle[5]  = "期末現在高（上段）";
//				m_nColumnTitle[6]  = "期末現在高（下段）";
//				m_nColumnTitle[7]  = "異動年月日";
//				m_nColumnTitle[8]  = "異動事由";
//				m_nColumnTitle[9]  = "数量";
//				m_nColumnTitle[10]  = "単位";
//				m_nColumnTitle[11] = "金額";
//				m_nColumnTitle[12] = "売却先（名称）";
//				m_nColumnTitle[13] = "売却先（所在地）";
//				m_nColumnTitle[14] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0]  = ( 12 * 17 ) + 9;
//				m_nColumnWidth[1]  = (  8 * 17 ) + 9;
//				m_nColumnWidth[2]  = (  8 * 17 ) + 9;
//				m_nColumnWidth[3]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[4]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[5]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[6]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[7]  = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[8]  = ( 12 * 17 ) + 9;
//				m_nColumnWidth[9]  = ( 15 *  9 ) + 9;
//				m_nColumnWidth[10]  = (  3 * 17 ) + 9;	//	データ部の幅が足りない為、+3（調整値）を加算
//				m_nColumnWidth[11] = ( 14 *  9 ) + 9;
//				m_nColumnWidth[12] = ( 30 * 17 ) + 9;
//				m_nColumnWidth[13] = ( 30 * 17 ) + 9;
//				m_nColumnWidth[14] = ( 30 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//			else	{
//				m_nColumnMax = 14;
//				//	カラムタイトル設定
//				m_nColumnTitle[0]  = "区分";
//				m_nColumnTitle[1]  = "種類・銘柄";
//				m_nColumnTitle[2]  = "期末現在高（数量）";	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnTitle[3]  = "期末現在高（単位）";
//				m_nColumnTitle[4]  = "期末現在高（上段）";
//				m_nColumnTitle[5]  = "期末現在高（下段）";
//				m_nColumnTitle[6]  = "異動年月日";
//				m_nColumnTitle[7]  = "異動事由";
//				m_nColumnTitle[8]  = "数量";
//				m_nColumnTitle[9]  = "単位";
//				m_nColumnTitle[10] = "金額";
//				m_nColumnTitle[11] = "売却先（名称）";
//				m_nColumnTitle[12] = "売却先（所在地）";
//				m_nColumnTitle[13] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0]  = ( 12 * 17 ) + 9;
//				m_nColumnWidth[1]  = ( 16 * 17 ) + 9;
//				m_nColumnWidth[2]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[3]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[4]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[5]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[6]  = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[7]  = ( 12 * 17 ) + 9;
//				m_nColumnWidth[8]  = ( 15 *  9 ) + 9;
//				m_nColumnWidth[9]  = (  3 * 17 ) + 9;	//	データ部の幅が足りない為、+3（調整値）を加算
//				m_nColumnWidth[10] = ( 14 *  9 ) + 9;
//				m_nColumnWidth[11] = ( 30 * 17 ) + 9;
//				m_nColumnWidth[12] = ( 30 * 17 ) + 9;
//				m_nColumnWidth[13] = ( 30 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//// midori 190301 add <--
//			break;
//		//	⑦.固定資産［様式071］
//		case ID_FORMNO_071:
//			//	カラム最大値
//			m_nColumnMax = 12;
//			//	カラムタイトル設定
//			m_nColumnTitle[0]  = "種類・構造";
//			m_nColumnTitle[1]  = "用途";
//			m_nColumnTitle[2]  = "面積";
//			m_nColumnTitle[3]  = "物件の所在地";
//			m_nColumnTitle[4]  = "期末現在高";
//			m_nColumnTitle[5]  = "異動年月日";
//			m_nColumnTitle[6]  = "異動事由";
//			m_nColumnTitle[7]  = "取得価額";
//			m_nColumnTitle[8]  = "帳簿価額";
//			m_nColumnTitle[9]  = "売却先（名称）";
//			m_nColumnTitle[10] = "売却先（所在地）";
//			m_nColumnTitle[11] = "取得年月";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0]  = ( 14 * 17 ) + 9;
//			m_nColumnWidth[1]  = ( 10 * 17 ) + 9;
//// No.200903 del -->
//			//m_nColumnWidth[2]  = ( 10 *  9 ) + 9;
//// No.200903 del <--
//// No.200903 add -->
//			m_nColumnWidth[2]  = ( 13 *  9 ) + 9;
//// No.200903 add <--
//			m_nColumnWidth[3]  = ( 40 * 17 ) + 9;
//			m_nColumnWidth[4]  = ( 15 *  9 ) + 9;
//			m_nColumnWidth[5]  = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[6]  = ( 12 * 17 ) + 9;
//			m_nColumnWidth[7]  = ( 14 *  9 ) + 9;
//			m_nColumnWidth[8]  = ( 14 *  9 ) + 9;
//			m_nColumnWidth[9]  = ( 30 * 17 ) + 9;
//			m_nColumnWidth[10] = ( 30 * 17 ) + 9;
//			m_nColumnWidth[11] = (  2 * 17 ) + ( 5 * 9 ) + 18;	//	垂直スクロールバー用に更に余白１文字幅追加
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑧.支払手形［様式081］
//		case ID_FORMNO_081:
//			//	カラム最大値
//// midori 190301 del -->
//			//m_nColumnMax = 6;
//			////	カラムタイトル設定
//			//m_nColumnTitle[0] = "支払先";
//			//m_nColumnTitle[1] = "振出年月日";
//			//m_nColumnTitle[2] = "支払期日";
//			//m_nColumnTitle[3] = "支払銀行名";
//			//m_nColumnTitle[4] = "金額";
//			//m_nColumnTitle[5] = "摘要";
//			////	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			//m_nColumnWidth[0] = ( 20 * 17 ) + 9;
//			//m_nColumnWidth[1] = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[2] = (  4 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[3] = ( 21 * 17 ) + 9;
//			//m_nColumnWidth[4] = ( 14 *  9 ) + 9;
//			//m_nColumnWidth[5] = ( 40 * 17 ) + 9;
//			////自動調整を行わない
//			//flg = FALSE;
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				m_nColumnMax = 7;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "支払先";
//				m_nColumnTitle[1] = "振出年月日";
//				m_nColumnTitle[2] = "支払期日";
//				m_nColumnTitle[3] = "支払銀行名称";
//				m_nColumnTitle[4] = "支払銀行支店名";
//				m_nColumnTitle[5] = "金額";
//				m_nColumnTitle[6] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = ( 20 * 17 ) + 9;
//				m_nColumnWidth[1] = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//// midori 200101 del -->
//				//m_nColumnWidth[2] = (  4 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//// midori 200101 del <--
//// midori 200101 add -->
//				m_nColumnWidth[2] = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//// midori 200101 add <--
//				m_nColumnWidth[3] = ( 11 * 17 ) + 9;
//				m_nColumnWidth[4] = ( 11 * 17 ) + 9;
//// No.200903 del -->
//				//m_nColumnWidth[5] = ( 14 *  9 ) + 9;
//// No.200903 del <--
//// No.200903 add -->
//				m_nColumnWidth[5] = ( 16 *  9 ) + 9;
//// No.200903 add <--
//				m_nColumnWidth[6] = ( 40 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//			else	{
//				m_nColumnMax = 6;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "支払先";
//				m_nColumnTitle[1] = "振出年月日";
//				m_nColumnTitle[2] = "支払期日";
//				m_nColumnTitle[3] = "支払銀行名";
//				m_nColumnTitle[4] = "金額";
//				m_nColumnTitle[5] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = ( 20 * 17 ) + 9;
//				m_nColumnWidth[1] = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[2] = (  4 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[3] = ( 21 * 17 ) + 9;
//				m_nColumnWidth[4] = ( 14 *  9 ) + 9;
//				m_nColumnWidth[5] = ( 40 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//// midori 190301 add <--
//			break;
//		//	⑨.買掛金［様式091］
//		case ID_FORMNO_091:
//			//	カラム最大値
//			m_nColumnMax = 5;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "科目";
//			m_nColumnTitle[1] = "相手先（名称）";
//			m_nColumnTitle[2] = "相手先（所在地）";
//			m_nColumnTitle[3] = "期末現在高";
//			m_nColumnTitle[4] = "摘要";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//// No.200903 del -->
//			//m_nColumnWidth[3] = ( 14 *  9 ) + 9;
//// No.200903 del <--
//// No.200903 add -->
//			m_nColumnWidth[3] = ( 16 *  9 ) + 9;
//// No.200903 add <--
//			m_nColumnWidth[4] = ( 20 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑩ー１.仮受金［様式101］
//		case ID_FORMNO_101:
//			//	カラム最大値
//			m_nColumnMax = 6;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "科目";
//			m_nColumnTitle[1] = "相手先（名称）";
//			m_nColumnTitle[2] = "相手先（所在地）";
//			m_nColumnTitle[3] = "相手先（関係）";
//			m_nColumnTitle[4] = "期末現在高";
//// midori 190301 del -->
//			//m_nColumnTitle[5] = "取引の内容";
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				m_nColumnTitle[5] = "摘要";
//			}
//			else	{
//				m_nColumnTitle[5] = "取引の内容";
//			}
//// midori 190301 add <--
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//			m_nColumnWidth[3] = (  7 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[4] = ( 14 *  9 ) + 9;
//			m_nColumnWidth[5] = ( 20 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑩ー２.源泉取得税［様式102］
//		case ID_FORMNO_102:
//			//	カラム最大値
//			m_nColumnMax = 4;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "支払年月";
//			m_nColumnTitle[1] = "所得の種類";
//			m_nColumnTitle[2] = "期末現在高";
//			m_nColumnTitle[3] = "";
//			//	カラム幅設定％で値を代入
//			m_nColumnWidth[0] = 10;
//			m_nColumnWidth[1] = 12;
//			m_nColumnWidth[2] = 14;
//			// レポートコントロールの幅を調整する
//			// コントロールの幅 - 各列幅
//			m_nColumnWidth[3] = 64;
//			//自動調整を行う
//			flg = TRUE;
//			break;
//		//	⑪.借入金［様式111］
//		case ID_FORMNO_111:
//// midori 190301 del -->
//			////	カラム最大値
//			//m_nColumnMax = 9;
//			////	カラムタイトル設定
//			//m_nColumnTitle[0] = "科目";
//			//m_nColumnTitle[1] = "借入先";
//			//m_nColumnTitle[2] = "法人・代表者との関係";
//			//m_nColumnTitle[3] = "所在地";
//			//m_nColumnTitle[4] = "期末現在高";
//			//m_nColumnTitle[5] = "期中の支払利子額";
//			//m_nColumnTitle[6] = "利率";
//			//m_nColumnTitle[7] = "借入理由";
//			//m_nColumnTitle[8] = "担保の内容";
//			////	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			//m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			//m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//			//m_nColumnWidth[2] = ( 10 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[3] = ( 40 * 17 ) + 9;
//			//m_nColumnWidth[4] = ( 14 *  9 ) + 9;
//			//m_nColumnWidth[5] = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[6] = (  7 *  9 ) + 9;
//			//m_nColumnWidth[7] = ( 20 * 17 ) + 9;
//			//m_nColumnWidth[8] = ( 26 * 17 ) + 9;
//			////自動調整を行わない
//			//flg = FALSE;
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				//	カラム最大値
//				m_nColumnMax = 8;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "科目";
//				m_nColumnTitle[1] = "借入先（名称）";
//				m_nColumnTitle[2] = "借入先（所在地）";
//				m_nColumnTitle[3] = "借入先（関係）";
//				m_nColumnTitle[4] = "期末現在高";
//				m_nColumnTitle[5] = "期中の支払利子額";
//				m_nColumnTitle[6] = "利率";
//				m_nColumnTitle[7] = "担保の内容";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//				m_nColumnWidth[3] = ( 10 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[4] = ( 14 *  9 ) + 9;
//				m_nColumnWidth[5] = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[6] = (  7 *  9 ) + 9;
//				m_nColumnWidth[7] = ( 26 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//			else	{
//				//	カラム最大値
//				m_nColumnMax = 9;
//				//	カラムタイトル設定
//				m_nColumnTitle[0] = "科目";
//				m_nColumnTitle[1] = "借入先";
//				m_nColumnTitle[2] = "法人・代表者との関係";
//				m_nColumnTitle[3] = "所在地";
//				m_nColumnTitle[4] = "期末現在高";
//				m_nColumnTitle[5] = "期中の支払利子額";
//				m_nColumnTitle[6] = "利率";
//				m_nColumnTitle[7] = "借入理由";
//				m_nColumnTitle[8] = "担保の内容";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//				m_nColumnWidth[2] = ( 10 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[3] = ( 40 * 17 ) + 9;
//				m_nColumnWidth[4] = ( 14 *  9 ) + 9;
//				m_nColumnWidth[5] = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[6] = (  7 *  9 ) + 9;
//				m_nColumnWidth[7] = ( 20 * 17 ) + 9;
//				m_nColumnWidth[8] = ( 26 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//// midori 190301 add <--
//			break;
//		//	⑫.土地の売上高等［様式121］
//		case ID_FORMNO_121:
//			//	カラム最大値
//			m_nColumnMax = 11;
//			//	カラムタイトル設定
//			m_nColumnTitle[0]  = "区分";
//			m_nColumnTitle[1]  = "商品の所在地";
//			m_nColumnTitle[2]  = "地目";
//			m_nColumnTitle[3]  = "総面積";
//			m_nColumnTitle[4]  = "売上年月";
//			m_nColumnTitle[5]  = "売上先（名称）";
//			m_nColumnTitle[6]  = "売上先（所在地）";
//			m_nColumnTitle[7]  = "売上面積";
//			m_nColumnTitle[8]  = "売上金額（上段）";
//			m_nColumnTitle[9]  = "売上金額（下段）";
//			m_nColumnTitle[10] = "売上商品の取得年";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0]  = (  5 * 17 ) + 9;
//			m_nColumnWidth[1]  = ( 30 * 17 ) + 9;
//			m_nColumnWidth[2]  = (  8 * 17 ) + 9;
//// No.200903 del -->
//			//m_nColumnWidth[3]  = ( 10 *  9 ) + 9;
//// No.200903 del <--
//// No.200903 add -->
//			m_nColumnWidth[3]  = ( 13 *  9 ) + 9;
//// No.200903 add <--
//			m_nColumnWidth[4]  = (  4 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[5]  = ( 20 * 17 ) + 9;
//			m_nColumnWidth[6]  = ( 40 * 17 ) + 9;
//// No.200903 del -->
//			//m_nColumnWidth[7]  = ( 10 *  9 ) + 9;
//// No.200903 del <--
//// No.200903 add -->
//			m_nColumnWidth[7]  = ( 13 *  9 ) + 9;
//// No.200903 add <--
//			m_nColumnWidth[8]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[9]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[10] = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑬.売上高等の事業所別［様式131］
//		case ID_FORMNO_131:
//// midori 190301 del -->
//			//m_nColumnMax = 11;										//	カラム最大値
//			////	カラムタイトル設定
//			//m_nColumnTitle[0]  = "事業所の名称";
//			//m_nColumnTitle[1]  = "事業所（所在地）";
//			//m_nColumnTitle[2]  = "責任者氏名";
//			//m_nColumnTitle[3]  = "代表者との関係";
//			//m_nColumnTitle[4]  = "事業等の内容";
//			//m_nColumnTitle[5]  = "売上高";
//			//m_nColumnTitle[6]  = "期末棚卸高";
//			//m_nColumnTitle[7]  = "期末従業員数";
//			//m_nColumnTitle[8]  = "使用建物の延面積";
//			//m_nColumnTitle[9]  = "源泉所得税納付署";
//			//m_nColumnTitle[10] = "摘要";
//			////	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			//m_nColumnWidth[0]  = ( 20 * 17 ) + 9;
//			//m_nColumnWidth[1]  = ( 40 * 17 ) + 9;
//			//m_nColumnWidth[2]  = ( 16 * 17 ) + 9;
//			//m_nColumnWidth[3]  = (  8 * 17 ) + 9;
//			//m_nColumnWidth[4]  = ( 15 * 17 ) + 9;
//			//m_nColumnWidth[5]  = ( 14 *  9 ) + 9;
//			//m_nColumnWidth[6]  = ( 14 *  9 ) + 9;
//			//m_nColumnWidth[7]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[8]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			//m_nColumnWidth[9]  = ( 10 * 17 ) + 9;
//			//m_nColumnWidth[10] = ( 24 * 17 ) + 9;
//			////自動調整を行わない
//			//flg = FALSE;
//			//break;
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				m_nColumnMax = 10;										//	カラム最大値
//				//	カラムタイトル設定
//				m_nColumnTitle[0]  = "事業所の名称";
//				m_nColumnTitle[1]  = "事業所（所在地）";
//				m_nColumnTitle[2]  = "責任者氏名";
//				m_nColumnTitle[3]  = "代表者との関係";
//				m_nColumnTitle[4]  = "事業等の内容";
//				m_nColumnTitle[5]  = "売上高";
//				m_nColumnTitle[6]  = "期末棚卸高";
//				m_nColumnTitle[7]  = "期末従事員数";
//				m_nColumnTitle[8]  = "源泉所得税納付署";
//				m_nColumnTitle[9] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0]  = ( 20 * 17 ) + 9;
//				m_nColumnWidth[1]  = ( 40 * 17 ) + 9;
//				m_nColumnWidth[2]  = ( 16 * 17 ) + 9;
//				m_nColumnWidth[3]  = (  8 * 17 ) + 9;
//				m_nColumnWidth[4]  = ( 15 * 17 ) + 9;
//				m_nColumnWidth[5]  = ( 14 *  9 ) + 9;
//				m_nColumnWidth[6]  = ( 14 *  9 ) + 9;
//				m_nColumnWidth[7]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[8]  = ( 10 * 17 ) + 9;
//				m_nColumnWidth[9] = ( 24 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//			else	{
//				m_nColumnMax = 11;										//	カラム最大値
//				//	カラムタイトル設定
//				m_nColumnTitle[0]  = "事業所の名称";
//				m_nColumnTitle[1]  = "事業所（所在地）";
//				m_nColumnTitle[2]  = "責任者氏名";
//				m_nColumnTitle[3]  = "代表者との関係";
//				m_nColumnTitle[4]  = "事業等の内容";
//				m_nColumnTitle[5]  = "売上高";
//				m_nColumnTitle[6]  = "期末棚卸高";
//				m_nColumnTitle[7]  = "期末従事員数";
//				m_nColumnTitle[8]  = "使用建物の延面積";
//				m_nColumnTitle[9]  = "源泉所得税納付署";
//				m_nColumnTitle[10] = "摘要";
//				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//				m_nColumnWidth[0]  = ( 20 * 17 ) + 9;
//				m_nColumnWidth[1]  = ( 40 * 17 ) + 9;
//				m_nColumnWidth[2]  = ( 16 * 17 ) + 9;
//				m_nColumnWidth[3]  = (  8 * 17 ) + 9;
//				m_nColumnWidth[4]  = ( 15 * 17 ) + 9;
//				m_nColumnWidth[5]  = ( 14 *  9 ) + 9;
//				m_nColumnWidth[6]  = ( 14 *  9 ) + 9;
//				m_nColumnWidth[7]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[8]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//				m_nColumnWidth[9]  = ( 10 * 17 ) + 9;
//				m_nColumnWidth[10] = ( 24 * 17 ) + 9;
//				//自動調整を行わない
//				flg = FALSE;
//			}
//			break;
//// midori 190301 add <--
//		//	⑭ー１.役員報酬手当金等［様式141］
//		case ID_FORMNO_141:
//			//	カラム最大値
//			m_nColumnMax = 13;
//			//	カラムタイトル設定
//			m_nColumnTitle[0]  = "役職名";
//			m_nColumnTitle[1]  = "担当業務";
//			m_nColumnTitle[2]  = "氏名";
//			m_nColumnTitle[3]  = "代表者との関係";
//			m_nColumnTitle[4]  = "住所";
//			m_nColumnTitle[5]  = "常勤・非常勤の別";
//			m_nColumnTitle[6]  = "使用人職務分";
//			m_nColumnTitle[7]  = "定期同額給与";
//			m_nColumnTitle[8]  = "事前確定届出給与";		// 2006.10.23：新会社法対応
//// midori 190301 del -->
//			//m_nColumnTitle[9]  = "利益連動給与";			// 2006.10.23：新会社法対応
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				m_nColumnTitle[9]  = "業績連動給与";			// 2006.10.23：新会社法対応
//			}
//			else	{
//				m_nColumnTitle[9]  = "利益連動給与";			// 2006.10.23：新会社法対応
//			}
//// midori 190301 add <--
//			m_nColumnTitle[10] = "その他";					// 2006.10.23：新会社法対応
//			m_nColumnTitle[11] = "退職給与";				// 2006.10.23：新会社法対応
//			m_nColumnTitle[12] = "役員給与計";				// 2006.10.23：新会社法対応
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0]  = (  8 * 17 ) + 9;
//			m_nColumnWidth[1]  = (  8 * 17 ) + 9;
//			m_nColumnWidth[2]  = ( 24 * 17 ) + 9;
//			m_nColumnWidth[3]  = (  7 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[4]  = ( 40 * 17 ) + 9;
//			m_nColumnWidth[5]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[6]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[7]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[8]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[9]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[10] = ( 11 *  9 ) + 9;
//			m_nColumnWidth[11] = ( 11 *  9 ) + 9;
//			m_nColumnWidth[12] = ( 13 *  9 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑭ー２.人件費［様式142］
//		case ID_FORMNO_142:
//			//	基本的には呼ばれないので何もしない。
//			break;
//		//	⑮ー１.地代家賃等［様式151］
//		case ID_FORMNO_151:
//			//	カラム最大値
//			m_nColumnMax = 8;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "地代・家賃の区分";
//			m_nColumnTitle[1] = "借地物件の用途";
//			m_nColumnTitle[2] = "所在地";
//			m_nColumnTitle[3] = "貸主の名称";
//			m_nColumnTitle[4] = "貸主の所在地";
//			m_nColumnTitle[5] = "支払対象期間";
//			m_nColumnTitle[6] = "支払賃借料";
//			m_nColumnTitle[7] = "摘要";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[1] = ( 40 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//			m_nColumnWidth[3] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[4] = ( 40 * 17 ) + 9;
//// midori 200101 del -->
//			//m_nColumnWidth[5] = 17 + ( 16 * 9) + 9;
//// midori 200101 del <--
//// midori 200101 add -->
//			m_nColumnWidth[5] = 17 + ( 24 * 9) + 9;
//// midori 200101 add <--
//			m_nColumnWidth[6] = ( 14 *  9 ) + 9;
//			m_nColumnWidth[7] = ( 42 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑮ー２.権利金等の期中支払［様式152］
//		case ID_FORMNO_152:
//			//	カラム最大値
//			m_nColumnMax = 6;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "支払先の名称";
//			m_nColumnTitle[1] = "支払先の所在地";
//			m_nColumnTitle[2] = "支払年月日";
//			m_nColumnTitle[3] = "支払金額";
//			m_nColumnTitle[4] = "権利金等の内容";
//			m_nColumnTitle[5] = "摘要";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 40 * 17 ) + 9;
//			m_nColumnWidth[2] = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//			m_nColumnWidth[3] = ( 14 *  9 ) + 9;
//			m_nColumnWidth[4] = ( 26 * 17 ) + 9;
//			m_nColumnWidth[5] = ( 33 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑮ー３.工業所有権等の使用料［様式153］
//		case ID_FORMNO_153:
//			//	カラム最大値
//			m_nColumnMax = 7;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "名称";
//			m_nColumnTitle[1] = "支払先の名称";
//			m_nColumnTitle[2] = "支払先の所在地";
//			m_nColumnTitle[3] = "契約期間";
//			m_nColumnTitle[4] = "支払対象期間";
//			m_nColumnTitle[5] = "支払金額";
//			m_nColumnTitle[6] = "摘要";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 10 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//			m_nColumnWidth[3] = (  5 * 17 ) + ( 10 * 9 ) + 9;
//// midori 200101 del -->
//			//m_nColumnWidth[4] = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
//// midori 200101 del <--
//// midori 200101 add -->
//			m_nColumnWidth[4] = (  5 * 17 ) + ( 10 * 9 ) + 9;
//// midori 200101 add <--
//			m_nColumnWidth[5] = ( 14 *  9 ) + 9;
//			m_nColumnWidth[6] = ( 30 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑯ー１.雑役［様式161］
//		case ID_FORMNO_161:
//			//	カラム最大値
//			m_nColumnMax = 5;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "科目";
//			m_nColumnTitle[1] = "取引の内容";
//// midori 190301 del -->
//			//m_nColumnTitle[2] = "相手先";
//			//m_nColumnTitle[3] = "所在地";
//// midori 190301 del <--
//// midori 190301 add -->
//			if(bG_Kanso == TRUE)	{
//				m_nColumnTitle[2] = "相手先（名称）";
//				m_nColumnTitle[3] = "相手先（所在地）";
//			}
//			else	{
//				m_nColumnTitle[2] = "相手先";
//				m_nColumnTitle[3] = "所在地";
//			}
//// midori 190301 add <--
//			m_nColumnTitle[4] = "金額";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 24 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[3] = ( 40 * 17 ) + 9;
//			m_nColumnWidth[4] = ( 14 *  9 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑯ー２.雑損失［様式162］
//		case ID_FORMNO_162:
//			//	カラム最大値
//			m_nColumnMax = 5;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "科目";
//			m_nColumnTitle[1] = "取引の内容";
//// midori 190301 del -->
//			//m_nColumnTitle[2] = "相手先";
//			//m_nColumnTitle[3] = "所在地";
//// midori 190301 del <--
//// midori 190301 del -->
//			if(bG_Kanso == TRUE)	{
//				m_nColumnTitle[2] = "相手先（名称）";
//				m_nColumnTitle[3] = "相手先（所在地）";
//			}
//			else	{
//				m_nColumnTitle[2] = "相手先";
//				m_nColumnTitle[3] = "所在地";
//			}
//// midori 190301 del <--
//			m_nColumnTitle[4] = "金額";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 24 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[3] = ( 40 * 17 ) + 9;
//			m_nColumnWidth[4] = ( 14 *  9 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑰.その他科目の内訳書①［様式171］
//		case ID_FORMNO_171:
//		case ID_FORMNO_172:
//		case ID_FORMNO_173:
//		case ID_FORMNO_174:
//		case ID_FORMNO_175:
//		case ID_FORMNO_176:
//		case ID_FORMNO_177:
//		case ID_FORMNO_178:
//		case ID_FORMNO_179:
//		case ID_FORMNO_1710:
//		case ID_FORMNO_1711:
//		case ID_FORMNO_1712:
//		case ID_FORMNO_1713:
//		case ID_FORMNO_1714:
//		case ID_FORMNO_1715:
//		case ID_FORMNO_1716:
//		case ID_FORMNO_1717:
//		case ID_FORMNO_1718:
//		case ID_FORMNO_1719:
//		case ID_FORMNO_1720:
//			m_nColumnMax = 5;										//	カラム最大値
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "科目";
//			m_nColumnTitle[1] = "相手先（名称）";
//			m_nColumnTitle[2] = "相手先（所在地）";
//			m_nColumnTitle[3] = "期末現在高";
//			m_nColumnTitle[4] = "摘要";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 20 * 17 ) + 9;
//			m_nColumnWidth[2] = ( 40 * 17 ) + 9;
//// No.200903 del -->
//			//m_nColumnWidth[3] = ( 14 *  9 ) + 9;
//// No.200903 del <--
//// No.200903 add -->
//			m_nColumnWidth[3] = ( 16 *  9 ) + 9;
//// No.200903 add <--
//			m_nColumnWidth[4] = ( 26 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//		//	⑱.その他科目の内訳書②［様式181］
//		case ID_FORMNO_181:
//		case ID_FORMNO_182:
//		case ID_FORMNO_183:
//		case ID_FORMNO_184:
//		case ID_FORMNO_185:
//		case ID_FORMNO_186:
//		case ID_FORMNO_187:
//		case ID_FORMNO_188:
//		case ID_FORMNO_189:
//		case ID_FORMNO_1810:
//		case ID_FORMNO_1811:
//		case ID_FORMNO_1812:
//		case ID_FORMNO_1813:
//		case ID_FORMNO_1814:
//		case ID_FORMNO_1815:
//		case ID_FORMNO_1816:
//		case ID_FORMNO_1817:
//		case ID_FORMNO_1818:
//		case ID_FORMNO_1819:
//		case ID_FORMNO_1820:
//			//	カラム最大値
//			m_nColumnMax = 4;
//			//	カラムタイトル設定
//			m_nColumnTitle[0] = "科目";
//			m_nColumnTitle[1] = GetSonota2ItemName();
//			m_nColumnTitle[2] = "期末現在高";
//			m_nColumnTitle[3] = "摘要";
//			//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
//			m_nColumnWidth[0] = ( 12 * 17 ) + 9;
//			m_nColumnWidth[1] = ( 40 * 17 ) + 9;
//// No.200903 del -->
//			//m_nColumnWidth[2] = ( 14 *  9 ) + 9;
//// No.200903 del <--
//// No.200903 add -->
//			m_nColumnWidth[2] = ( 16 *  9 ) + 9;
//// No.200903 add <--
//			m_nColumnWidth[3] = ( 40 * 17 ) + 9;
//			//自動調整を行わない
//			flg = FALSE;
//			break;
//	}
//	for(ii=0; ii<m_nColumnMax; ii++)	{
//		m_RepDisplay.AddColumn(new ICSReportColumn(ii, m_nColumnTitle[ii], m_nColumnWidth[ii], flg));
//		//m_RepDisplay.AddColumn(new ICSReportColumn(ii, m_nColumnTitle[ii], m_nColumnWidth[ii]));
//	}
//	// 前回終了時のレポートコントロールの設定を読み込む
//// midori 190301 del -->
//	//m_RepDisplay.RestoreEnv(m_ZmSub,nFormSeq);
//// midori 190301 del <--
//// midori 190301 add -->
//	if(bG_Kanso == TRUE)	m_Ofs = 1000;
//	else					m_Ofs = 0;
//	m_RepDisplay.RestoreEnv(m_ZmSub,nFormSeq+m_Ofs);
//// midori 190301 add <--
//
//	//-----------------------------------
//	//	レポートの設定
//	//-----------------------------------
//	m_RepDisplay.SetSortable(FALSE);			// ソート禁止
//	m_RepDisplay.SetDraggable(FALSE);			// ヘッダードラッグ許可
//	m_RepDisplay.SetRemovable(FALSE);			// ヘッダー削除禁止
//	m_RepDisplay.SetMultipleSelection(TRUE);	// 複数行選択許可
//
//	clms = m_RepDisplay.GetColumns();
//	for(ii=0; ii<m_nColumnMax; ii++)	{
//		clm = clms->GetAt(ii);
//		clm->EnableResize(TRUE);
//	}
//
//	//-----------------------------------
//	//	レポートコントロールの垂直線を設定
//	//-----------------------------------
//	SetGrid();
//
//	//-----------------------------------
//	// フォント設定
//	//-----------------------------------
//	pFont = this->GetFont();
//	pFont->GetLogFont(&font);
//	m_RepDisplay.SetTextFont(font);
//	m_RepDisplay.SetHeaderFont(font);
//}
// No.200602 del <--
// No.200602 add -->
//------------------------------------------------------
//	レポートコントロールの初期化、ヘッダ部作成（保管用）
//------------------------------------------------------
//	【引数】	pFormSeq	…	様式シーケンス番号
//	【戻値】	なし
//------------------------------------------------------
// No.158013 del -->
//void CdlgDisplay2::InitReportHeader(short pFormSeq)
// No.158013 del <--
// No.158013 add -->
void CdlgDisplay2::InitReportHeader(short pFormSeq, int pSw)
// No.158013 add <--
{
	int					ii=0;
	int					cnt=0;
	BOOL				flg=FALSE;		// 自動リサイズフラグ 様式⑩－２のみ列数が少ないため、1頁内で自動調整を行う
// No.158072 add -->
	CString				title = "";
// No.158072 add <--
	CFont*				pFont;
	LOGFONT				font={0};
	ICSReportColumns*	clms;
	ICSReportColumn*	clm;

// No.158013 add -->
//※様式①と⑤で、金額等の幅が元より大きくなるのはおかしいとクレームが来た時に
//ここのコメントの処理を行うようにする。それまではコメント。
	//// １画面におさめるにチェックをつけたとき
	//if(pSw == 1 && m_Flg1 != 0)	{
	//	//ICSReportColumns*	clms;
	//	//ICSReportColumn*	clm;
	//	int					aa=0;
	//	clms = m_RepDisplay.GetColumns();
	//	for(ii = 0; ii < m_nColumnMax; ii++) {
	//		clm = clms->GetAt(ii);
	//		aa = aa + clm->GetWidth();
	//	}

	//	//CString	cs=_T("");
	//	//cs.Format(_T("m_widthAll=%d a=%d"),m_widthAll,a);
	//	//ICSMessageBox(cs);

	//	if(m_widthAll >= aa)	{
	//		// １画面におさまっていたら何もしない
	//		return;
	//	}
	//}
// No.158013 add <--

	// レポートをクリア
	m_RepDisplay.RemoveColumn(-1);

	// カラムタイトルをクリア
	for(ii=0; ii<20; ii++)	{
		m_nColumnTitle[ii].Empty();
		m_nColumnWidth[ii] = 0;
	}

	//-------------------------------------
	// カラムを追加
	//-------------------------------------
	// 様式で分岐
	// カラムのサイズは下記の幅で計算して設定
	// データ部 全角1文字幅:17
	// データ部 半角1文字幅:9
	// タイトル部：全角1文字幅:18
	// 各列に+9の幅を余白として持たせる、タイトル部で計算を行った場合は+18の幅を余白として持たせる
	// ※様式⑩－２のみ自動調整を行うため、幅調整の計算方法が異なる
	switch(pFormSeq)	{
		//	①.預貯金等［様式011］
		case ID_FORMNO_011:
			if(bG_Kanso == TRUE)	{
				//	カラム最大値
				m_nColumnMax = 6;
				GetTitleNameAndSize(m_nColumnMax, 0, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 5;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "金融機関名";
				m_nColumnTitle[1] = "種類";
				m_nColumnTitle[2] = "口座番号";
				m_nColumnTitle[3] = "期末現在高";
				m_nColumnTitle[4] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = (21 * 17) + 9;
				m_nColumnWidth[1] = (12 * 17) + 9;
				m_nColumnWidth[2] = (14 *  9) + 9;
				m_nColumnWidth[3] = (14 *  9) + 9;
				m_nColumnWidth[4] = (40 * 17) + 9;
				// 自動調整を行わない
				flg = FALSE;
			}
			break;

		//	②.受取手形［様式021］
		case ID_FORMNO_021:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/09/11 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/09/11 add
				//	カラム最大値
				//m_nColumnMax = 9;								// インボイス登録番号追加対応_23/09/11 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 10;	// インボイス登録番号追加対応_23/09/11 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 9;	// インボイス登録番号追加対応_23/09/11 add
				// 列幅とタイトルを取得
				GetTitleNameAndSize(m_nColumnMax, 1, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 8;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "振出人";
				m_nColumnTitle[2] = "振出年月日";
				m_nColumnTitle[3] = "支払期日";
				m_nColumnTitle[4] = "支払銀行名";
				m_nColumnTitle[5] = "金額";
				m_nColumnTitle[6] = "割引銀行名";
				m_nColumnTitle[7] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = (12 * 17) + 9;
				m_nColumnWidth[1] = (20 * 17) + 9;
				m_nColumnWidth[2] = (12 *  9) + 9;
				m_nColumnWidth[3] = (10 *  9) + 9;
				m_nColumnWidth[4] = (21 * 17) + 9;
				m_nColumnWidth[5] = (14 *  9) + 9;
				m_nColumnWidth[6] = (21 * 17) + 9;
				m_nColumnWidth[7] = (32 * 17) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	③.売掛金［様式031］
		case ID_FORMNO_031:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 5;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 6;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 5;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 2, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 5;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "相手先（名称）";
				m_nColumnTitle[2] = "相手先（所在地）";
				m_nColumnTitle[3] = "期末現在高";
				m_nColumnTitle[4] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
				m_nColumnWidth[3] = ( 14 *  9 ) + 9;
				m_nColumnWidth[4] = ( 26 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	④－１.仮払金［様式041］
		case ID_FORMNO_041:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 6;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 7;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 6;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 3, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 6;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "相手先（名称）";
				m_nColumnTitle[2] = "相手先（所在地）";
				m_nColumnTitle[3] = "相手先（関係）";
				m_nColumnTitle[4] = "期末現在高";
				m_nColumnTitle[5] = "取引の内容";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
				m_nColumnWidth[3] = (  7 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[4] = ( 14 *  9 ) + 9;
				m_nColumnWidth[5] = ( 20 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	④－２.貸付金［様式042］
		case ID_FORMNO_042:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 7;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 8;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 7;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 4, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 8;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "貸付先";
				m_nColumnTitle[1] = "法人・代表者との関係";
				m_nColumnTitle[2] = "所在地";
				m_nColumnTitle[3] = "期末現在高";
				m_nColumnTitle[4] = "期中の受取利息額";
				m_nColumnTitle[5] = "利率";
				m_nColumnTitle[6] = "貸付理由";
				m_nColumnTitle[7] = "担保の内容";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 20 * 17 ) + 9;
				m_nColumnWidth[1] = ( 10 * 18 ) + 18;		//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
				m_nColumnWidth[3] = ( 14 *  9 ) + 9;
				m_nColumnWidth[4] = (  8 * 17 ) + 18;		//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[5] = (  6 *  9 ) + 9;
				m_nColumnWidth[6] = ( 24 * 17 ) + 9;
				m_nColumnWidth[7] = ( 30 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑤.棚卸資産［様式051］
		case ID_FORMNO_051:
			if(bG_Kanso == TRUE)	{
				//	カラム最大値
				m_nColumnMax = 7;
				GetTitleNameAndSize(m_nColumnMax + 1, 5, m_nColumnTitle, m_nColumnWidth);
				//m_nColumnWidth[m_nColumnMax] = 0;
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 7;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "品目";
				m_nColumnTitle[2] = "数量";
				m_nColumnTitle[3] = "単位";
				m_nColumnTitle[4] = "単価";
				m_nColumnTitle[5] = "期末現在高";
				m_nColumnTitle[6] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
				m_nColumnWidth[2] = ( 12 *  9 ) + 9;
				m_nColumnWidth[3] = (  3 * 17 ) + 9;
				m_nColumnWidth[4] = ( 13 *  9 ) + 9;
				m_nColumnWidth[5] = ( 15 *  9 ) + 9;		//	※自動計算で桁あふれするケースがあり12桁以上は「************」と表示させるため
				m_nColumnWidth[6] = ( 30 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑥.有価証券［様式061］
		case ID_FORMNO_061:
			if(bG_Kanso == TRUE)	{
				//	カラム最大値
				m_nColumnMax = 15;
				GetTitleNameAndSize(m_nColumnMax, 6, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				m_nColumnMax = 14;
				//	カラムタイトル設定
				m_nColumnTitle[0]  = "区分";
				m_nColumnTitle[1]  = "種類・銘柄";
				m_nColumnTitle[2]  = "期末現在高（数量）";	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnTitle[3]  = "期末現在高（単位）";
				m_nColumnTitle[4]  = "期末現在高（上段）";
				m_nColumnTitle[5]  = "期末現在高（下段）";
				m_nColumnTitle[6]  = "異動年月日";
				m_nColumnTitle[7]  = "異動事由";
				m_nColumnTitle[8]  = "数量";
				m_nColumnTitle[9]  = "単位";
				m_nColumnTitle[10] = "金額";
				m_nColumnTitle[11] = "売却先（名称）";
				m_nColumnTitle[12] = "売却先（所在地）";
				m_nColumnTitle[13] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0]  = ( 12 * 17 ) + 9;
				m_nColumnWidth[1]  = ( 16 * 17 ) + 9;
				m_nColumnWidth[2]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[3]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[4]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[5]  = (  9 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[6]  = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[7]  = ( 12 * 17 ) + 9;
				m_nColumnWidth[8]  = ( 15 *  9 ) + 9;
				m_nColumnWidth[9]  = (  3 * 17 ) + 9;	//	データ部の幅が足りない為、+3（調整値）を加算
				m_nColumnWidth[10] = ( 14 *  9 ) + 9;
				m_nColumnWidth[11] = ( 30 * 17 ) + 9;
				m_nColumnWidth[12] = ( 30 * 17 ) + 9;
				m_nColumnWidth[13] = ( 30 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑦.固定資産［様式071］
		case ID_FORMNO_071:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 12;							// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 13;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 12;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 7, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 12;
				//	カラムタイトル設定
				m_nColumnTitle[0]  = "種類・構造";
				m_nColumnTitle[1]  = "用途";
				m_nColumnTitle[2]  = "面積";
				m_nColumnTitle[3]  = "物件の所在地";
				m_nColumnTitle[4]  = "期末現在高";
				m_nColumnTitle[5]  = "異動年月日";
				m_nColumnTitle[6]  = "異動事由";
				m_nColumnTitle[7]  = "取得価額";
				m_nColumnTitle[8]  = "帳簿価額";
				m_nColumnTitle[9]  = "売却先（名称）";
				m_nColumnTitle[10] = "売却先（所在地）";
				m_nColumnTitle[11] = "取得年月";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0]  = ( 14 * 17 ) + 9;
				m_nColumnWidth[1]  = ( 10 * 17 ) + 9;
				m_nColumnWidth[2]  = ( 10 *  9 ) + 9;
				m_nColumnWidth[3]  = ( 40 * 17 ) + 9;
				m_nColumnWidth[4]  = ( 15 *  9 ) + 9;
				m_nColumnWidth[5]  = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[6]  = ( 12 * 17 ) + 9;
				m_nColumnWidth[7]  = ( 14 *  9 ) + 9;
				m_nColumnWidth[8]  = ( 14 *  9 ) + 9;
				m_nColumnWidth[9]  = ( 30 * 17 ) + 9;
				m_nColumnWidth[10] = ( 30 * 17 ) + 9;
				m_nColumnWidth[11] = (  2 * 17 ) + ( 5 * 9 ) + 18;	//	垂直スクロールバー用に更に余白１文字幅追加
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑧.支払手形［様式081］
		case ID_FORMNO_081:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
// 改良No.21-0086,21-0529 cor -->
				//m_nColumnMax = 7;								// インボイス登録番号追加対応_23/11/06 del
				//if(bG_InvNo == TRUE)		m_nColumnMax = 8;	// インボイス登録番号追加対応_23/11/06 add
				//else if(bG_Kanso == TRUE)	m_nColumnMax = 7;	// インボイス登録番号追加対応_23/11/06 add
// ------------------------------
				if(bG_InvNo == TRUE)		m_nColumnMax = 9;
				else if(bG_Kanso == TRUE)	m_nColumnMax = 7;
// 改良No.21-0086,21-0529 cor <--
				GetTitleNameAndSize(m_nColumnMax, 8, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				m_nColumnMax = 6;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "支払先";
				m_nColumnTitle[1] = "振出年月日";
				m_nColumnTitle[2] = "支払期日";
				m_nColumnTitle[3] = "支払銀行名";
				m_nColumnTitle[4] = "金額";
				m_nColumnTitle[5] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 20 * 17 ) + 9;
				m_nColumnWidth[1] = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[2] = (  4 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[3] = ( 21 * 17 ) + 9;
				m_nColumnWidth[4] = ( 14 *  9 ) + 9;
				m_nColumnWidth[5] = ( 40 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑨.買掛金［様式091］
		case ID_FORMNO_091:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 5;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 6;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 5;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 9, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else {
				//	カラム最大値
				m_nColumnMax = 5;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "相手先（名称）";
				m_nColumnTitle[2] = "相手先（所在地）";
				m_nColumnTitle[3] = "期末現在高";
				m_nColumnTitle[4] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
				m_nColumnWidth[3] = ( 14 *  9 ) + 9;
				m_nColumnWidth[4] = ( 20 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑩ー１.仮受金［様式101］
		case ID_FORMNO_101:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 6;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 7;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 6;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 10, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 6;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "相手先（名称）";
				m_nColumnTitle[2] = "相手先（所在地）";
				m_nColumnTitle[3] = "相手先（関係）";
				m_nColumnTitle[4] = "期末現在高";
				m_nColumnTitle[5] = "取引の内容";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
				m_nColumnWidth[3] = (  7 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[4] = ( 14 *  9 ) + 9;
				m_nColumnWidth[5] = ( 20 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑩ー２.源泉取得税［様式102］
		case ID_FORMNO_102:
			if(bG_Kanso == TRUE)	{
				//	カラム最大値
				m_nColumnMax = 4;
				// 最終列に空列を開けるため、m_nColumnMax+1で各列（空列含む）の計算を行う
				GetTitleNameAndSize(m_nColumnMax, 11, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行う
				flg = TRUE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 4;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "支払年月";
				m_nColumnTitle[1] = "所得の種類";
				m_nColumnTitle[2] = "期末現在高";
				m_nColumnTitle[3] = "";
				//	カラム幅設定％で値を代入
				m_nColumnWidth[0] = 10;
				m_nColumnWidth[1] = 12;
				m_nColumnWidth[2] = 14;
				// レポートコントロールの幅を調整する
				// コントロールの幅 - 各列幅
				m_nColumnWidth[3] = 64;
				//自動調整を行う
				flg = TRUE;
			}
			break;

		//	⑪.借入金［様式111］
		case ID_FORMNO_111:
			if(bG_Kanso == TRUE)	{
				//	カラム最大値
				m_nColumnMax = 8;
				GetTitleNameAndSize(m_nColumnMax, 12, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 9;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "借入先";
				m_nColumnTitle[2] = "法人・代表者との関係";
				m_nColumnTitle[3] = "所在地";
				m_nColumnTitle[4] = "期末現在高";
				m_nColumnTitle[5] = "期中の支払利子額";
				m_nColumnTitle[6] = "利率";
				m_nColumnTitle[7] = "借入理由";
				m_nColumnTitle[8] = "担保の内容";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
				m_nColumnWidth[2] = ( 10 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[3] = ( 40 * 17 ) + 9;
				m_nColumnWidth[4] = ( 14 *  9 ) + 9;
				m_nColumnWidth[5] = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[6] = (  7 *  9 ) + 9;
				m_nColumnWidth[7] = ( 20 * 17 ) + 9;
				m_nColumnWidth[8] = ( 26 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑫.土地の売上高等［様式121］
		case ID_FORMNO_121:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 11;							// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 12;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 11;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 13, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 11;
				//	カラムタイトル設定
				m_nColumnTitle[0]  = "区分";
				m_nColumnTitle[1]  = "商品の所在地";
				m_nColumnTitle[2]  = "地目";
				m_nColumnTitle[3]  = "総面積";
				m_nColumnTitle[4]  = "売上年月";
				m_nColumnTitle[5]  = "売上先（名称）";
				m_nColumnTitle[6]  = "売上先（所在地）";
				m_nColumnTitle[7]  = "売上面積";
				m_nColumnTitle[8]  = "売上金額（上段）";
				m_nColumnTitle[9]  = "売上金額（下段）";
				m_nColumnTitle[10] = "売上商品の取得年";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0]  = (  5 * 17 ) + 9;
				m_nColumnWidth[1]  = ( 30 * 17 ) + 9;
				m_nColumnWidth[2]  = (  8 * 17 ) + 9;
				m_nColumnWidth[3]  = ( 10 *  9 ) + 9;
				m_nColumnWidth[4]  = (  4 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[5]  = ( 20 * 17 ) + 9;
				m_nColumnWidth[6]  = ( 40 * 17 ) + 9;
				m_nColumnWidth[7]  = ( 10 *  9 ) + 9;
				m_nColumnWidth[8]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[9]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[10] = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑬.売上高等の事業所別［様式131］
		case ID_FORMNO_131:
			if(bG_Kanso == TRUE)	{
				//	カラム最大値
				m_nColumnMax = 10;
				GetTitleNameAndSize(m_nColumnMax, 14, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 11;
				//	カラムタイトル設定
				m_nColumnTitle[0]  = "事業所の名称";
				m_nColumnTitle[1]  = "事業所（所在地）";
				m_nColumnTitle[2]  = "責任者氏名";
				m_nColumnTitle[3]  = "代表者との関係";
				m_nColumnTitle[4]  = "事業等の内容";
				m_nColumnTitle[5]  = "売上高";
				m_nColumnTitle[6]  = "期末棚卸高";
				m_nColumnTitle[7]  = "期末従事員数";
				m_nColumnTitle[8]  = "使用建物の延面積";
				m_nColumnTitle[9]  = "源泉所得税納付署";
				m_nColumnTitle[10] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0]  = ( 20 * 17 ) + 9;
				m_nColumnWidth[1]  = ( 40 * 17 ) + 9;
				m_nColumnWidth[2]  = ( 16 * 17 ) + 9;
				m_nColumnWidth[3]  = (  8 * 17 ) + 9;
				m_nColumnWidth[4]  = ( 15 * 17 ) + 9;
				m_nColumnWidth[5]  = ( 14 *  9 ) + 9;
				m_nColumnWidth[6]  = ( 14 *  9 ) + 9;
				m_nColumnWidth[7]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[8]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[9]  = ( 10 * 17 ) + 9;
				m_nColumnWidth[10] = ( 24 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑭ー１.役員報酬手当金等［様式141］
		case ID_FORMNO_141:
			if(bG_Kanso == TRUE)	{
				//	カラム最大値
				m_nColumnMax = 13;
				GetTitleNameAndSize(m_nColumnMax, 15, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 13;
				//	カラムタイトル設定
				m_nColumnTitle[0]  = "役職名";
				m_nColumnTitle[1]  = "担当業務";
				m_nColumnTitle[2]  = "氏名";
				m_nColumnTitle[3]  = "代表者との関係";
				m_nColumnTitle[4]  = "住所";
				m_nColumnTitle[5]  = "常勤・非常勤の別";
				m_nColumnTitle[6]  = "使用人職務分";
				m_nColumnTitle[7]  = "定期同額給与";
				m_nColumnTitle[8]  = "事前確定届出給与";		// 2006.10.23：新会社法対応
				m_nColumnTitle[9]  = "利益連動給与";			// 2006.10.23：新会社法対応
				m_nColumnTitle[10] = "その他";					// 2006.10.23：新会社法対応
				m_nColumnTitle[11] = "退職給与";				// 2006.10.23：新会社法対応
				m_nColumnTitle[12] = "役員給与計";				// 2006.10.23：新会社法対応
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0]  = (  8 * 17 ) + 9;
				m_nColumnWidth[1]  = (  8 * 17 ) + 9;
				m_nColumnWidth[2]  = ( 24 * 17 ) + 9;
				m_nColumnWidth[3]  = (  7 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[4]  = ( 40 * 17 ) + 9;
				m_nColumnWidth[5]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[6]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[7]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[8]  = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[9]  = (  6 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[10] = ( 11 *  9 ) + 9;
				m_nColumnWidth[11] = ( 11 *  9 ) + 9;
				m_nColumnWidth[12] = ( 13 *  9 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑭ー２.人件費［様式142］
		case ID_FORMNO_142:
			//	基本的には呼ばれないので何もしない。
			break;

		//	⑮ー１.地代家賃等［様式151］
		case ID_FORMNO_151:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 8;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 9;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 8;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 17, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 8;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "地代・家賃の区分";
				m_nColumnTitle[1] = "借地物件の用途";
				m_nColumnTitle[2] = "所在地";
				m_nColumnTitle[3] = "貸主の名称";
				m_nColumnTitle[4] = "貸主の所在地";
				m_nColumnTitle[5] = "支払対象期間";
				m_nColumnTitle[6] = "支払賃借料";
				m_nColumnTitle[7] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = (  8 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[1] = ( 40 * 17 ) + 9;
				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
				m_nColumnWidth[3] = ( 20 * 17 ) + 9;
				m_nColumnWidth[4] = ( 40 * 17 ) + 9;
				m_nColumnWidth[5] = 17 + ( 24 * 9 ) + 9;
				m_nColumnWidth[6] = ( 14 *  9 ) + 9;
				m_nColumnWidth[7] = ( 42 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;

			}
			break;

		//	⑮ー２.権利金等の期中支払［様式152］
		case ID_FORMNO_152:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 6;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 7;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 6;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 18, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 6;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "支払先の名称";
				m_nColumnTitle[1] = "支払先の所在地";
				m_nColumnTitle[2] = "支払年月日";
				m_nColumnTitle[3] = "支払金額";
				m_nColumnTitle[4] = "権利金等の内容";
				m_nColumnTitle[5] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 20 * 17 ) + 9;
				m_nColumnWidth[1] = ( 40 * 17 ) + 9;
				m_nColumnWidth[2] = (  5 * 18 ) + 18;	//	タイトル部で調整のため（文字数 * 18で計算）+18（両端半角分の幅余白）を加算
				m_nColumnWidth[3] = ( 14 *  9 ) + 9;
				m_nColumnWidth[4] = ( 26 * 17 ) + 9;
				m_nColumnWidth[5] = ( 33 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑮ー３.工業所有権等の使用料［様式153］
		case ID_FORMNO_153:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 7;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 8;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 7;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 19, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 7;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "名称";
				m_nColumnTitle[1] = "支払先の名称";
				m_nColumnTitle[2] = "支払先の所在地";
				m_nColumnTitle[3] = "契約期間";
				m_nColumnTitle[4] = "支払対象期間";
				m_nColumnTitle[5] = "支払金額";
				m_nColumnTitle[6] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 10 * 17 ) + 9;
				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
				m_nColumnWidth[3] = (  5 * 17 ) + ( 10 * 9 ) + 9;
				m_nColumnWidth[4] = (  5 * 17 ) + ( 10 * 9 ) + 9;
				m_nColumnWidth[5] = ( 14 *  9 ) + 9;
				m_nColumnWidth[6] = ( 30 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑯ー１.雑役［様式161］
		case ID_FORMNO_161:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 5;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 6;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 5;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 20, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 5;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "取引の内容";
				m_nColumnTitle[2] = "相手先";
				m_nColumnTitle[3] = "所在地";
				m_nColumnTitle[4] = "金額";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 24 * 17 ) + 9;
				m_nColumnWidth[2] = ( 20 * 17 ) + 9;
				m_nColumnWidth[3] = ( 40 * 17 ) + 9;
				m_nColumnWidth[4] = ( 14 *  9 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑯ー２.雑損失［様式162］
		case ID_FORMNO_162:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 5;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 6;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 5;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 21, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 5;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "取引の内容";
				m_nColumnTitle[2] = "相手先";
				m_nColumnTitle[3] = "所在地";
				m_nColumnTitle[4] = "金額";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 24 * 17 ) + 9;
				m_nColumnWidth[2] = ( 20 * 17 ) + 9;
				m_nColumnWidth[3] = ( 40 * 17 ) + 9;
				m_nColumnWidth[4] = ( 14 *  9 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑰.その他科目の内訳書①［様式171］
		case ID_FORMNO_171:
		case ID_FORMNO_172:
		case ID_FORMNO_173:
		case ID_FORMNO_174:
		case ID_FORMNO_175:
		case ID_FORMNO_176:
		case ID_FORMNO_177:
		case ID_FORMNO_178:
		case ID_FORMNO_179:
		case ID_FORMNO_1710:
		case ID_FORMNO_1711:
		case ID_FORMNO_1712:
		case ID_FORMNO_1713:
		case ID_FORMNO_1714:
		case ID_FORMNO_1715:
		case ID_FORMNO_1716:
		case ID_FORMNO_1717:
		case ID_FORMNO_1718:
		case ID_FORMNO_1719:
		case ID_FORMNO_1720:
			//if(bG_Kanso == TRUE)	{							// インボイス登録番号追加対応_23/11/06 del
			if(bG_Kanso == TRUE || bG_InvNo == TRUE)	{		// インボイス登録番号追加対応_23/11/06 add
				//	カラム最大値
				//m_nColumnMax = 5;								// インボイス登録番号追加対応_23/11/06 del
				if(bG_InvNo == TRUE)		m_nColumnMax = 6;	// インボイス登録番号追加対応_23/11/06 add
				else if(bG_Kanso == TRUE)	m_nColumnMax = 5;	// インボイス登録番号追加対応_23/11/06 add
				GetTitleNameAndSize(m_nColumnMax, 22, m_nColumnTitle, m_nColumnWidth);
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 5;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = "相手先（名称）";
				m_nColumnTitle[2] = "相手先（所在地）";
				m_nColumnTitle[3] = "期末現在高";
				m_nColumnTitle[4] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 20 * 17 ) + 9;
				m_nColumnWidth[2] = ( 40 * 17 ) + 9;
				m_nColumnWidth[3] = ( 14 *  9 ) + 9;
				m_nColumnWidth[4] = ( 26 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;

		//	⑱.その他科目の内訳書②［様式181］
		case ID_FORMNO_181:
		case ID_FORMNO_182:
		case ID_FORMNO_183:
		case ID_FORMNO_184:
		case ID_FORMNO_185:
		case ID_FORMNO_186:
		case ID_FORMNO_187:
		case ID_FORMNO_188:
		case ID_FORMNO_189:
		case ID_FORMNO_1810:
		case ID_FORMNO_1811:
		case ID_FORMNO_1812:
		case ID_FORMNO_1813:
		case ID_FORMNO_1814:
		case ID_FORMNO_1815:
		case ID_FORMNO_1816:
		case ID_FORMNO_1817:
		case ID_FORMNO_1818:
		case ID_FORMNO_1819:
		case ID_FORMNO_1820:
			if(bG_Kanso == TRUE)	{
				//	カラム最大値
				m_nColumnMax = 4;
				GetTitleNameAndSize(m_nColumnMax, 23, m_nColumnTitle, m_nColumnWidth);
				m_nColumnTitle[1] =  GetSonota2ItemName();
				//自動調整を行わない
				flg = FALSE;
			}
			else	{
				//	カラム最大値
				m_nColumnMax = 4;
				//	カラムタイトル設定
				m_nColumnTitle[0] = "科目";
				m_nColumnTitle[1] = GetSonota2ItemName();
				m_nColumnTitle[2] = "期末現在高";
				m_nColumnTitle[3] = "摘要";
				//	カラム幅設定（ 文字数 × １文字幅 ）+9（余白）
				m_nColumnWidth[0] = ( 12 * 17 ) + 9;
				m_nColumnWidth[1] = ( 40 * 17 ) + 9;
				m_nColumnWidth[2] = ( 14 *  9 ) + 9;
				m_nColumnWidth[3] = ( 40 * 17 ) + 9;
				//自動調整を行わない
				flg = FALSE;
			}
			break;
	}

	for(ii=0; ii<m_nColumnMax; ii++)	{
// No.158072 del -->
		//m_RepDisplay.AddColumn(new ICSReportColumn(ii, m_nColumnTitle[ii], m_nColumnWidth[ii], flg));
// No.158072 del <--
// No.158072 add -->
		title.Empty();
		title = m_nColumnTitle[ii];
		if(bG_Kanso == TRUE && m_SortSw[0] != -1) {
			if(m_SortSw[0] == ii)	{
// No.158113 del -->
				//if(m_SortSw[1] == 1)		title += _T(" △");
				//else if(m_SortSw[1] == 2)	title += _T(" ▽");
// No.158113 del <--
// No.158113 add -->
				if(m_SortSw[1] == 1)		title += _T(" ▲");
				else if(m_SortSw[1] == 2)	title += _T(" ▼");
// No.158113 add <--
			}
		}
		m_RepDisplay.AddColumn(new ICSReportColumn(ii, title, m_nColumnWidth[ii], flg));
// No.158072 add <--

	}

	// 前回終了時のレポートの列幅を読み込むする
	RestoreReportnWidth();

	//-------------------------------------
	// レポートの設定
	//-------------------------------------
// No.158072 del -->
//// No.200603 add -->
//// No.158015 del -->
//	//// 簡素化以降の保管参照の時は、ソート機能を使用する
//	//if(bG_Kanso == TRUE && m_nType == ID_FGSHOW_HOKAN) {
//// No.158015 del <--
//// No.158015 add -->
//	// 簡素化以降の保管参照および一括金額参照は、ソート機能を使用する
//	if(bG_Kanso == TRUE)	{
//// No.158015 add <--
//		m_RepDisplay.SetSortable(TRUE);			// ソート許可
//	}
//	else	{
//// No.200603 add <--
//		m_RepDisplay.SetSortable(FALSE);		// ソート禁止
//// No.200603 add -->
//	}
//// No.200603 add <--
// No.158072 del <--
// No.158072 add -->
	m_RepDisplay.SetSortable(FALSE);		// ソート禁止
// No.158072 add <--

	m_RepDisplay.SetDraggable(FALSE);			// ヘッダードラッグ許可
	m_RepDisplay.SetRemovable(FALSE);			// ヘッダー削除禁止
	m_RepDisplay.SetMultipleSelection(TRUE);	// 複数行選択許可

	clms = m_RepDisplay.GetColumns();

	for(ii=0; ii<m_nColumnMax; ii++)	{
		clm = clms->GetAt(ii);
		clm->EnableResize(TRUE);
	}

	//-------------------------------------
	// レポートコントロールの垂直線を設定
	//-------------------------------------
	SetGrid();

	//-------------------------------------
	// フォント設定
	//-------------------------------------
	if(bG_Kanso == TRUE)	{
		if( m_btnOK )	{
			// データ部のフォント
			pFont = m_btnOK.GetFont();
			pFont->GetLogFont(&font);
			if(pFont)	{
				// データ部のフォント
				font.lfHeight = font.lfHeight * 80 / 100;
				font.lfWidth  = font.lfWidth  * 80 / 100;
				font.lfWeight = font.lfWeight * 50 / 100;
				m_RepDisplay.SetTextFont(font);
			}
			// 項目名(タイトル)のフォント
			pFont = m_btnOK.GetFont();
			pFont->GetLogFont(&font);
			if(pFont)	{
				font.lfHeight = font.lfHeight * 70 / 100;
				font.lfWidth  = font.lfWidth  * 70 / 100;
				font.lfWeight = font.lfWeight * 40 / 100;
				m_RepDisplay.SetHeaderFont(font);
			}
		}
	}
	else	{
		pFont = this->GetFont();
		pFont->GetLogFont(&font);
		m_RepDisplay.SetTextFont(font);
		m_RepDisplay.SetHeaderFont(font);
	}

	// レポート再描画
	m_RepDisplay.Populate();
}

//------------------------------------------------------
//	様式ごとの列サイズと項目タイトルをセット
//------------------------------------------------------
void CdlgDisplay2::GetTitleNameAndSize(int pMaxCol, int pFormNo, CString pColmnTitle[], int pColmnWidth[])
{
	int					ii=0;
	int					width=0;
	double				d_val=0;

	if(m_Flg1 == 0)	{
		for(ii=0; ii<pMaxCol; ii++)	{
// インボイス登録番号追加対応_23/09/11 add -->
			if(bG_InvNo == TRUE)	{
				pColmnTitle[ii] = R_Title_3[pFormNo][ii];	// カラムタイトル設定
				pColmnWidth[ii] = R_Width_3[pFormNo][ii];	// カラム幅設定（文字数 × １文字幅）+（余白）
			}
			else	{
// インボイス登録番号追加対応_23/09/11 add <--
				pColmnTitle[ii] = R_Title_1[pFormNo][ii];	// カラムタイトル設定
				pColmnWidth[ii] = R_Width_1[pFormNo][ii];	// カラム幅設定（文字数 × １文字幅）+（余白）
// インボイス登録番号追加対応_23/09/11 add -->
			}
// インボイス登録番号追加対応_23/09/11 add <--
		}
	}
	// 「全項目を１画面に表示する」
	else	{
		// 画面の幅を取得
		d_val = (double)m_widthAll;
		width = 0;
		for(ii=0; ii<pMaxCol; ii++)	{
			//width = width + R_Width_2[pFormNo][ii];		// インボイス登録番号追加対応_23/09/11 del
// インボイス登録番号追加対応_23/09/11 add -->
			if(bG_InvNo == TRUE)	width = width + R_Width_4[pFormNo][ii];
			else					width = width + R_Width_2[pFormNo][ii];
// インボイス登録番号追加対応_23/09/11 add <--
		}
		if(m_widthAll > width)	{
			for(ii=0; ii<pMaxCol; ii++)	{
// インボイス登録番号追加対応_23/09/11 add -->
				if(bG_InvNo == TRUE)	{
					// カラムタイトル設定
					pColmnTitle[ii] = R_Title_4[pFormNo][ii];
					// カラム幅設定（文字数 × １文字幅）+（余白）
					pColmnWidth[ii] = (int)(d_val * (double)R_Width_4[pFormNo][ii] / (double)width);
				}
				else	{
// インボイス登録番号追加対応_23/09/11 add <--
					// カラムタイトル設定
					pColmnTitle[ii] = R_Title_2[pFormNo][ii];
					// カラム幅設定（文字数 × １文字幅）+（余白）
					pColmnWidth[ii] = (int)(d_val * (double)R_Width_2[pFormNo][ii] / (double)width);
// インボイス登録番号追加対応_23/09/11 add -->
				}
// インボイス登録番号追加対応_23/09/11 add <--
			}
			// 端数を各項目に割り振る
			ListWidthWarihuri(m_widthAll, pMaxCol, pColmnWidth);
		}
		else	{
			for(ii=0; ii<pMaxCol; ii++)	{
// インボイス登録番号追加対応_23/09/11 add -->
				if(bG_InvNo == TRUE)	{
					// カラムタイトル設定
					pColmnTitle[ii] = R_Title_4[pFormNo][ii];
					// カラム幅設定（文字数 × １文字幅）+（余白）
					pColmnWidth[ii] = R_Width_4[pFormNo][ii];
				}
				else	{
// インボイス登録番号追加対応_23/09/11 add <--
					// カラムタイトル設定
					pColmnTitle[ii] = R_Title_2[pFormNo][ii];
					// カラム幅設定（文字数 × １文字幅）+（余白）
					pColmnWidth[ii] = R_Width_2[pFormNo][ii];
// インボイス登録番号追加対応_23/09/11 add -->
				}
// インボイス登録番号追加対応_23/09/11 add <--
			}
		}
	}
}

//------------------------------------------------------
//	各列幅に余った分の余白を足す
//------------------------------------------------------
void CdlgDisplay2::ListWidthWarihuri(int pWidthAll, int pCMax, int* pCWidth)
{
	int		ii=0;
	int		val=0,sa=0;

	for(ii=0; ii<pCMax; ii++)	{
		val = val + *(pCWidth + ii);
	}
	sa = pWidthAll - val;
	if(sa != 0)	{
		// 割り振る
		for(ii=0; ii<pCMax; ii++)	{
			*(pCWidth + ii) = *(pCWidth + ii) + (sa / pCMax);
		}
		// 割り振ったうえで残った分は最後の列に加算
		val = 0;
		for(ii=0; ii<pCMax; ii++)	{
			val = val + *(pCWidth + ii);
		}
		sa = pWidthAll - val;
		if(sa != 0)	{
			if(m_nFormSeq == ID_FORMNO_071) {
				*(pCWidth + 10) = *(pCWidth + 10) + sa;
			}
			else if(m_nFormSeq == ID_FORMNO_121) {
				*(pCWidth + 6) = *(pCWidth + 6) + sa;
			}
			else if(m_nFormSeq == ID_FORMNO_141) {
				*(pCWidth + 4) = *(pCWidth + 4) + sa;
			}
			else if(m_nFormSeq == ID_FORMNO_161 || m_nFormSeq == ID_FORMNO_162) {
				*(pCWidth + 3) = *(pCWidth + 3) + sa;
			}
			else	{
				*(pCWidth + (pCMax - 1)) = *(pCWidth + (pCMax - 1)) + sa;
			}
		}
	}
}

//------------------------------------------------------
//	列幅を読み込むする
//------------------------------------------------------
void CdlgDisplay2::RestoreReportnWidth(void)
{
	int					ii=0;
	int					svwidth_all=0;	// レポートの幅
	int					width=0,width2=0;
	int					colmax=0;
	int					sa=0;
	int					intcolwidth[24]={0};
	double				dblcolwidth[24]={0};
	double				d_val=0;
	ICSReportColumns*	clms;
	ICSReportColumn*	clm;
	CRect				rec;
	CString				strQuery=_T("");

// No.200602 del -->
	//// 前回終了時のレポートコントロールの設定を読み込む
	//m_Ofs = OwntbKeyMake(m_Flg1);
	//m_RepDisplay.RestoreEnv(m_ZmSub, m_Ofs);

	//if(m_Flg1 == 1) {
	//	svwidth_all = 0;
	//	// Owntbテーブルをオープン
	//	strQuery.Format(_T("apl_name='UCHIWAKE' and itm_name='HokanWidth' and itm_seq =%d"),m_nFormSeq);
	//	m_ZmSub->OwnTblOpen(strQuery);
	//	if(m_ZmSub->owntb->GetRecordCount() > 0)	{
	//		svwidth_all = m_ZmSub->owntb->vl[0];
	//	}
	//	// 保存された値に解像度による倍率を掛ける
	//	// レポートの幅が変わった場合（解像度の変更、フォームサイズの変更、マルチウインドウを有効にするの変更）
	//	// 画面の列に対して、解像度の計算を行う
	//	// 初回起動時、不要
	//	if(svwidth_all != 0 && m_widthAll != svwidth_all) {
	//		// 画面の幅を取得
	//		d_val = (double)m_widthAll;
	//		width = 0;
	//		clms = m_RepDisplay.GetColumns();
	//		colmax = m_nColumnMax;
	//		for(ii=0; ii<colmax; ii++)	{
	//			clm = clms->GetAt(ii);
	//			width = width + clm->GetWidth();
	//			dblcolwidth[ii] = (double)clm->GetWidth();
	//		}
	//		// 前回起動時のレポートの幅より、今回起動時のレポートの幅の方が大きい
	//		if(svwidth_all < m_widthAll)	{
	//			sa = (double)(m_widthAll - svwidth_all);
	//			for(ii=0; ii<colmax;ii++)	{
	//				// カラム幅設定
	//				dblcolwidth[ii] = dblcolwidth[ii] + (sa / (colmax+1));
	//			}
	//		}
	//		// 前回起動時のレポートの幅より、今回起動時のレポートの幅の方が小さい
	//		else if(svwidth_all > m_widthAll)	{
	//			sa = (double)(svwidth_all - m_widthAll);
	//			for(ii=0; ii<colmax; ii++)	{
	//				// カラム幅設定
	//				dblcolwidth[ii] = dblcolwidth[ii] - (sa / colmax);
	//			}
	//		}
	//		width2 = 0;
	//		for(ii=0; ii<colmax; ii++)	{
	//			width2 = width2 + dblcolwidth[ii];
	//		}
	//		// 割り振った結果がレポートの幅に足りないので、差分を均等に足す
	//		if(width2 < m_widthAll)	{
	//			sa = (double)(m_widthAll - width2);
	//			for(ii=0; ii<colmax; ii++)	{
	//				// カラム幅設定
	//				dblcolwidth[ii] = dblcolwidth[ii] + (sa / (colmax+1));
	//			}
	//		}
	//		// 割り振った結果がレポートの幅より大きいので、差分を均等に引く
	//		else if(width2 > m_widthAll)	{
	//			sa = (double)(width2 - m_widthAll);
	//			for(ii=0; ii<colmax; ii++)	{
	//				// カラム幅設定
	//				dblcolwidth[ii] = dblcolwidth[ii] - (sa / colmax);
	//			}
	//		}
	//		// 各列の幅を再セット
	//		for(ii=0; ii<colmax; ii++)	{
	//			intcolwidth[ii] = dblcolwidth[ii];
	//		}

	//		// 端数を各項目に割り振る
	//		ListWidthWarihuri(d_val, colmax, intcolwidth);
	//		// 各列の幅を再設定
	//		for(ii=0; ii<m_nColumnMax; ii++)	{
	//			clm = clms->GetAt(ii);
	//			clm->SetWidth(intcolwidth[ii]);
	//			m_nColumnWidth[ii] = intcolwidth[ii];
	//		}
	//	}
	//}
// No.200602 del <--
// No.200602 add -->
	if(m_Flg1 == 1)	{
		svwidth_all = 0;
		// Owntbテーブルをオープン
		strQuery.Format(_T("apl_name='UCHIWAKE' and itm_name='HokanWidth' and itm_seq =%d"),m_nFormSeq);
		m_ZmSub->OwnTblOpen(strQuery);
		if(m_ZmSub->owntb->GetRecordCount() > 0)	{
			svwidth_all = m_ZmSub->owntb->vl[0];
		}
		// 保存された値が異なる（＝解像度が変わった）場合は、
		// 前回終了時のレポートコントロールの設定は読み込まない
		// 初回起動時、不要
		if(svwidth_all != 0 && m_widthAll != svwidth_all)	{
		}
		else if(svwidth_all != 0 && m_widthAll == svwidth_all)	{
			// 前回終了時のレポートコントロールの設定を読み込む
			m_Ofs = OwntbKeyMake(m_Flg1);
			m_RepDisplay.RestoreEnv(m_ZmSub, m_Ofs);
		}
	}
	else	{
		// 前回終了時のレポートコントロールの設定を読み込む
		m_Ofs = OwntbKeyMake(m_Flg1);
		m_RepDisplay.RestoreEnv(m_ZmSub, m_Ofs);
	}
// No.200602 add <--
}

// ------------------------------------------------------------------------------------------
//	保持している列幅を取得するためのキーを作成
// ------------------------------------------------------------------------------------------
//	【引数】	pFlg	…	1:全項目を１画面に表示する
//	【戻値】	CString	…	キーナンバー（itm_seq）
// ------------------------------------------------------------------------------------------
int CdlgDisplay2::OwntbKeyMake(int pFlg)
{
	int			ret=0;
	int			ibuf=0;
	int			ibuf2=0;
	double		kx=0;
	CString		s1="",s2="",s3="",s4="",s5="";

	// 簡素化様式
	if(bG_Kanso == TRUE)	{
		// 「全項目を１画面に表示する」
		if(pFlg == 1)	{
			ret = m_nFormSeq + 2000;
		}
		else {
			ret = m_nFormSeq + 1000;
		}
	}
	else {
		ret = m_nFormSeq;
	}

	return(ret);
}

// ------------------------------------------------------------------------------------------
//	列幅を保存する
// ------------------------------------------------------------------------------------------
void CdlgDisplay2::SaveReportnWidth(void)
{
	int					ii=0;
	CString				strQuery = _T("");
	CRect				rec;

	// 「全項目を１画面に表示する」にチェックがある場合
	if(m_Flg1 == 1)	{
		ICSReportColumns *pColumns = m_RepDisplay.GetColumns();
		// 列幅を保存
		m_Ofs = OwntbKeyMake(m_Flg1);
		m_RepDisplay.SaveEnv(m_ZmSub,m_Ofs);

		// 計算用にレポートの幅を保存する
		// Owntbテーブルをオープン
		strQuery.Format(_T("apl_name='UCHIWAKE' and itm_name='HokanWidth' and itm_seq =%d"),m_nFormSeq);
		m_ZmSub->OwnTblOpen(strQuery);
		if(m_ZmSub->owntb->GetRecordCount() > 0)	{
			// 編集
			m_ZmSub->owntb->Edit();
		}
		else	{
			// 新規
			m_ZmSub->owntb->AddNew();
			m_ZmSub->owntb->apl_name	= "UCHIWAKE";
			m_ZmSub->owntb->itm_name	= "HokanWidth";
			m_ZmSub->owntb->itm_seq		= m_nFormSeq;
			m_ZmSub->owntb->u_id		= 0;
			for(ii=0;ii<20;ii++)	{
				m_ZmSub->owntb->vl[ii]	= 0;
				m_ZmSub->owntb->str[ii].Empty();
				m_ZmSub->owntb->code[ii].Empty();
			}
		}
		// レポートの幅を保存
		m_ZmSub->owntb->vl[0] = m_widthAll;
		// owntbテーブル更新
		m_ZmSub->owntb->Update();

		// -------------------------------------------
		// Owntbテーブルをクローズ
		m_ZmSub->OwnTblClose();
	}
	else	{
		// 列幅を保存
		m_Ofs = OwntbKeyMake(m_Flg1);
		m_RepDisplay.SaveEnv(m_ZmSub,m_Ofs);
	}
}
// No.200602 add <--

//--------------------------------------------------
//	項目名称取得（⑱その他科目の内訳書②専用）
//--------------------------------------------------
//	【引数】	なし
//	【戻値】	項目名称
//--------------------------------------------------
CString CdlgDisplay2::GetSonota2ItemName(void)
{
	CString				szRet;				//	戻値
	CdbUcInfSonotaItem	mfcRec( m_pDB );	//	uc_inf_sonota_itemテーブルクラス
	
	//	戻値初期化
	szRet.Empty(); 
	
	//	レコード初期化成功？
	if(mfcRec.Init( m_nFormSeq ) == DB_ERR_OK)	{
		//	レコードあり？
		if( !mfcRec.IsEOF() )	{
			//	先頭に移動
			mfcRec.MoveFirst();
			//	項目名称を取得
			szRet = mfcRec.m_ItemName; 
		}
		//	閉じる
		mfcRec.Fin();
	}

	//	戻値を返す
	return( szRet );
}

//--------------------------------------------------
//	レポートコントロールの垂直線を設定
//--------------------------------------------------
//	【引数】	なし
//	【戻値】	なし
//--------------------------------------------------
void CdlgDisplay2::SetGrid(void)
{
	int				ii=0;
	CDWordArray		arryGridColumn;
	CDWordArray		arrayGridColor;

	// 各様式の内、カラムの数は一番多くて16個までなので、16個分常に作っておく

	for(ii=0; ii<m_nColumnMax-1; ii++)	{
		arryGridColumn.Add(ii);
	}

	for(ii=0; ii<m_nColumnMax-1; ii++)	{
		arrayGridColor.Add(RGB(255, 0, 0));
	}

	m_RepDisplay.SetVerGrid(&arryGridColumn, &arrayGridColor, RGS_SOLID);
}

//--------------------------------------------------
//	レポートコントロールのデータ設定
//--------------------------------------------------
//	【引数】	pFormSeq	…	様式シーケンス番号
//				pDB			…	データベースハンドル
//				pType		…	種別
//	【戻値】	なし
//--------------------------------------------------
void CdlgDisplay2::InitReportData(short pFormSeq, CDatabase* pDB, EnumIdFgShow nType)
{
	int		ret=0;		//	戻値

// インボイス登録番号追加対応_23/11/06 del -->
	////	様式で分岐
	//switch(pFormSeq)	{
	////	①.預貯金等［様式011］
	//case ID_FORMNO_011:
	//	ret = SetYoushiki011Data(pDB, nType, m_nColumnMax);
	//	break;
	////	②.受取手形［様式021］
	//case ID_FORMNO_021:
	//	ret = SetYoushiki021Data(pDB, nType, m_nColumnMax);
	//	break;
	////	③.売掛金［様式031］
	//case ID_FORMNO_031:
	//	ret = SetYoushiki031Data(pDB, nType, m_nColumnMax);
	//	break;
	////	④－１.仮払金［様式041］
	//case ID_FORMNO_041:
	//	ret = SetYoushiki041Data(pDB, nType, m_nColumnMax);
	//	break;
	////	④－２.貸付金［様式042］
	//case ID_FORMNO_042:
	//	ret = SetYoushiki042Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑤.棚卸資産［様式051］
	//case ID_FORMNO_051:
	//	ret = SetYoushiki051Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑥.有価証券［様式061］
	//case ID_FORMNO_061:
	//	ret = SetYoushiki061Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑦.固定資産［様式071］
	//case ID_FORMNO_071:
	//	ret = SetYoushiki071Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑧.支払手形［様式081］
	//case ID_FORMNO_081:
	//	ret = SetYoushiki081Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑨.買掛金［様式091］
	//case ID_FORMNO_091:
	//	ret = SetYoushiki091Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑩ー１.仮受金［様式101］
	//case ID_FORMNO_101:
	//	ret = SetYoushiki101Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑩ー２.源泉取得税［様式102］
	//case ID_FORMNO_102:
	//	ret = SetYoushiki102Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑪.借入金［様式111］
	//case ID_FORMNO_111:
	//	ret = SetYoushiki111Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑫.土地の売上高等［様式121］
	//case ID_FORMNO_121:
	//	ret = SetYoushiki121Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑬.売上高等の事業所別［様式131］
	//case ID_FORMNO_131:
	//	ret = SetYoushiki131Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑭ー１.役員報酬手当金等［様式141］
	//case ID_FORMNO_141:
	//	ret = SetYoushiki141Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑭ー２.人件費［様式142］
	//case ID_FORMNO_142:
	//	//	基本的には呼ばれないので何もしない。
	//	break;
	////	⑮ー１.地代家賃等［様式151］
	//case ID_FORMNO_151:
	//	ret = SetYoushiki151Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑮ー２.権利金等の期中支払［様式152］
	//case ID_FORMNO_152:
	//	ret = SetYoushiki152Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑮ー３.工業所有権等の使用料［様式153］
	//case ID_FORMNO_153:
	//	ret = SetYoushiki153Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑯ー１.雑役［様式161］
	//case ID_FORMNO_161:
	//	ret = SetYoushiki161Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑯ー２.雑損失［様式162］
	//case ID_FORMNO_162:
	//	ret = SetYoushiki162Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑰.その他科目の内訳書①［様式171］
	//case ID_FORMNO_171:
	//case ID_FORMNO_172:
	//case ID_FORMNO_173:
	//case ID_FORMNO_174:
	//case ID_FORMNO_175:
	//case ID_FORMNO_176:
	//case ID_FORMNO_177:
	//case ID_FORMNO_178:
	//case ID_FORMNO_179:
	//case ID_FORMNO_1710:
	//case ID_FORMNO_1711:
	//case ID_FORMNO_1712:
	//case ID_FORMNO_1713:
	//case ID_FORMNO_1714:
	//case ID_FORMNO_1715:
	//case ID_FORMNO_1716:
	//case ID_FORMNO_1717:
	//case ID_FORMNO_1718:
	//case ID_FORMNO_1719:
	//case ID_FORMNO_1720:
	//	ret = SetYoushiki171Data(pDB, nType, m_nColumnMax);
	//	break;
	////	⑱.その他科目の内訳書②［様式181］
	//case ID_FORMNO_181:
	//case ID_FORMNO_182:
	//case ID_FORMNO_183:
	//case ID_FORMNO_184:
	//case ID_FORMNO_185:
	//case ID_FORMNO_186:
	//case ID_FORMNO_187:
	//case ID_FORMNO_188:
	//case ID_FORMNO_189:
	//case ID_FORMNO_1810:
	//case ID_FORMNO_1811:
	//case ID_FORMNO_1812:
	//case ID_FORMNO_1813:
	//case ID_FORMNO_1814:
	//case ID_FORMNO_1815:
	//case ID_FORMNO_1816:
	//case ID_FORMNO_1817:
	//case ID_FORMNO_1818:
	//case ID_FORMNO_1819:
	//case ID_FORMNO_1820:
	//	ret = SetYoushiki181Data(pDB, nType, m_nColumnMax);
	//	break;
	//}
// インボイス登録番号追加対応_23/11/06 del <--
// インボイス登録番号追加対応_23/11/06 add -->
	//	様式で分岐
	switch(pFormSeq)	{
	//	①.預貯金等［様式011］
	case ID_FORMNO_011:
		ret = SetYoushiki011Data(pDB, nType, m_nColumnMax);
		break;
	//	②.受取手形［様式021］
	case ID_FORMNO_021:
		if(bG_InvNo == TRUE)	ret = SetYoushiki021IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki021Data(pDB, nType, m_nColumnMax);
		break;
	//	③.売掛金［様式031］
	case ID_FORMNO_031:
		if(bG_InvNo == TRUE)	ret = SetYoushiki031IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki031Data(pDB, nType, m_nColumnMax);
		break;
	//	④－１.仮払金［様式041］
	case ID_FORMNO_041:
		if(bG_InvNo == TRUE)	ret = SetYoushiki041IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki041Data(pDB, nType, m_nColumnMax);
		break;
	//	④－２.貸付金［様式042］
	case ID_FORMNO_042:
		if(bG_InvNo == TRUE)	ret = SetYoushiki042IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki042Data(pDB, nType, m_nColumnMax);
		break;
	//	⑤.棚卸資産［様式051］
	case ID_FORMNO_051:
		ret = SetYoushiki051Data(pDB, nType, m_nColumnMax);
		break;
	//	⑥.有価証券［様式061］
	case ID_FORMNO_061:
		ret = SetYoushiki061Data(pDB, nType, m_nColumnMax);
		break;
	//	⑦.固定資産［様式071］
	case ID_FORMNO_071:
		if(bG_InvNo == TRUE)	ret = SetYoushiki071IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki071Data(pDB, nType, m_nColumnMax);
		break;
	//	⑧.支払手形［様式081］
	case ID_FORMNO_081:
		if(bG_InvNo == TRUE)	ret = SetYoushiki081IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki081Data(pDB, nType, m_nColumnMax);
		break;
	//	⑨.買掛金［様式091］
	case ID_FORMNO_091:
		if(bG_InvNo == TRUE)	ret = SetYoushiki091IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki091Data(pDB, nType, m_nColumnMax);
		break;
	//	⑩ー１.仮受金［様式101］
	case ID_FORMNO_101:
		if(bG_InvNo == TRUE)	ret = SetYoushiki101IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki101Data(pDB, nType, m_nColumnMax);
		break;
	//	⑩ー２.源泉取得税［様式102］
	case ID_FORMNO_102:
		ret = SetYoushiki102Data(pDB, nType, m_nColumnMax);
		break;
	//	⑪.借入金［様式111］
	case ID_FORMNO_111:
		ret = SetYoushiki111Data(pDB, nType, m_nColumnMax);
		break;
	//	⑫.土地の売上高等［様式121］
	case ID_FORMNO_121:
		if(bG_InvNo == TRUE)	ret = SetYoushiki121IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki121Data(pDB, nType, m_nColumnMax);
		break;
	//	⑬.売上高等の事業所別［様式131］
	case ID_FORMNO_131:
		ret = SetYoushiki131Data(pDB, nType, m_nColumnMax);
		break;
	//	⑭ー１.役員報酬手当金等［様式141］
	case ID_FORMNO_141:
		ret = SetYoushiki141Data(pDB, nType, m_nColumnMax);
		break;
	//	⑭ー２.人件費［様式142］
	case ID_FORMNO_142:
		//	基本的には呼ばれないので何もしない。
		break;
	//	⑮ー１.地代家賃等［様式151］
	case ID_FORMNO_151:
		if(bG_InvNo == TRUE)	ret = SetYoushiki151IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki151Data(pDB, nType, m_nColumnMax);
		break;
	//	⑮ー２.権利金等の期中支払［様式152］
	case ID_FORMNO_152:
		if(bG_InvNo == TRUE)	ret = SetYoushiki152IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki152Data(pDB, nType, m_nColumnMax);
		break;
	//	⑮ー３.工業所有権等の使用料［様式153］
	case ID_FORMNO_153:
		if(bG_InvNo == TRUE)	ret = SetYoushiki153IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki153Data(pDB, nType, m_nColumnMax);
		break;
	//	⑯ー１.雑役［様式161］
	case ID_FORMNO_161:
		if(bG_InvNo == TRUE)	ret = SetYoushiki161IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki161Data(pDB, nType, m_nColumnMax);
		break;
	//	⑯ー２.雑損失［様式162］
	case ID_FORMNO_162:
		if(bG_InvNo == TRUE)	ret = SetYoushiki162IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki162Data(pDB, nType, m_nColumnMax);
		break;
	//	⑰.その他科目の内訳書①［様式171］
	case ID_FORMNO_171:
	case ID_FORMNO_172:
	case ID_FORMNO_173:
	case ID_FORMNO_174:
	case ID_FORMNO_175:
	case ID_FORMNO_176:
	case ID_FORMNO_177:
	case ID_FORMNO_178:
	case ID_FORMNO_179:
	case ID_FORMNO_1710:
	case ID_FORMNO_1711:
	case ID_FORMNO_1712:
	case ID_FORMNO_1713:
	case ID_FORMNO_1714:
	case ID_FORMNO_1715:
	case ID_FORMNO_1716:
	case ID_FORMNO_1717:
	case ID_FORMNO_1718:
	case ID_FORMNO_1719:
	case ID_FORMNO_1720:
		if(bG_InvNo == TRUE)	ret = SetYoushiki171IData(pDB, nType, m_nColumnMax);
		else					ret = SetYoushiki171Data(pDB, nType, m_nColumnMax);
		break;
	//	⑱.その他科目の内訳書②［様式181］
	case ID_FORMNO_181:
	case ID_FORMNO_182:
	case ID_FORMNO_183:
	case ID_FORMNO_184:
	case ID_FORMNO_185:
	case ID_FORMNO_186:
	case ID_FORMNO_187:
	case ID_FORMNO_188:
	case ID_FORMNO_189:
	case ID_FORMNO_1810:
	case ID_FORMNO_1811:
	case ID_FORMNO_1812:
	case ID_FORMNO_1813:
	case ID_FORMNO_1814:
	case ID_FORMNO_1815:
	case ID_FORMNO_1816:
	case ID_FORMNO_1817:
	case ID_FORMNO_1818:
	case ID_FORMNO_1819:
	case ID_FORMNO_1820:
		ret = SetYoushiki181Data(pDB, nType, m_nColumnMax);
		break;
	}
// インボイス登録番号追加対応_23/11/06 add <--

	//	戻値が0行？
	if(ret == 0)	{
		m_btnDelete.EnableWindow(FALSE);		//	全て戻すボタン無効
		m_btnOK.EnableWindow(FALSE);			//	戻すボタン無効
		m_btnAllOn.EnableWindow(FALSE);			//	全選択ボタン無効
		m_btnAllOff.EnableWindow(FALSE);		//	全解除ボタン無効
		m_RepDisplay.EnableWindow(FALSE);		//	レポートを無効
		m_btnCancel.SetFocus();					//	閉じるボタンにフォーカス移動
	}
	else	{
		if(m_DataKakutei)	{
			m_btnDelete.EnableWindow(FALSE);	//	全て戻すボタン無効
			m_btnOK.EnableWindow(FALSE);		//	戻すボタン無効
			m_btnAllOff.EnableWindow(FALSE);	//	全解除ボタン無効
			m_btnAllOn.EnableWindow(FALSE);		//	全選択ボタン無効
		}
		else				{
			m_btnDelete.EnableWindow(TRUE);		//	全て戻すボタン有効
			m_btnOK.EnableWindow(TRUE);			//	戻すボタン有効
			m_btnAllOff.EnableWindow(TRUE);		//	全解除ボタン有効
			m_btnAllOn.EnableWindow(TRUE);		//	全選択ボタン無効
		}
		m_RepDisplay.EnableWindow(TRUE);		//	レポートを有効
	}
}

//--------------------------------------------------
//	①.預貯金等［様式011］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki011Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nRet=0;
	int						nCnt=0;			//	カウント用
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt=0;
//	double					dvl=0;
//	char					cFmt1[32];
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc011Yotyokin		mfcRec(pDB);	//	uc_011_yotyokinテーブルクラス

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ));
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 金融機関名
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName1");
						//else					sort = _T("BkName1 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("BkKana1");
						else					sort = _T("BkKana1 DESC");
// No.158071 add <--
						break;
					case	1:	// 支店名
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName2");
						//else					sort = _T("BkName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("BkKana2");
						else					sort = _T("BkKana2 DESC");
// No.158071 add <--
						break;
					case	2:	// 種類
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	3:	// 口座番号
						if(m_SortSw[1] == 1)	sort = _T("AcNum");
						else					sort = _T("AcNum DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}

				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 金融機関名
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName1");
						//else					sort = _T("BkName1 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("BkKana1");
						else					sort = _T("BkKana1 DESC");
// No.158071 add <--
						break;
					case	1:	// 支店名
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName2");
						//else					sort = _T("BkName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("BkKana2");
						else					sort = _T("BkKana2 DESC");
// No.158071 add <--
						break;
					case	2:	// 種類
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	3:	// 口座番号
						if(m_SortSw[1] == 1)	sort = _T("AcNum");
						else					sort = _T("AcNum DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

// midori 190301 del -->
					////	1.金融機関名
					//cst.Empty();
					//memset(buf,0,128);
					//if( !mfcRec.m_BkName2.IsEmpty() )	{		//	支店名あり？
					//	cst.Format( "%s／%s", mfcRec.m_BkName1, mfcRec.m_BkName2 );
					//}
					//else	{
					//	cst = mfcRec.m_BkName1;
					//}
					//sprintf_s(buf,_T("%s"), cst);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// midori 190301 del <--
// midori 190301 add -->
					if(bG_Kanso == TRUE)	{
						//	1.金融機関名
						cst.Empty();
						memset(buf,0,128);
						cst = mfcRec.m_BkName1;
						sprintf_s(buf,_T("%s"), cst);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 0);
// 21/06/24_01 add <--

						//	2.支店名
						cst.Empty();
						memset(buf,0,128);
						cst = mfcRec.m_BkName2;
						sprintf_s(buf,_T("%s"), cst);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 1);
// 21/06/24_01 add <--
					}
					else	{
						//	1.金融機関名
						cst.Empty();
						memset(buf,0,128);
						if( !mfcRec.m_BkName2.IsEmpty() )	{		//	支店名あり？
							cst.Format( "%s／%s", mfcRec.m_BkName1, mfcRec.m_BkName2 );
						}
						else	{
							cst = mfcRec.m_BkName1;
						}
						sprintf_s(buf,_T("%s"), cst);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					}
// midori 190301 add <--

					//	2.種類
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	3.口座番号
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AcNum);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ALPHABET|ICS_EDS_KANA|ICS_EDS_ASCII),FALSE,TRUE,14,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	4.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//
//					if(bG_Kanso == TRUE) {
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);
// 21/06/24_01 add <--

					//	5.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}

		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);

	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}	
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

//--------------------------------------------------
//	②.受取手形［様式021］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki021Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
	char					ssw1=0x00;
	CString					sort="";
// No.158072 add <--
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc021Uketoritegata	mfcRec(pDB);	//	uc_021_Uketoritegataテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();
	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;

					case	1:	// 振出人
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	2:	// 振出年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	3:	// 支払期日
						if(m_SortSw[1] == 1)	sort = _T("PmDate");
						else					sort = _T("PmDate DESC");
						break;
					case	4:	// 支払銀行
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName1 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("BkName1 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
// No.158071 add <--
						break;
					case	5:	// 支払銀行支店名
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("BkName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
// No.158071 add <--
						break;
					case	6:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	7:	// 割引銀行
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("Bk2Name1 COLLATE Japanese_CS_AS_KS_WS, Bk2Name2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("Bk2Name1 COLLATE Japanese_CS_AS_KS_WS DESC, Bk2Name2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x30;
						else					ssw1 = 0x31;
// No.158071 add <--
						break;
					case	8:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}

				if(m_SortSw[1] == 1)	sort = sort + _T(", [dbo].[uc_lst_hokan].OrderNum");
				else					sort = sort + _T(", [dbo].[uc_lst_hokan].OrderNum DESC");

				if(ssw1 == 0x00)	{
					cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
				}
				else {
					cst = mfcRec.GetSQLHokanSort021(m_nFormSeq, sort, ssw1);
				}
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;

					case	1:	// 振出人
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	2:	// 振出年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	3:	// 支払期日
						if(m_SortSw[1] == 1)	sort = _T("PmDate");
						else					sort = _T("PmDate DESC");
						break;
					case	4:	// 支払銀行
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName1 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("BkName1 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
// No.158071 add <--
						break;
					case	5:	// 支払銀行支店名
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("BkName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
// No.158071 add <--
						break;
					case	6:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	7:	// 割引銀行
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("Bk2Name1 COLLATE Japanese_CS_AS_KS_WS, Bk2Name2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("Bk2Name1 COLLATE Japanese_CS_AS_KS_WS DESC, Bk2Name2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
// No.158111 del -->
						//if(m_SortSw[1] == 1)	ssw1 = 0x20;
						//else					ssw1 = 0x21;
// No.158111 del <--
// No.158111 add -->
						if(m_SortSw[1] == 1)	ssw1 = 0x30;
						else					ssw1 = 0x31;
// No.158111 add <--
// No.158071 add <--
						break;
					case	8:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				if(ssw1 == 0x00) {
					nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
				}
				else	{
					cst = mfcRec.RequeryFgShowIkkatuSort021(m_nNumGroup, sort, ssw1);
					ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
					if(ret != 0)	nRet = DB_ERR_OK;
				}
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 金額の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.振出人
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.振出年月日
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);							//	日付変換
// midori 200101 del -->
						//sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
						else {
							sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
// midori 200101 add <--
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,8,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.支払期日
					memset(buf,0,128);
					if(mfcRec.m_PmDate > 0)	{
						clsDate.Convert(mfcRec.m_PmDate);							//	日付変換
// midori 200101 del -->
						//sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou,clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
						else {
							sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
// midori 200101 add <--
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,8,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

// midori 190301 del -->
					////	5.支払銀行名
					//memset(buf,0,128);
					//if( !mfcRec.m_BkName2.IsEmpty() )	{	//	支店名あり？
					//	sprintf_s(buf,_T("%s／%s"), mfcRec.m_BkName1, mfcRec.m_BkName2);	//	銀行名＋支店名
					//}
					//else	{
					//	sprintf_s(buf,_T("%s"), mfcRec.m_BkName1);							//	銀行名
					//}
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// midori 190301 del <--
// midori 190301 add -->
					if(bG_Kanso == TRUE)	{
						//	5.支払銀行名称
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"),mfcRec.m_BkName1);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 4);
// 21/06/24_01 add <--

						//	6.支払銀行支店名
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"),mfcRec.m_BkName2);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 5);
// 21/06/24_01 add <--
					}
					else	{
						//	5.支払銀行名
						memset(buf,0,128);
						if( !mfcRec.m_BkName2.IsEmpty() )	{	//	支店名あり？
							sprintf_s(buf,_T("%s／%s"), mfcRec.m_BkName1, mfcRec.m_BkName2);	//	銀行名＋支店名
						}
						else	{
							sprintf_s(buf,_T("%s"), mfcRec.m_BkName1);							//	銀行名
						}
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					}
// midori 190301 add <--

					//	6.金額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else {
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 6);
// 21/06/24_01 add <--

					//	7.割引銀行名
					memset(buf,0,128);
					if( !mfcRec.m_Bk2Name2.IsEmpty() )	{	//	支店名あり？
						sprintf_s(buf,_T("%s／%s"), mfcRec.m_Bk2Name1, mfcRec.m_Bk2Name2);	//	銀行名＋支店名
					}
					else	{
						sprintf_s(buf,_T("%s"), mfcRec.m_Bk2Name1);							//	銀行名
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 7);
// 21/06/24_01 add <--

					//	8.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 8);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}	
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/09/11 add -->
//--------------------------------------------------
//	②.受取手形［様式021］データ設定（インボイス番号対応版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki021IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	int						key = 0;
	char					buf[128];
	char					val[6];
	char					ssw1=0x00;
	CString					sort="";
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc021Uketoritegata	mfcRec(pDB);	//	uc_021_Uketoritegataテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();
	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			//if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 振出人
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	// 振出年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	4:	// 支払期日
						if(m_SortSw[1] == 1)	sort = _T("PmDate");
						else					sort = _T("PmDate DESC");
						break;
					case	5:	// 支払銀行
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
						break;
					case	6:	// 支払銀行支店名
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
						break;
					case	7:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	8:	// 割引銀行
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x30;
						else					ssw1 = 0x31;
						break;
					case	9:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}

				if(m_SortSw[1] == 1)	sort = sort + _T(", [dbo].[uc_lst_hokan].OrderNum");
				else					sort = sort + _T(", [dbo].[uc_lst_hokan].OrderNum DESC");

				if(ssw1 == 0x00)	{
					cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
				}
				else {
					cst = mfcRec.GetSQLHokanSort021(m_nFormSeq, sort, ssw1);
				}
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			//if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 振出人
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	// 振出年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	4:	// 支払期日
						if(m_SortSw[1] == 1)	sort = _T("PmDate");
						else					sort = _T("PmDate DESC");
						break;
					case	5:	// 支払銀行
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
						break;
					case	6:	// 支払銀行支店名
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
						break;
					case	7:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	8:	// 割引銀行
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x30;
						else					ssw1 = 0x31;
						break;
					case	9:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				if(ssw1 == 0x00) {
					nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
				}
				else	{
					cst = mfcRec.RequeryFgShowIkkatuSort021(m_nNumGroup, sort, ssw1);
					ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
					if(ret != 0)	nRet = DB_ERR_OK;
				}
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					key = 0;

					// 1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 2.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 3.振出人
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 4.振出年月日
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);							//	日付変換
						sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,10,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 5.支払期日
					memset(buf,0,128);
					if(mfcRec.m_PmDate > 0)	{
						clsDate.Convert(mfcRec.m_PmDate);							//	日付変換
						sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou,clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,10,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 6.支払銀行名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_BkName1);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 7.支払銀行支店名
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_BkName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 8.金額
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else								m_Fmt = VAL_FORMAT27;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 9.割引銀行名
					memset(buf,0,128);
					if( !mfcRec.m_Bk2Name2.IsEmpty() )	{	//	支店名あり？
						sprintf_s(buf,_T("%s／%s"), mfcRec.m_Bk2Name1, mfcRec.m_Bk2Name2);	// 銀行名＋支店名
					}
					else	{
						sprintf_s(buf,_T("%s"), mfcRec.m_Bk2Name1);							// 銀行名
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 10.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					// 次のレコードに移動
					mfcRec.MoveNext();

					// 行をインクリメント
					nLine++;
				}
			}
			// レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		// レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}	
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/09/11 add <--

//--------------------------------------------------
//	③.売掛金［様式031］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki031Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt=0;
//	double					dvl=0;
//	char					cFmt1[32];
//// No.158013 add <--
// No.158072 del <--
	char					buf[128];
	char					val[6];
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc031Urikakekin		mfcRec(pDB);	//	uc_031_Urikakekinテーブルクラス

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0]) {
					case 0:		//	1.科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case 1:		//	2.相手先(名称)
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case 2:		//	3.相手先(住所)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case 3:		//	4.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case 4:		//	5.摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");			// 昇順
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
				}
				//sort = sort + _T(",OrderNum");
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0]) {
					case 0:		//	1.科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case 1:		//	2.相手先(名称)
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case 2:		//	3.相手先(住所)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case 3:		//	4.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");		// 昇順
						else					sort = _T("Val DESC");	// 降順
						break;
					case 4:		//	5.摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");			// 昇順
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
				}
				//sort = sort + _T(",Seq");
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.相手先(名称)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.相手先(住所)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 3);
// 21/06/24_01 add <--

					//	5.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	③.売掛金［様式031］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki031IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc031Urikakekin		mfcRec(pDB);	//	uc_031_Urikakekinテーブルクラス

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0]) {
					case 0:		//	1.科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case 1:		//	2.登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case 2:		//	3.相手先(名称)
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case 3:		//	4.相手先(住所)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case 4:		//	5.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case 5:		//	6.摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");			// 昇順
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0]) {
					case 0:		//	1.科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case 1:		//	2.登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case 2:		//	3.相手先(名称)
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case 3:		//	4.相手先(住所)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case 4:		//	5.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");		// 昇順
						else					sort = _T("Val DESC");	// 降順
						break;
					case 5:		//	6.摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");			// 昇順
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.相手先(名称)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.相手先(住所)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.期末現在高
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT27;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);

					//	6.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	④－１.仮払金［様式041］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki041Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
//// No.158013 add <--
// No.158072 del <--
	char					buf[128];
	char					val[6];
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc041Karibarai		mfcRec(pDB);	//	uc_041_Karibaraiテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	//	2.相手先(名称)
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	2:	//	3.相手先(住所)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	//	4.相手先（法人・代表者との関係）
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");		// 昇順
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
					case	4:	//	5.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");		// 昇順
						else					sort = _T("Val DESC");	// 降順
						break;
					case	5:	//	6.取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");		// 昇順
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
				}
				//sort = sort + _T(",OrderNum");
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	//	2.相手先(名称)
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	2:	//	3.相手先(住所)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	//	4.相手先（法人・代表者との関係）
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");		// 昇順
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
					case	4:	//	5.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");		// 昇順
						else					sort = _T("Val DESC");	// 降順
						break;
					case	5:	//	6.取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");		// 昇順
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
				}
				//sort = sort + _T(",Seq");
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();
				
				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.相手先(名称)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.相手先(住所)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.相手先（法人・代表者との関係）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);
// 21/06/24_01 add <--

					//	6.取引の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	④－１.仮払金［様式041］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki041IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc041Karibarai		mfcRec(pDB);	//	uc_041_Karibaraiテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	//	2.登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	//	3.相手先(名称)
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	//	4.相手先(住所)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	//	5.相手先（法人・代表者との関係）
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");		// 昇順
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
					case	5:	//	6.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");		// 昇順
						else					sort = _T("Val DESC");	// 降順
						break;
					case	6:	//	7.取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");		// 昇順
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	//	2.登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	//	3.相手先(名称)
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	//	4.相手先(住所)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	//	5.相手先（法人・代表者との関係）
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");		// 昇順
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
					case	5:	//	6.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");		// 昇順
						else					sort = _T("Val DESC");	// 降順
						break;
					case	6:	//	7.取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");		// 昇順
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");	// 降順
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();
				
				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.相手先(名称)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.相手先(住所)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.相手先（法人・代表者との関係）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);

					//	6.期末現在高
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 5);

					//	7.取引の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	④－２.貸付金［様式042］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki042Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt1=0,kt2=0,kt3=0;
//	char					cFmt1[32],cFmt2[32],cFmt3[32];
//	double					dvl=0;
//	CString					cst=_T("");
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
	CString					cst=_T("");
	CString					sort="";
// No.158072 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc042Kasituke		mfcRec( pDB );	//	uc_042_kasitukeテーブルクラス
	CdateConvert			clsDate;		//	日付変換

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 貸付先
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	1:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1, AdAdd2");
						else					sort = _T("AdAdd1 DESC, AdAdd2 DESC");
						break;
					case	2:	// 法人・代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei");
						else					sort = _T("Kankei DESC");
						break;
					case	3:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	4:	// 期中の受取利息高
						if(m_SortSw[1] == 1)	sort = _T("Risoku");
						else					sort = _T("Risoku DESC");
						break;
					case	5:	// 利率
						if(m_SortSw[1] == 1)	sort = _T("Rate");
						else					sort = _T("Rate DESC");
						break;
					case	6:	// 担保の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 貸付先
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	1:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 法人・代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	4:	// 期中の受取利息高
						if(m_SortSw[1] == 1)	sort = _T("Risoku");
						else					sort = _T("Risoku DESC");
						break;
					case	5:	// 利率
						if(m_SortSw[1] == 1)	sort = _T("Rate");
						else					sort = _T("Rate DESC");
						break;
					case	6:	// 担保の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt1 = kt2 = kt3 = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt1 < kk)	{
//						kt1 = kk;
//					}
//
//					// 期中の受取利息高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Risoku);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt2 < kk)	{
//						kt2 = kk;
//					}
//
//					// 利率の受取利息高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Rate);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt3 < kk)	{
//						kt3 = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 期末現在高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt1);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//				// 期中の受取利息高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt2);
//				memset(cFmt2, 0, sizeof(cFmt2));
//				lstrcpy(cFmt2, cst);
//				// 利率の編集フォーマット作成
//				kt3 = kt3 - 3;
//				cst.Empty();
//				cst = MakeFormatNum(kt3, 3);
//				memset(cFmt3, 0, sizeof(cFmt3));
//				lstrcpy(cFmt3, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.貸付先
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

// midori 190301 del -->
					////	2.法人・代表者との関係
					//memset(buf,0,128);
					//sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));

					////	3.所在地
					//memset(buf,0,128);
					//sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// midori 190301 del <--
// midori 190301 add -->
					if(bG_Kanso == TRUE)	{
						//	2.所在地
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 1);
// 21/06/24_01 add <--

						//	3.法人・代表者との関係
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 2);
// 21/06/24_01 add <--
					}
					else	{
						//	2.法人・代表者との関係
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));

						//	3.所在地
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					}
// midori 190301 add <--

					//	4.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 3);
// 21/06/24_01 add <--

					//	5.期中の受取利息高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Risoku);
////					l_input(val, buf);
////					if(mfcRec.m_Risoku.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT18;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT26;
////						else					m_Fmt = VAL_FORMAT18;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Risoku);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE) {
//						dvl = _tstoi(mfcRec.m_Risoku);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Risoku.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else									l_print(buf, val, cFmt2);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Risoku.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT18;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Risoku);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Risoku.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)				m_Fmt = VAL_FORMAT26;
						else								m_Fmt = VAL_FORMAT18;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Risoku, 4);
// 21/06/24_01 add <--

					//	6.利率
					memset(buf,0,128);
					memset(val,0,6);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Rate);
					l_input(val, buf);
// No.158072 del -->
//// No.158013 del -->
//					//if(mfcRec.m_Rate.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					//else								m_Fmt = VAL_FORMAT25;
//					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,6,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					if(bG_Kanso == TRUE)	{
//						if(mfcRec.m_Rate.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = cFmt3;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 6, ICS_EDS_LEFT, TRUE));
//					}
//					else	{
//						if(mfcRec.m_Rate.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT25;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 6, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					if(mfcRec.m_Rate.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else								m_Fmt = VAL_FORMAT25;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 6, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Rate, 5);
// 21/06/24_01 add <--

// midori 190301 del -->
					////	7.貸付理由
					//memset(buf,0,128);
					//sprintf_s(buf,_T("%s"), mfcRec.m_Riyuu);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// midori 190301 del <--
// midori 190301 add -->
					if(bG_Kanso != TRUE)	{
						//	7.貸付理由
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_Riyuu);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					}
// midori 190301 add <--

					//	8.担保の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return( nLine );
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	④－２.貸付金［様式042］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki042IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					cst=_T("");
	CString					sort="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc042Kasituke		mfcRec( pDB );	//	uc_042_kasitukeテーブルクラス
	CdateConvert			clsDate;		//	日付変換

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	1:	// 貸付先
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	2:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1, AdAdd2");
						else					sort = _T("AdAdd1 DESC, AdAdd2 DESC");
						break;
					case	3:	// 法人・代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei");
						else					sort = _T("Kankei DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 期中の受取利息高
						if(m_SortSw[1] == 1)	sort = _T("Risoku");
						else					sort = _T("Risoku DESC");
						break;
					case	6:	// 利率
						if(m_SortSw[1] == 1)	sort = _T("Rate");
						else					sort = _T("Rate DESC");
						break;
					case	7:	// 担保の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	1:	// 貸付先
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	2:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 法人・代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 期中の受取利息高
						if(m_SortSw[1] == 1)	sort = _T("Risoku");
						else					sort = _T("Risoku DESC");
						break;
					case	6:	// 利率
						if(m_SortSw[1] == 1)	sort = _T("Rate");
						else					sort = _T("Rate DESC");
						break;
					case	7:	// 担保の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.貸付先
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.法人・代表者との関係
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.期末現在高
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);

					//	6.期中の受取利息高
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Risoku);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Risoku.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT26;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Risoku, 5);

					//	7.利率
					memset(buf,0,128);
					memset(val,0,6);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Rate);
					l_input(val, buf);
					if(mfcRec.m_Rate.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else								m_Fmt = VAL_FORMAT25;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 6, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Rate, 6);

					//	8.担保の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 7);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return( nLine );
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑤.棚卸資産［様式051］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki051Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
// No.200602 add -->
	int						align=0;
// No.200602 add <--
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt1=0,kt2=0,kt3=0;
//	char					cFmt1[32],cFmt2[32],cFmt3[32];
//	double					dvl=0;
// No.158072 del <--
	CString					cst=_T("");
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc051Tanaoroshi		mfcRec(pDB);	//	uc_051_yotyokinテーブルクラス

// 210609 add -->
	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();
// 210609 add <--

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 品目
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 数量
						if(m_SortSw[1] == 1)	sort = _T("Suuryou");
						else					sort = _T("Suuryou DESC");
						break;
					case	3:	// 単位
						if(m_SortSw[1] == 1)	sort = _T("Tanni COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Tanni COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 単価
						if(m_SortSw[1] == 1)	sort = _T("Price");
						else					sort = _T("Price DESC");
						break;
					case	5:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 品目
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 数量
						if(m_SortSw[1] == 1)	sort = _T("Suuryou");
						else					sort = _T("Suuryou DESC");
						break;
					case	3:	// 単位
						if(m_SortSw[1] == 1)	sort = _T("Tanni COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Tanni COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 単価
						if(m_SortSw[1] == 1)	sort = _T("Price");
						else					sort = _T("Price DESC");
						break;
					case	5:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt1 = kt2 = kt3 = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					//　数量の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Suuryou);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt1 < kk)	{
//						kt1 = kk;
//					}
//
//					// 単価の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Price);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt2 < kk)	{
//						kt2 = kk;
//					}
//
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt3 < kk)	{
//						kt3 = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 数量の編集フォーマット作成
//				kt1 = kt1 - 2; // 小数桁数分引く
//				cst.Empty();
//				cst = MakeFormatNum(kt1, 2);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//
//				// 単価の編集フォーマット作成
//				kt2 = kt2 - 2; // 小数桁数分引く
//				cst.Empty();
//				cst = MakeFormatNum(kt2, 2);
//				memset(cFmt2, 0, sizeof(cFmt2));
//				lstrcpy(cFmt2, cst);
//
//				// 期末現在高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt3);
//				memset(cFmt3, 0, sizeof(cFmt3));
//				lstrcpy(cFmt3, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.品目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_HdName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.数量
					memset(buf,0,128);
					memset(val,0,6);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Suuryou);
					l_input(val, buf);
// No.158072 del -->
//// No.158013 del -->
//					//if(mfcRec.m_Suuryou.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					//else									m_Fmt = VAL_FORMAT21;
//					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,10,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					if(bG_Kanso == TRUE)	{
//						if(mfcRec.m_Suuryou.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = cFmt1;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_LEFT, TRUE));
//					}
//					else {
//						if(mfcRec.m_Suuryou.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT21;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					if(mfcRec.m_Suuryou.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT21;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Suuryou, 2);
// 21/06/24_01 add <--

					//	4.単位
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Tanni);
// No.200602 del -->
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC | ICS_EDS_ALPHABET | ICS_EDS_KANA | ICS_EDS_ZENKAKU | ICS_EDS_ASCII),FALSE,TRUE,6,ICS_EDS_RIGHT));
// No.200602 del <--
// No.200602 add -->
					if(bG_Kanso == TRUE)	align = ICS_EDS_CENTER;
					else					align = ICS_EDS_RIGHT;
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC | ICS_EDS_ALPHABET | ICS_EDS_KANA | ICS_EDS_ZENKAKU | ICS_EDS_ASCII),FALSE,TRUE,6,align));
// No.200602 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.単価
// No.158072 del -->
//// No.158013 del -->
//					//memset(buf,0,128);
//					//memset(val,0,6);
//					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Price);
//					//l_input(val, buf);
//					//if(mfcRec.m_Price.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					//else									m_Fmt = VAL_FORMAT20;
//					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Price);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Price);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Price.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else									l_print(buf, val, cFmt2);
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Price.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT20;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
//
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Price);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Price.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT20;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Price, 4);
// 21/06/24_01 add <--

					//	6.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// 修正No.157647 del -->
////					//else								m_Fmt = VAL_FORMAT10;
////// 修正No.157647 del <--
////// 修正No.157647 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT10;
////					}
////// 修正No.157647 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,12,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt3);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT10;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 5);
// 21/06/24_01 add <--

					//	7.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return( nLine );
}

//--------------------------------------------------
//	⑥.有価証券［様式061］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki061Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
// No.200602 add -->
	int						align=0;
// No.200602 add <--
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt1=0,kt2=0,kt3=0,kt4=0,kt5=0;
//	char					cFmt1[32],cFmt2[32],cFmt3[32],cFmt4[32],cFmt5[32];
//	double					dvl=0;
// No.158072 del <--
// No.158072 add -->
	char					ssw1=0x00;
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc061Yuukasyouken	mfcRec(pDB);	//	uc_061_yuukasyoukenテーブルクラス
	CdateConvert			clsDate;		//	日付変換
// midori 190301 add -->
	CUcFunctionCommon		ufc;
	CStringArray			sa;
// midori 190301 add <--

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 区分
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;

					case	1:	// 種類
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("Syurui");
						//else					sort = _T("Syurui DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
// No.158071 add <--
						break;
					case	2:	// 銘柄
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("Syurui");
						//else					sort = _T("Syurui DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
// No.158071 add <--
						break;
					case	3:	// 期末現在高(数量)
						if(m_SortSw[1] == 1)	sort = _T("Suuryou");
						else					sort = _T("Suuryou DESC");
						break;
					case	4:	// 期末現在高(単位)
						if(m_SortSw[1] == 1)	sort = _T("Tanni COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Tanni COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 期末現在高(上段)
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 期末現在高(下段)
						if(m_SortSw[1] == 1)	sort = _T("Val2");
						else					sort = _T("Val2 DESC");
						break;
					case	7:	// 異動年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	8:	// 異動事由
						if(m_SortSw[1] == 1)	sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	9:	// 数量
						if(m_SortSw[1] == 1)	sort = _T("Suuryou2");
						else					sort = _T("Suuryou2 DESC");
						break;
					case	10:	// 単位
						if(m_SortSw[1] == 1)	sort = _T("Tanni2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Tanni2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	11:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val3");
						else					sort = _T("Val3 DESC");
						break;
					case	12:	// 売却先(名称)
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	13:	// 売却先(所在地)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	14:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				if(ssw1 == 0x00) {
					cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
				}
				else {
					cst = mfcRec.GetSQLHokanSort061(m_nFormSeq, sort, ssw1);
				}
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 区分
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;

					case	1:	// 種類
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("Syurui");
						//else					sort = _T("Syurui DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
// No.158071 add <--
						break;
					case	2:	// 銘柄
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("Syurui");
						//else					sort = _T("Syurui DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
// No.158071 add <--
						break;
					case	3:	// 期末現在高(数量)
						if(m_SortSw[1] == 1)	sort = _T("Suuryou");
						else					sort = _T("Suuryou DESC");
						break;
					case	4:	// 期末現在高(単位)
						if(m_SortSw[1] == 1)	sort = _T("Tanni COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Tanni COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 期末現在高(上段)
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 期末現在高(下段)
						if(m_SortSw[1] == 1)	sort = _T("Val2");
						else					sort = _T("Val2 DESC");
						break;
					case	7:	// 異動年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	8:	// 異動事由
						if(m_SortSw[1] == 1)	sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	9:	// 数量
						if(m_SortSw[1] == 1)	sort = _T("Suuryou2");
						else					sort = _T("Suuryou2 DESC");
						break;
					case	10:	// 単位
						if(m_SortSw[1] == 1)	sort = _T("Tanni2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Tanni2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	11:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val3");
						else					sort = _T("Val3 DESC");
						break;
					case	12:	// 売却先(名称)
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	13:	// 売却先(所在地)
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	14:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				if(ssw1 == 0x00) {
					nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
				}
				else	{
					//nRet = mfcRec.RequeryFgShowIkkatuSort061(m_nNumGroup, sort, ssw1);
					cst = mfcRec.RequeryFgShowIkkatuSort061(m_nNumGroup, sort, ssw1);
					ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
					if(ret != 0)	nRet = DB_ERR_OK;
				}
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt1 = kt2 = kt3 = kt4 = kt5 = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高(数量)の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Suuryou);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt1 < kk)	{
//						kt1 = kk;
//					}
//
//					// 期末現在高(上段)の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt2 < kk)	{
//						kt2 = kk;
//					}
//
//					// 期末現在高(下段)の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val2);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt3 < kk)	{
//						kt3 = kk;
//					}
//
//					// 数量の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Suuryou2);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt4 < kk)	{
//						kt4 = kk;
//					}
//
//					// 期末現在高(下段)の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val3);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt5 < kk)	{
//						kt5 = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 期末現在高(数量)の編集フォーマット作成
//				kt1 = kt1 - 3;	// 小数桁数分引く
//				cst.Empty();
//				cst = MakeFormatNum(kt1, 3);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//
//				// 期末現在高(上段)の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt2);
//				memset(cFmt2, 0, sizeof(cFmt2));
//				lstrcpy(cFmt2, cst);
//
//				// 期末現在高(下段)の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt3);
//				memset(cFmt3, 0, sizeof(cFmt3));
//				lstrcpy(cFmt3, cst);
//
//				// 数量の編集フォーマット作成
//				kt4 = kt4 - 3;	// 小数桁数分引く
//				cst.Empty();
//				cst = MakeFormatNum(kt4, 3);
//				memset(cFmt4, 0, sizeof(cFmt4));
//				lstrcpy(cFmt4, cst);
//
//				// 期末現在高(下段)の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt5);
//				memset(cFmt5, 0, sizeof(cFmt5));
//				lstrcpy(cFmt5, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.区分
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

// midori 190301 del -->
					////	2.種類・銘柄
					//memset(buf,0,128);
					//sprintf_s(buf,_T("%s"),mfcRec.m_Syurui);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// midori 190301 del <--
// midori 190301 add -->
					//	2.種類・銘柄
					if(bG_Kanso == TRUE)	{
						sa.RemoveAll();
						ufc.StrDivision(mfcRec.m_Syurui,&sa,2);
						// 種類
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"),sa.GetAt(0));
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 1);
// 21/06/24_01 add <--

						// 銘柄
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"),sa.GetAt(1));
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 2);
// 21/06/24_01 add <--
					}
					else	{
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"),mfcRec.m_Syurui);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					}
// midori 190301 add <--

					//	3.期末現在高(数量)
// No.158072 del -->
//// No.158013 del -->
//					//memset(buf,0,128);
//					//memset(val,0,6);
//					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Suuryou);
//					//l_input(val, buf);
//					//if(mfcRec.m_Suuryou.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					//else									m_Fmt = VAL_FORMAT19;
//					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,13,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Suuryou);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Suuryou);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Suuryou.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else									l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Suuryou.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT19;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Suuryou);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Suuryou.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT19;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Suuryou, 3);
// 21/06/24_01 add <--

					//	4.期末現在高(単位)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_Tanni);
// No.200602 del -->
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC | ICS_EDS_ALPHABET | ICS_EDS_KANA | ICS_EDS_ZENKAKU | ICS_EDS_ASCII),FALSE,TRUE,6,ICS_EDS_RIGHT));
// No.200602 del <--
// No.200602 add -->
					if(bG_Kanso == TRUE)	align = ICS_EDS_CENTER;
					else					align = ICS_EDS_RIGHT;
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC | ICS_EDS_ALPHABET | ICS_EDS_KANA | ICS_EDS_ZENKAKU | ICS_EDS_ASCII),FALSE,TRUE,6,align));
// No.200602 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	5.期末現在高(上段)
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt2);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 5);
// 21/06/24_01 add <--

					//	5.期末現在高(下段)
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
////					l_input(val, buf);
////					if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val2);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val2.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt3);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val2, 6);
// 21/06/24_01 add <--

					//	6.異動年月日
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert( mfcRec.m_SpDate );
// midori 200101 del -->
						//sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
						else {
							sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
// midori 200101 add <--
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,8,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 7);
// 21/06/24_01 add <--

					//	7.異動事由
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_Riyuu);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 8);
// 21/06/24_01 add <--

					//	8.数量
// No.158072 del -->
//// No.158013 del -->
//					//memset(buf,0,128);
//					//memset(val,0,6);
//					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Suuryou2);
//					//l_input(val, buf);
//					//if(mfcRec.m_Suuryou2.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					//else									m_Fmt = VAL_FORMAT19;
//					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,13,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Suuryou2);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Suuryou2);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Suuryou2.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else									l_print(buf, val, cFmt4);
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Suuryou2.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT19;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Suuryou2);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Suuryou2.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT19;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Suuryou2, 9);
// 21/06/24_01 add <--

					//	9.単位
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Tanni2);
// No.200602 del -->
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC | ICS_EDS_ALPHABET | ICS_EDS_KANA | ICS_EDS_ZENKAKU | ICS_EDS_ASCII),FALSE,TRUE,6,ICS_EDS_RIGHT,FALSE));
// No.200602 del <--
// No.200602 add -->
					if(bG_Kanso == TRUE)	align = ICS_EDS_CENTER;
					else					align = ICS_EDS_RIGHT;
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC | ICS_EDS_ALPHABET | ICS_EDS_KANA | ICS_EDS_ZENKAKU | ICS_EDS_ASCII),FALSE,TRUE,6,align,FALSE));
// No.200602 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 10);
// 21/06/24_01 add <--

					//	10.金額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val3);
////					l_input(val, buf);
////					if(mfcRec.m_Val3.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val3);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE) {
//						dvl = _tstoi(mfcRec.m_Val3);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val3.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt5);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val3.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val3);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val3.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val3, 11);
// 21/06/24_01 add <--

					//	11.売却先(名称)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 12);
// 21/06/24_01 add <--

					//	12.売却先(所在地)
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 13);
// 21/06/24_01 add <--

					//	13.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 14);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return( nLine );
}

//--------------------------------------------------
//	⑦.固定資産［様式071］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki071Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt1=0,kt2=0,kt3=0,kt4=0;
//	char					cFmt1[32],cFmt2[32],cFmt3[32],cFmt4[32];
//	double					dvl=0;
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc071Koteishisan		mfcRec(pDB);	//	uc_071_koteishisanテーブルクラス
	CdateConvert			clsDate;		//	日付変換

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 種類・構造
						if(m_SortSw[1] == 1)	sort = _T("Syurui COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Syurui COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 用途
						if(m_SortSw[1] == 1)	sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 面積
						if(m_SortSw[1] == 1)	sort = _T("Area");
						else					sort = _T("Area DESC");
						break;
					case	3:	// 物件の所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 異動年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	6:	// 異動事由
						if(m_SortSw[1] == 1)	sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	7:	// 取得価額
						if(m_SortSw[1] == 1)	sort = _T("MsVal");
						else					sort = _T("MsVal DESC");
						break;
					case	8:	// 帳簿価額
						if(m_SortSw[1] == 1)	sort = _T("MsVal2");
						else					sort = _T("MsVal2 DESC");
						break;
					case	9:	// 売却先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	10:	// 売却先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	11:	// 取得年月
						if(m_SortSw[1] == 1)	sort = _T("SpDate2");
						else					sort = _T("SpDate2 DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 種類・構造
						if(m_SortSw[1] == 1)	sort = _T("Syurui COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Syurui COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 用途
						if(m_SortSw[1] == 1)	sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 面積
						if(m_SortSw[1] == 1)	sort = _T("Area");
						else					sort = _T("Area DESC");
						break;
					case	3:	// 物件の所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 異動年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	6:	// 異動事由
						if(m_SortSw[1] == 1)	sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	7:	// 取得価額
						if(m_SortSw[1] == 1)	sort = _T("MsVal");
						else					sort = _T("MsVal DESC");
						break;
					case	8:	// 帳簿価額
						if(m_SortSw[1] == 1)	sort = _T("MsVal2");
						else					sort = _T("MsVal2 DESC");
						break;
					case	9:	// 売却先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	10:	// 売却先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	11:	// 取得年月
						if(m_SortSw[1] == 1)	sort = _T("SpDate2");
						else					sort = _T("SpDate2 DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt1 = kt2 = kt3 = kt4 = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 面積の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Area);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt1 < kk)	{
//						kt1 = kk;
//					}
//
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt2 < kk)	{
//						kt2 = kk;
//					}
//
//					// 取得価額の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_MsVal);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt3 < kk)	{
//						kt3 = kk;
//					}
//
//					// 帳簿価額の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_MsVal2);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt4 < kk)	{
//						kt4 = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 面積の編集フォーマット作成
//				kt1 = kt1 - 2; 
//				cst.Empty();
//				cst = MakeFormatNum(kt1, 2);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//
//				// 期末現在高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt2);
//				memset(cFmt2, 0, sizeof(cFmt2));
//				lstrcpy(cFmt2, cst);
//
//				// 取得価額の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt3);
//				memset(cFmt3, 0, sizeof(cFmt3));
//				lstrcpy(cFmt3, cst);
//
//				// 帳簿価額の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt4);
//				memset(cFmt4, 0, sizeof(cFmt4));
//				lstrcpy(cFmt4, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.種類・構造
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Syurui);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.用途
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Youto);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.面積
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
////					l_input(val, buf);
////					if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT23;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT20;
////						else					m_Fmt = VAL_FORMAT23;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					memset(val, 0, 6);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = cFmt1;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_LEFT, TRUE));
//
//					}
//					else	{
//						if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT23;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT20;
						else							m_Fmt = VAL_FORMAT23;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Area, 2);
// 21/06/24_01 add <--

					//	4.物件の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Ad2Add1 + mfcRec.m_Ad2Add2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// 修正No.157648 del -->
////					//else								m_Fmt = VAL_FORMAT10;
////// 修正No.157648 del <--
////// 修正No.157648 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT10;
////					}
////// 修正No.157648 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,12,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE) {
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt2);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT10;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);
// 21/06/24_01 add <--

					//	6.異動年月日
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
// midori 200101 del -->
						//sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
						else {
							sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
// midori 200101 add <--
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,8,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);
// 21/06/24_01 add <--

					//	7.異動事由
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Riyuu);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);
// 21/06/24_01 add <--

					//	8.取得価額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_MsVal);
////					l_input(val, buf);
////					if(mfcRec.m_MsVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else									m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_MsVal);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_MsVal);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_MsVal.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else									l_print(buf, val, cFmt3);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_MsVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_MsVal);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_MsVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)				m_Fmt = VAL_FORMAT10;
						else								m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_MsVal, 7);
// 21/06/24_01 add <--

					//	9.帳簿価額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_MsVal2);
////					l_input(val, buf);
////					if(mfcRec.m_MsVal2.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else									m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_MsVal2);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE) {
//						dvl = _tstoi(mfcRec.m_MsVal2);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_MsVal2.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else									l_print(buf, val, cFmt4);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_MsVal2.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_MsVal2);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_MsVal2.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)				m_Fmt = VAL_FORMAT10;
						else								m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_MsVal2, 8);
// 21/06/24_01 add <--

					//	10.売却先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 9);
// 21/06/24_01 add <--

					//	11.売却先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 10);
// 21/06/24_01 add <--

					//	12.取得年月
					memset(buf,0,128);
					if(mfcRec.m_SpDate2 > 0)	{
						clsDate.Convert( mfcRec.m_SpDate2 );
						sprintf_s(buf,_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,9,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 11);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑦.固定資産［様式071］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki071IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst=_T("");
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc071Koteishisan		mfcRec(pDB);	//	uc_071_koteishisanテーブルクラス
	CdateConvert			clsDate;		//	日付変換

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 種類・構造
						if(m_SortSw[1] == 1)	sort = _T("Syurui COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Syurui COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 用途
						if(m_SortSw[1] == 1)	sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 面積
						if(m_SortSw[1] == 1)	sort = _T("Area");
						else					sort = _T("Area DESC");
						break;
					case	3:	// 物件の所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 異動年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	6:	// 異動事由
						if(m_SortSw[1] == 1)	sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	7:	// 取得価額
						if(m_SortSw[1] == 1)	sort = _T("MsVal");
						else					sort = _T("MsVal DESC");
						break;
					case	8:	// 帳簿価額
						if(m_SortSw[1] == 1)	sort = _T("MsVal2");
						else					sort = _T("MsVal2 DESC");
						break;
					case	9:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	10:	// 売却先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	11:	// 売却先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	12:	// 取得年月
						if(m_SortSw[1] == 1)	sort = _T("SpDate2");
						else					sort = _T("SpDate2 DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 種類・構造
						if(m_SortSw[1] == 1)	sort = _T("Syurui COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Syurui COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 用途
						if(m_SortSw[1] == 1)	sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 面積
						if(m_SortSw[1] == 1)	sort = _T("Area");
						else					sort = _T("Area DESC");
						break;
					case	3:	// 物件の所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 異動年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	6:	// 異動事由
						if(m_SortSw[1] == 1)	sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Riyuu COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	7:	// 取得価額
						if(m_SortSw[1] == 1)	sort = _T("MsVal");
						else					sort = _T("MsVal DESC");
						break;
					case	8:	// 帳簿価額
						if(m_SortSw[1] == 1)	sort = _T("MsVal2");
						else					sort = _T("MsVal2 DESC");
						break;
					case	9:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	10:	// 売却先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	11:	// 売却先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	12:	// 取得年月
						if(m_SortSw[1] == 1)	sort = _T("SpDate2");
						else					sort = _T("SpDate2 DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.種類・構造
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Syurui);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.用途
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Youto);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.面積
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT20;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Area, 2);

					//	4.物件の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Ad2Add1 + mfcRec.m_Ad2Add2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.期末現在高
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT27;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);

					//	6.異動年月日
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
						sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,10,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);

					//	7.異動事由
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Riyuu);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);

					//	8.取得価額
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_MsVal);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_MsVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_MsVal, 7);

					//	9.帳簿価額
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_MsVal2);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_MsVal2.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_MsVal2, 8);

					//	10.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 9);

					//	11.売却先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 10);

					//	12.売却先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 11);

					//	13.取得年月
					memset(buf,0,128);
					if(mfcRec.m_SpDate2 > 0)	{
						clsDate.Convert( mfcRec.m_SpDate2 );
						sprintf_s(buf,_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,9,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 12);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑧.支払手形［様式081］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki081Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
	char					ssw1=0x00;
	CString					sort="";
// No.158072 add <--
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc081Siharaitegata	mfcRec(pDB);	//	uc_081_Shiharaitegataテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 支払先
// No.158112 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158112 del <--
// No.158112 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158112 add <--
						break;
					case	1:	// 振出年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	2:	// 支払期日
						if(m_SortSw[1] == 1)	sort = _T("PmDate");
						else					sort = _T("PmDate DESC");
						break;
					case	3:	// 支払銀行名称
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName1 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("BkName1 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
// No.158071 add <--
						break;
					case	4:	// 支払銀行支店名
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("BkName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
// No.158071 add <--
						break;
					case	5:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", [dbo].[uc_lst_hokan].OrderNum");
				else					sort = sort + _T(", [dbo].[uc_lst_hokan].OrderNum DESC");

				if(ssw1 == 0x00)	{
					cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
				}
				else {
					cst = mfcRec.GetSQLHokanSort081(m_nFormSeq, sort, ssw1);
				}
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 支払先
// No.158112 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158112 del <--
// No.158112 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158112 add <--
						break;
					case	1:	// 振出年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	2:	// 支払期日
						if(m_SortSw[1] == 1)	sort = _T("PmDate");
						else					sort = _T("PmDate DESC");
						break;
					case	3:	// 支払銀行名称
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName1 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("BkName1 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
// No.158071 add <--
						break;
					case	4:	// 支払銀行支店名
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("BkName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("BkName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
// No.158071 add <--
						break;
					case	5:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				if(ssw1 == 0x00) {
					nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
				}
				else	{
					cst = mfcRec.RequeryFgShowIkkatuSort081(m_nNumGroup, sort, ssw1);
					ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
					if(ret != 0)	nRet = DB_ERR_OK;
				}
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 金額の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 金額の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();
				
				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.支払先
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.振出年月日
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);							//	日付変換
// midori 200101 del -->
						//sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou,clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
						else {
							sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
// midori 200101 add <--
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,8,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.支払期日
					memset(buf,0,128);
					if(mfcRec.m_PmDate > 0)	{
						clsDate.Convert(mfcRec.m_PmDate);							//	日付変換
// midori 200101 del -->
						//sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
						else {
							sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
// midori 200101 add <--
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,8,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

// midori 190301 del -->
					////	4.支払銀行名
					//cst.Empty();
					//memset(buf,0,128);
					//if( !mfcRec.m_BkName2.IsEmpty() )	{	//	支店名あり？
					//	cst.Format( "%s／%s", mfcRec.m_BkName1, mfcRec.m_BkName2);
					//}
					//else	{
					//	cst = mfcRec.m_BkName1;
					//}
					//sprintf_s(buf,_T("%s"),cst);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// midori 190301 del <--
// midori 190301 add -->
					if(bG_Kanso == TRUE)	{
						//	4.支払銀行名称
						cst.Empty();
						memset(buf,0,128);
						cst = mfcRec.m_BkName1;
						sprintf_s(buf,_T("%s"),cst);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 3);
// 21/06/24_01 add <--

						//	5.支払銀行支店名
						cst.Empty();
						memset(buf,0,128);
						cst = mfcRec.m_BkName2;
						sprintf_s(buf,_T("%s"),cst);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 4);
// 21/06/24_01 add <--
					}
					else	{
						//	4.支払銀行名
						cst.Empty();
						memset(buf,0,128);
						if( !mfcRec.m_BkName2.IsEmpty() )	{	//	支店名あり？
							cst.Format( "%s／%s", mfcRec.m_BkName1, mfcRec.m_BkName2);
						}
						else	{
							cst = mfcRec.m_BkName1;
						}
						sprintf_s(buf,_T("%s"),cst);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					}
// midori 190301 add <--

					//	5.金額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del -->
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 5);
// 21/06/24_01 add <--

					//	6.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑧.支払手形［様式081］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki081IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	int						key=0;			// 改良No.21-0086,21-0529 add
	char					buf[128];
	char					val[6];
	char					ssw1=0x00;
	CString					sort="";
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc081Siharaitegata	mfcRec(pDB);	//	uc_081_Shiharaitegataテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
// 改良No.21-0086,21-0529 cor -->
					//case	0:	// 登録番号
					//	if(m_SortSw[1] == 1)	sort = _T("Invno");
					//	else					sort = _T("Invno DESC");
					//	break;
					//case	1:	// 支払先
					//	if(m_SortSw[1] == 1)	sort = _T("AdKana");
					//	else					sort = _T("AdKana DESC");
					//	break;
					//case	2:	// 振出年月日
					//	if(m_SortSw[1] == 1)	sort = _T("SpDate");
					//	else					sort = _T("SpDate DESC");
					//	break;
					//case	3:	// 支払期日
					//	if(m_SortSw[1] == 1)	sort = _T("PmDate");
					//	else					sort = _T("PmDate DESC");
					//	break;
					//case	4:	// 支払銀行名称
					//	sort = _T("");
					//	if(m_SortSw[1] == 1)	ssw1 = 0x10;
					//	else					ssw1 = 0x11;
					//	break;
					//case	5:	// 支払銀行支店名
					//	sort = _T("");
					//	if(m_SortSw[1] == 1)	ssw1 = 0x20;
					//	else					ssw1 = 0x21;
					//	break;
					//case	6:	// 金額
					//	if(m_SortSw[1] == 1)	sort = _T("Val");
					//	else					sort = _T("Val DESC");
					//	break;
					//case	7:	// 摘要
					//	if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
					//	else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
					//	break;
// ------------------------------
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 支払先
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	// 振出年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	4:	// 支払期日
						if(m_SortSw[1] == 1)	sort = _T("PmDate");
						else					sort = _T("PmDate DESC");
						break;
					case	5:	// 支払銀行名称
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
						break;
					case	6:	// 支払銀行支店名
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
						break;
					case	7:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	8:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
// 改良No.21-0086,21-0529 cor <--
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", [dbo].[uc_lst_hokan].OrderNum");
				else					sort = sort + _T(", [dbo].[uc_lst_hokan].OrderNum DESC");

				if(ssw1 == 0x00)	{
					cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
				}
				else {
					cst = mfcRec.GetSQLHokanSort081(m_nFormSeq, sort, ssw1);
				}
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
// 改良No.21-0086,21-0529 cor -->
					//case	0:	// 登録番号
					//	if(m_SortSw[1] == 1)	sort = _T("Invno");
					//	else					sort = _T("Invno DESC");
					//	break;
					//case	1:	// 支払先
					//	if(m_SortSw[1] == 1)	sort = _T("AdKana");
					//	else					sort = _T("AdKana DESC");
					//	break;
					//case	2:	// 振出年月日
					//	if(m_SortSw[1] == 1)	sort = _T("SpDate");
					//	else					sort = _T("SpDate DESC");
					//	break;
					//case	3:	// 支払期日
					//	if(m_SortSw[1] == 1)	sort = _T("PmDate");
					//	else					sort = _T("PmDate DESC");
					//	break;
					//case	4:	// 支払銀行名称
					//	sort = _T("");
					//	if(m_SortSw[1] == 1)	ssw1 = 0x10;
					//	else					ssw1 = 0x11;
					//	break;
					//case	5:	// 支払銀行支店名
					//	sort = _T("");
					//	if(m_SortSw[1] == 1)	ssw1 = 0x20;
					//	else					ssw1 = 0x21;
					//	break;
					//case	6:	// 金額
					//	if(m_SortSw[1] == 1)	sort = _T("Val");
					//	else					sort = _T("Val DESC");
					//	break;
					//case	7:	// 摘要
					//	if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
					//	else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
					//	break;
// ------------------------------
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 支払先
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	// 振出年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	4:	// 支払期日
						if(m_SortSw[1] == 1)	sort = _T("PmDate");
						else					sort = _T("PmDate DESC");
						break;
					case	5:	// 支払銀行名称
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x10;
						else					ssw1 = 0x11;
						break;
					case	6:	// 支払銀行支店名
						sort = _T("");
						if(m_SortSw[1] == 1)	ssw1 = 0x20;
						else					ssw1 = 0x21;
						break;
					case	7:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	8:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
// 改良No.21-0086,21-0529 cor <--
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				if(ssw1 == 0x00) {
					nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
				}
				else	{
					cst = mfcRec.RequeryFgShowIkkatuSort081(m_nNumGroup, sort, ssw1);
					ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
					if(ret != 0)	nRet = DB_ERR_OK;
				}
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();
				
				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

// 改良No.21-0086,21-0529 cor -->
					////	1.登録番号
					//memset(buf,0,128);
					//sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					//// データが存在したらフラグを立てる
					//DataUseCheck(buf, 0);

					////	2.支払先
					//memset(buf,0,128);
					//sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					//// データが存在したらフラグを立てる
					//DataUseCheck(buf, 1);

					////	3.振出年月日
					//memset(buf,0,128);
					//if(mfcRec.m_SpDate > 0)	{
					//	clsDate.Convert(mfcRec.m_SpDate);							//	日付変換
					//	sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou,clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					//}
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,10,ICS_EDS_CENTER));
					//// データが存在したらフラグを立てる
					//DataUseCheck(buf, 2);

					////	4.支払期日
					//memset(buf,0,128);
					//if(mfcRec.m_PmDate > 0)	{
					//	clsDate.Convert(mfcRec.m_PmDate);							//	日付変換
					//	sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					//}
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,10,ICS_EDS_CENTER));
					//// データが存在したらフラグを立てる
					//DataUseCheck(buf, 3);

					////	5.支払銀行名称
					//cst.Empty();
					//memset(buf,0,128);
					//cst = mfcRec.m_BkName1;
					//sprintf_s(buf,_T("%s"),cst);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					//// データが存在したらフラグを立てる
					//DataUseCheck(buf, 4);

					////	6.支払銀行支店名
					//cst.Empty();
					//memset(buf,0,128);
					//cst = mfcRec.m_BkName2;
					//sprintf_s(buf,_T("%s"),cst);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					//// データが存在したらフラグを立てる
					//DataUseCheck(buf, 5);

					////	7.金額
					//memset(buf,0,128);
					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					//l_clear(val);
					//l_input(val, buf);
					//if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					//else	{
					//	m_Fmt = VAL_FORMAT27;
					//}
					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
					//// データが存在したらフラグを立てる
					//DataUseCheck(mfcRec.m_Val, 6);

					////	8.摘要
					//memset(buf,0,128);
					//sprintf_s(buf,_T("%s"),mfcRec.m_Teki);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					//// データが存在したらフラグを立てる
					//DataUseCheck(buf, 7);
// ------------------------------
					key = 0;

					// 1.科目
					memset(buf, 0, 128);
					sprintf_s(buf, _T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 2.登録番号
					memset(buf, 0, 128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 3.支払先
					memset(buf, 0, 128);
					sprintf_s(buf, _T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 4.振出年月日
					memset(buf, 0, 128);
					if(mfcRec.m_SpDate > 0) {
						clsDate.Convert(mfcRec.m_SpDate);							//	日付変換
						sprintf_s(buf, _T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf, (ICS_EDS_NUMERIC | ICS_EDS_ASCII), FALSE, TRUE, 10, ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 5.支払期日
					memset(buf, 0, 128);
					if(mfcRec.m_PmDate > 0) {
						clsDate.Convert(mfcRec.m_PmDate);							//	日付変換
						sprintf_s(buf, _T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf, (ICS_EDS_NUMERIC | ICS_EDS_ASCII), FALSE, TRUE, 10, ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 6.支払銀行名称
					cst.Empty();
					memset(buf, 0, 128);
					cst = mfcRec.m_BkName1;
					sprintf_s(buf, _T("%s"), cst);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 7.支払銀行支店名
					cst.Empty();
					memset(buf, 0, 128);
					cst = mfcRec.m_BkName2;
					sprintf_s(buf, _T("%s"), cst);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;

					// 8.金額
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT27;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, key);
					key++;

					// 9.摘要
					memset(buf, 0, 128);
					sprintf_s(buf, _T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, key);
					key++;
// 改良No.21-0086,21-0529 cor <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑨.買掛金［様式091］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki091Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
// No.158072 del <--
	CString					cst=_T("");
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc091Kaikakekin		mfcRec(pDB);	//	uc_091_kaikakekinテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ));
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	//	2.相手先（名称）
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	2:	//	3.相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	//	4.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	4:	//	5.摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	//	2.相手先（名称）
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	2:	//	3.相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	//	4.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	4:	//	5.摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 期末現在高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();
				
				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.相手先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.相手先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					memset(val, 0, 6);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 3);
// 21/06/24_01 add <--

					//	5.摘要
					memset(buf, 0, 128);
					sprintf_s(buf, _T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return( nLine );
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑨.買掛金［様式091］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki091IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					cst=_T("");
	CString					sort="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc091Kaikakekin		mfcRec(pDB);	//	uc_091_kaikakekinテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	//	2.登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	//	3.相手先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	//	4.相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	//	5.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	//	6.摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	//	2.登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	//	3.相手先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	//	4.相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	//	5.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	//	6.摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();
				
				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.相手先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.相手先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.期末現在高
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT27;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);

					//	6.摘要
					memset(buf, 0, 128);
					sprintf_s(buf, _T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return( nLine );
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑩ー１.仮受金［様式101］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki101Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc101Kariukekin		mfcRec(pDB);	//	uc_101_kariukekinテーブルクラス

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158071 del -->
			//ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ));
// No.158071 del <--
// No.158071 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 相手先（名称）
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	2:	// 相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 相手先（関係）
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158071 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158071 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158071 del <--
// No.158071 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 相手先（名称）
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						//else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	2:	// 相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 相手先（関係）
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158071 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 期末現在高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.相手先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.相手先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.相手先（関係）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf,0,128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);
// 21/06/24_01 add <--

					//	6.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑩ー１.仮受金［様式101］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki101IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst=_T("");
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc101Kariukekin		mfcRec(pDB);	//	uc_101_kariukekinテーブルクラス

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 相手先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	// 相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 相手先（関係）
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 相手先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	3:	// 相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 相手先（関係）
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.相手先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.相手先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.相手先（関係）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);

					//	6.期末現在高
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 5);

					//	7.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑩ー２.源泉取得税［様式102］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki102Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	double					dvl=0;
// No.158072 del <--
	CString					cst=_T("");
// No.158013 add <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc102Gensen			mfcRec(pDB);	//	uc_102_gensenテーブルクラス
	CdateConvert			clsDate;		//	日付変換

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch( nType ){
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ));
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	1:	//	2.所得の種類
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	2:	//	3.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	//	1.年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	1:	//	2.所得の種類
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	2:	//	3.期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.年月日
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
// midori 200101 del -->
						//sprintf_s(buf,_T("%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							sprintf_s(buf,_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
						}
						else {
							sprintf_s(buf,_T("%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth);
						}
// midori 200101 add <--
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,5,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.所得の種類
					memset(buf, 0, 128);
					sprintf_s(buf, _T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC | ICS_EDS_ALPHABET | ICS_EDS_KANA | ICS_EDS_ZENKAKU | ICS_EDS_ASCII),FALSE,TRUE,4,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE) {
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, VAL_FORMAT27);
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 2);
// 21/06/24_01 add <--

					// 4.空白
					pItem = pRecord->AddItem(new ICSReportRecordItemText(_T("")));

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return( nLine );
}

//--------------------------------------------------
//	⑪.借入金［様式111］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki111Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt1=0,kt2=0,kt3=0;
//	char					cFmt1[32],cFmt2[32],cFmt3[32];
//	double					dvl=0;
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst="";
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc111Kariirekin		mfcRec( pDB );	//	uc_111_kariirekinテーブルクラス
	CdateConvert			clsDate;		//	日付変換

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 借入先
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana1, AdKana2");
						else					sort = _T("AdKana1 DESC, AdKana2 DESC");
// No.158071 add <--
						break;
					case	2:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 法人・代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 期中の支払利子額
						if(m_SortSw[1] == 1)	sort = _T("Risoku");
						else					sort = _T("Risoku DESC");
						break;
					case	6:	// 利率
						if(m_SortSw[1] == 1)	sort = _T("Rate");
						else					sort = _T("Rate DESC");
						break;
					case	7:	// 担保の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 借入先
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana1, AdKana2");
						else					sort = _T("AdKana1 DESC, AdKana2 DESC");
// No.158071 add <--
						break;
					case	2:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 法人・代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 期中の支払利子額
						if(m_SortSw[1] == 1)	sort = _T("Risoku");
						else					sort = _T("Risoku DESC");
						break;
					case	6:	// 利率
						if(m_SortSw[1] == 1)	sort = _T("Rate");
						else					sort = _T("Rate DESC");
						break;
					case	7:	// 担保の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if ( !( mfcRec.IsEOF() ) ){
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt1 = kt2 = kt3 = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt1 < kk)	{
//						kt1 = kk;
//					}
//
//					// 期中の支払利子額の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Risoku);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt2 < kk)	{
//						kt2 = kk;
//					}
//
//					// 利率の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Rate);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt3 < kk)	{
//						kt3 = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 期末現在高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt1);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//
//				// 期中の支払利子額
//				cst.Empty();
//				cst = MakeFormatNum(kt2);
//				memset(cFmt2, 0, sizeof(cFmt2));
//				lstrcpy(cFmt2, cst);
//
//				// 利率
//				kt3 = kt3 - 3;
//				cst.Empty();
//				cst = MakeFormatNum(kt3, 3);
//				memset(cFmt3, 0, sizeof(cFmt3));
//				lstrcpy(cFmt3, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.借入先
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

// midori 190301 del -->
					////	3.法人・代表者との関係
					//memset(buf,0,128);
					//sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));

					////	4.所在地
					//memset(buf,0,128);
					//sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// midori 190301 del <--
// midori 190301 add -->
					if(bG_Kanso == TRUE)	{
						//	3.所在地
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 2);
// 21/06/24_01 add <--

						//	4.法人・代表者との関係
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
						// データが存在したらフラグを立てる
						DataUseCheck(buf, 3);
// 21/06/24_01 add <--
					}
					else	{
						//	3.法人・代表者との関係
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));

						//	4.所在地
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					}
// midori 190301 add <--

					//	5.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf,0,128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt,FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);
// 21/06/24_01 add <--

					//	6.期中の支払利子額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Risoku);
////					l_input(val, buf);
////					if(mfcRec.m_Risoku.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else									m_Fmt = VAL_FORMAT18;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT26;
////						else					m_Fmt = VAL_FORMAT18;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Risoku);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Risoku);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Risoku.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else									l_print(buf, val, cFmt2);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Risoku.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT18;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Risoku);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Risoku.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)				m_Fmt = VAL_FORMAT26;
						else								m_Fmt = VAL_FORMAT18;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Risoku, 5);
// 21/06/24_01 add <--

					//	7.利率
					memset(buf,0,128);
					memset(val,0,6);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Rate);
					l_input(val, buf);
// No.158072 del -->
//// No.158013 del -->
//					//if(mfcRec.m_Rate.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					//else								m_Fmt = VAL_FORMAT24;
//					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,7,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					if(bG_Kanso == TRUE) {
//						if(mfcRec.m_Rate.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = cFmt3;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 7, ICS_EDS_LEFT, TRUE));
//					}
//					else {
//						if(mfcRec.m_Rate.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT24;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 7, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					if(mfcRec.m_Rate.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else								m_Fmt = VAL_FORMAT24;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 7, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Rate, 6);
// 21/06/24_01 add <--

// midori 190301 del -->
					////	8.借入理由
					//memset(buf,0,128);
					//sprintf_s(buf,_T("%s"), mfcRec.m_Riyuu);
					//pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// midori 190301 del <--
// midori 190301 add -->
					if(bG_Kanso != TRUE)	{
						//	8.借入理由
						memset(buf,0,128);
						sprintf_s(buf,_T("%s"), mfcRec.m_Riyuu);
						pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					}
// midori 190301 add <--

					//	9.担保の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 7);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

//--------------------------------------------------
//	⑫.土地の売上高等［様式121］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki121Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt1=0,kt2=0,kt3=0,kt4=0;
//	char					cFmt1[32],cFmt2[32],cFmt3[32],cFmt4[32];
//	double					dvl=0;
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc121Totiuriage		mfcRec( pDB );	//	uc_121_totiuriageテーブルクラス
	CdateConvert			clsDate;		//	日付変換

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 区分
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 商品の所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 地目
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 総面積
						if(m_SortSw[1] == 1)	sort = _T("Area");
						else					sort = _T("Area DESC");
						break;
					case	4:	// 売上年月
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	5:	// 売上先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	6:	// 売上先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	7:	// 売上面積
						if(m_SortSw[1] == 1)	sort = _T("Area2");
						else					sort = _T("Area2 DESC");
						break;
					case	8:	// 売上金額（上段）
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	9:	// 売上金額（下段）
						if(m_SortSw[1] == 1)	sort = _T("Val2");
						else					sort = _T("Val2 DESC");
						break;
					case	10:	// 売上商品の取得年
						if(m_SortSw[1] == 1)	sort = _T("SpDate2");
						else					sort = _T("SpDate2 DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 区分
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 商品の所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 地目
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 総面積
						if(m_SortSw[1] == 1)	sort = _T("Area");
						else					sort = _T("Area DESC");
						break;
					case	4:	// 売上年月
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	5:	// 売上先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	6:	// 売上先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	7:	// 売上面積
						if(m_SortSw[1] == 1)	sort = _T("Area2");
						else					sort = _T("Area2 DESC");
						break;
					case	8:	// 売上金額（上段）
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	9:	// 売上金額（下段）
						if(m_SortSw[1] == 1)	sort = _T("Val2");
						else					sort = _T("Val2 DESC");
						break;
					case	10:	// 売上商品の取得年
						if(m_SortSw[1] == 1)	sort = _T("SpDate2");
						else					sort = _T("SpDate2 DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt1 = kt2 = kt3 = kt4 = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 総面積の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Area);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt1 < kk)	{
//						kt1 = kk;
//					}
//
//					// 売上面積の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Area2);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt2 < kk)	{
//						kt2 = kk;
//					}
//
//					// 売上金額（上段）の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt3 < kk)	{
//						kt3 = kk;
//					}
//
//					// 売上金額（下段）の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val2);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt4 < kk)	{
//						kt4 = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 総面積の編集フォーマット作成
//				kt1 = kt1 - 2;
//				cst.Empty();
//				cst = MakeFormatNum(kt1, 2);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//
//				// 売上面積の編集フォーマット作成
//				kt2 = kt2 - 2;
//				cst.Empty();
//				cst = MakeFormatNum(kt2, 2);
//				memset(cFmt2, 0, sizeof(cFmt2));
//				lstrcpy(cFmt2, cst);
//
//				//  売上金額（上段）の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt3);
//				memset(cFmt3, 0, sizeof(cFmt3));
//				lstrcpy(cFmt3, cst);
//
//				//  売上金額（下段）の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt4);
//				memset(cFmt4, 0, sizeof(cFmt4));
//				lstrcpy(cFmt4, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();
				
				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.区分
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.商品の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Ad2Add1 + mfcRec.m_Ad2Add2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.地目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_HdName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.総面積
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
////					l_input(val, buf);
////					if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT23;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT20;
////						else					m_Fmt = VAL_FORMAT23;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf,0,128);
//					memset(val,0,6);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = cFmt1;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_LEFT, TRUE));
//					}
//					else	{
//						if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT23;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT20;
						else							m_Fmt = VAL_FORMAT23;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Area, 3);
// 21/06/24_01 add <--

					//	5.売上年月
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
// midori 200101 del -->
						//sprintf_s(buf,_T("%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							sprintf_s(buf,_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
						}
						else {
							sprintf_s(buf,_T("%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth);
						}
// midori 200101 add <--
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,5,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	6.売上先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);
// 21/06/24_01 add <--

					//	7.売上先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);
// 21/06/24_01 add <--

					//	8.売上面積
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area2);
////					l_input(val, buf);
////					if(mfcRec.m_Area2.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else									m_Fmt = VAL_FORMAT23;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT20;
////						else					m_Fmt = VAL_FORMAT23;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area2);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE) {
//						if(mfcRec.m_Area2.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = cFmt2;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_LEFT, TRUE));
//					}
//					else {
//						if(mfcRec.m_Area2.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT23;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area2);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Area2.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)				m_Fmt = VAL_FORMAT20;
						else								m_Fmt = VAL_FORMAT23;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Area2, 7);
// 21/06/24_01 add <--

					//	9.売上金額（上段）
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt3);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 8);
// 21/06/24_01 add <--

					//	10.売上金額（下段）
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
////					l_input(val, buf);
////					if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val2);
//
//						memset(buf,0,128);
//						if(mfcRec.m_Val2.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt4);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val2, 9);
// 21/06/24_01 add <--

					//	11.売上商品の取得年
					memset(buf,0,128);
					if(mfcRec.m_SpDate2 > 0)	{
						clsDate.Convert(mfcRec.m_SpDate2);
						sprintf_s(buf,_T("%s%s"), clsDate.m_szGengou, clsDate.m_szWareki);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,6,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 10);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return( nLine );
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑫.土地の売上高等［様式121］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki121IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst=_T("");
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc121Totiuriage		mfcRec( pDB );	//	uc_121_totiuriageテーブルクラス
	CdateConvert			clsDate;		//	日付変換

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 区分
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 商品の所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 地目
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 総面積
						if(m_SortSw[1] == 1)	sort = _T("Area");
						else					sort = _T("Area DESC");
						break;
					case	4:	// 売上年月
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	5:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	6:	// 売上先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	7:	// 売上先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	8:	// 売上面積
						if(m_SortSw[1] == 1)	sort = _T("Area2");
						else					sort = _T("Area2 DESC");
						break;
					case	9:	// 売上金額（上段）
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	10:	// 売上金額（下段）
						if(m_SortSw[1] == 1)	sort = _T("Val2");
						else					sort = _T("Val2 DESC");
						break;
					case	11:	// 売上商品の取得年
						if(m_SortSw[1] == 1)	sort = _T("SpDate2");
						else					sort = _T("SpDate2 DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 区分
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 商品の所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 地目
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 総面積
						if(m_SortSw[1] == 1)	sort = _T("Area");
						else					sort = _T("Area DESC");
						break;
					case	4:	// 売上年月
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	5:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	6:	// 売上先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	7:	// 売上先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	8:	// 売上面積
						if(m_SortSw[1] == 1)	sort = _T("Area2");
						else					sort = _T("Area2 DESC");
						break;
					case	9:	// 売上金額（上段）
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	10:	// 売上金額（下段）
						if(m_SortSw[1] == 1)	sort = _T("Val2");
						else					sort = _T("Val2 DESC");
						break;
					case	11:	// 売上商品の取得年
						if(m_SortSw[1] == 1)	sort = _T("SpDate2");
						else					sort = _T("SpDate2 DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();
				
				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.区分
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.商品の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Ad2Add1 + mfcRec.m_Ad2Add2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.地目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_HdName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.総面積
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT20;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Area, 3);

					//	5.売上年月
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
						sprintf_s(buf,_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,7,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);

					//	6.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);

					//	7.売上先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);

					//	8.売上先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 7);

					//	9.売上面積
					memset(buf,0,128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area2);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Area2.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT20;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Area2, 8);

					//	10.売上金額（上段）
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT27;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 9);

					//	11.売上金額（下段）
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT27;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val2, 10);

					//	12.売上商品の取得年
					memset(buf,0,128);
					if(mfcRec.m_SpDate2 > 0)	{
						clsDate.Convert(mfcRec.m_SpDate2);
						sprintf_s(buf,_T("%s%s"), clsDate.m_szGengou, clsDate.m_szWareki);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,6,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 11);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return( nLine );
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑬.売上高等の事業所別［様式131］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki131Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt1=0,kt2=0,kt3=0;
//	char					cFmt1[32],cFmt2[32],cFmt3[32];
//	double					dvl=0;
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc131Uriagedaka		mfcRec( pDB );	//	uc_131_uriagedakaテーブルクラス
	CdateConvert			clsDate;		//	日付変換

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch( nType ){
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 事業所の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 事業所（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 責任者氏名
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 事業等の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 売上高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 期末棚卸高
						if(m_SortSw[1] == 1)	sort = _T("Val2");
						else					sort = _T("Val2 DESC");
						break;
					case	7:	// 期末従事員数
						if(m_SortSw[1] == 1)	sort = _T("Worker");
						else					sort = _T("Worker DESC");
						break;
					case	8:	// 源泉所得税納付署
						if(m_SortSw[1] == 1)	sort = _T("HdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	9:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 事業所の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 事業所（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 責任者氏名
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 事業等の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 売上高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 期末棚卸高
						if(m_SortSw[1] == 1)	sort = _T("Val2");
						else					sort = _T("Val2 DESC");
						break;
					case	7:	// 期末従事員数
						if(m_SortSw[1] == 1)	sort = _T("Worker");
						else					sort = _T("Worker DESC");
						break;
					case	8:	// 源泉所得税納付署
						if(m_SortSw[1] == 1)	sort = _T("HdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	9:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt1 = kt2 = kt3 = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 売上高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt1 < kk)	{
//						kt1 = kk;
//					}
//
//					// 期末棚卸高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val2);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt2 < kk)	{
//						kt2 = kk;
//					}
//
//					// 期末従事員数の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Worker);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt3 < kk)	{
//						kt3 = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 売上高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt1);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//
//				// 期末棚卸高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt2);
//				memset(cFmt2, 0, sizeof(cFmt2));
//				lstrcpy(cFmt2, cst);
//
//				// 期末従事員数の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt3);
//				memset(cFmt3, 0, sizeof(cFmt3));
//				lstrcpy(cFmt3, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.事業所の名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.事業所（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.責任者氏名
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_HdName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.代表者との関係
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.事業等の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	6.売上高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 5);
// 21/06/24_01 add <--

					//	7.期末棚卸高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
////					l_input(val, buf);
////					if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val2);
//
//						memset(buf,0,128);
//						if(mfcRec.m_Val2.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt2);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val2);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val2.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val2, 6);
// 21/06/24_01 add <--

					//	8.期末従事員数
					memset(buf,0,128);
					memset(val,0,6);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Worker);
					l_input(val, buf);
// No.158072 del -->
//// No.158013 del -->
//					//if(mfcRec.m_Worker.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					//else									m_Fmt = VAL_FORMAT22;
//					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,6,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					if(bG_Kanso == TRUE)	{
//						if(mfcRec.m_Worker.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = cFmt3;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 7, ICS_EDS_LEFT, TRUE));
//					}
//					else	{
//						if(mfcRec.m_Worker.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else									m_Fmt = VAL_FORMAT22;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 7, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					if(mfcRec.m_Worker.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT22;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 7, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Worker, 7);
// 21/06/24_01 add <--

// midori 190301 del -->
					////	9.使用建物の延面積
					//memset(buf,0,128);
					//memset(val,0,6);
					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
					//l_input(val, buf);
					//if(mfcRec.m_Area.IsEmpty() == TRUE)	m_Fmt = _T("S");
					//else								m_Fmt = VAL_FORMAT23;
					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
// midori 190301 del <--
// midori 190301 add -->
					if(bG_Kanso != TRUE)	{
						//	9.使用建物の延面積
						memset(buf,0,128);
						memset(val,0,6);
						strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Area);
						l_input(val, buf);
// No.158013 del -->
						//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
// No.158013 del <--
// No.158013 add -->
						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
// No.158013 add <--
					}
// midori 190301 add <--

					//	10.源泉所得税納付署
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_HdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 8);
// 21/06/24_01 add <--

					//	11.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 9);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

//--------------------------------------------------
//	⑭ー１.役員報酬手当金等［様式141］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki141Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt1=0,kt2=0,kt3=0,kt4=0,kt5=0,kt6=0,kt7=0;
//	char					cFmt1[32],cFmt2[32],cFmt3[32],cFmt4[32],cFmt5[32],cFmt6[32],cFmt7[32];
//	double					dvl=0;
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst="";			//	常勤・非常勤の文字列格納
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc141Yakuin			mfcRec(pDB);	//	uc_141_yakkuinテーブルクラス
	CdateConvert			clsDate;		//	日付変換
	
	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch( nType ){
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 役職名
						if(m_SortSw[1] == 1)	sort = _T("NameYaku COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("NameYaku COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 担当業務
						if(m_SortSw[1] == 1)	sort = _T("NameTant COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("NameTant COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 氏名
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 住所
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 常勤・非常勤の別
						if(m_SortSw[1] == 1)	sort = _T("FpTime");
						else					sort = _T("FpTime DESC");
						break;
					case	6:	// 使用人職務分
						if(m_SortSw[1] == 1)	sort = _T("EmVal");
						else					sort = _T("EmVal DESC");
						break;
					case	7:	// 定期同額給与
						if(m_SortSw[1] == 1)	sort = _T("PrVal");
						else					sort = _T("PrVal DESC");
						break;
					case	8:	// 事前確定届出給与
						if(m_SortSw[1] == 1)	sort = _T("BfVal");
						else					sort = _T("BfVal DESC");
						break;
					case	9:	// 利益連動給与
						if(m_SortSw[1] == 1)	sort = _T("PfVal");
						else					sort = _T("PfVal DESC");
						break;
					case	10:	// その他
						if(m_SortSw[1] == 1)	sort = _T("EtVal");
						else					sort = _T("EtVal DESC");
						break;
					case	11:	// 退職給与
						if(m_SortSw[1] == 1)	sort = _T("RtVal");
						else					sort = _T("RtVal DESC");
						break;
					case	12:	// 役員給与計
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 役職名
						if(m_SortSw[1] == 1)	sort = _T("NameYaku COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("NameYaku COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 担当業務
						if(m_SortSw[1] == 1)	sort = _T("NameTant COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("NameTant COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 氏名
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 代表者との関係
						if(m_SortSw[1] == 1)	sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Kankei COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 住所
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 常勤・非常勤の別
						if(m_SortSw[1] == 1)	sort = _T("FpTime");
						else					sort = _T("FpTime DESC");
						break;
					case	6:	// 使用人職務分
						if(m_SortSw[1] == 1)	sort = _T("EmVal");
						else					sort = _T("EmVal DESC");
						break;
					case	7:	// 定期同額給与
						if(m_SortSw[1] == 1)	sort = _T("PrVal");
						else					sort = _T("PrVal DESC");
						break;
					case	8:	// 事前確定届出給与
						if(m_SortSw[1] == 1)	sort = _T("BfVal");
						else					sort = _T("BfVal DESC");
						break;
					case	9:	// 利益連動給与
						if(m_SortSw[1] == 1)	sort = _T("PfVal");
						else					sort = _T("PfVal DESC");
						break;
					case	10:	// その他
						if(m_SortSw[1] == 1)	sort = _T("EtVal");
						else					sort = _T("EtVal DESC");
						break;
					case	11:	// 退職給与
						if(m_SortSw[1] == 1)	sort = _T("RtVal");
						else					sort = _T("RtVal DESC");
						break;
					case	12:	// 役員給与計
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt1 = kt2 = kt3 = kt4 = kt5 = kt6 = kt7 = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 使用人職務分の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_EmVal);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt1 < kk)	{
//						kt1 = kk;
//					}
//
//					// 定期同額給与の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_PrVal);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt2 < kk)	{
//						kt2 = kk;
//					}
//
//					// 事前確定届出給与の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_BfVal);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt3 < kk)	{
//						kt3 = kk;
//					}
//
//					// 利益連動給与の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_PfVal);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt4 < kk)	{
//						kt4 = kk;
//					}
//
//					// その他の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_EtVal);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt5 < kk)	{
//						kt5 = kk;
//					}
//
//					// 退職給与の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_RtVal);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt6 < kk)	{
//						kt6 = kk;
//					}
//
//					// 役員給与計の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt7 < kk)	{
//						kt7 = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 使用人職務分の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt1);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//
//				// 定期同額給与の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt2);
//				memset(cFmt2, 0, sizeof(cFmt2));
//				lstrcpy(cFmt2, cst);
//
//				// 事前確定届出給与の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt3);
//				memset(cFmt3, 0, sizeof(cFmt3));
//				lstrcpy(cFmt3, cst);
//
//				// 利益連動給与の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt4);
//				memset(cFmt4, 0, sizeof(cFmt4));
//				lstrcpy(cFmt4, cst);
//
//				// その他の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt5);
//				memset(cFmt5, 0, sizeof(cFmt5));
//				lstrcpy(cFmt5, cst);
//
//				// 退職給与の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt6);
//				memset(cFmt6, 0, sizeof(cFmt6));
//				lstrcpy(cFmt6, cst);
//
//				// 役員給与計の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt7);
//				memset(cFmt7, 0, sizeof(cFmt7));
//				lstrcpy(cFmt7, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();
				
				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.役職名
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_NameYaku);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.担当業務
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_NameTant);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.氏名
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.代表者との関係
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Kankei);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.住所
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	6.常勤・非常勤の別
					cst.Empty();
					switch(mfcRec.m_FpTime)	{	//	常勤非常勤のフラグで分岐
						case 1:		//	常勤
							cst = "常";
							break;
						case 2:		//	非常勤
							cst = "非";
							break;
						default:	//	その他
							break;
						}
					sprintf_s(buf,_T("%s"), cst);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,ICS_EDS_ZENKAKU,FALSE,TRUE,2,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);
// 21/06/24_01 add <--

// 改良No.23-0961 del -->
//					//	7.使用人職務分
//// No.158072 del -->
////// No.158013 del -->
////					//memset(buf,0,128);
////					//memset(val,0,6);
////					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_EmVal);
////					//l_input(val, buf);
////					//if(mfcRec.m_EmVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////					//else									m_Fmt = VAL_FORMAT18;
////					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
////// No.158013 del <--
////// No.158013 add -->
////					memset(buf, 0, 128);
////					l_clear(val);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_EmVal);
////					l_input(val, buf);
////					if(bG_Kanso == TRUE)	{
////						dvl = _tstoi(mfcRec.m_EmVal);
////
////						memset(buf, 0, 128);
////						if(mfcRec.m_EmVal.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
////						else									l_print(buf, val, cFmt1);
////
////						cst.Empty();
////						cst.Format(_T("%s"), buf);
////						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
////					}
////					else	{
////						if(mfcRec.m_EmVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////						else									m_Fmt = VAL_FORMAT18;
////						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
////					}
////// No.158013 add <--
//// No.158072 del <--
//// No.158072 add -->
//					memset(buf, 0, 128);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_EmVal);
//					l_clear(val);
//					l_input(val, buf);
//					if(mfcRec.m_EmVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					else									m_Fmt = VAL_FORMAT18;
//					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//// No.158072 add <--
//// 21/06/24_01 add -->
//					// データが存在したらフラグを立てる
//					DataUseCheck(mfcRec.m_EmVal, 6);
//// 21/06/24_01 add <--
//
//					//	8.定期同額給与
//// No.158072 del -->
////// No.158013 del -->
////					//memset(buf,0,128);
////					//memset(val,0,6);
////					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_PrVal);
////					//l_input(val, buf);
////					//if(mfcRec.m_PrVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////					//else									m_Fmt = VAL_FORMAT18;
////					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
////// No.158013 del <--
////// No.158013 add -->
////					memset(buf, 0, 128);
////					l_clear(val);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_PrVal);
////					l_input(val, buf);
////					if(bG_Kanso == TRUE)	{
////						dvl = _tstoi(mfcRec.m_PrVal);
////
////						memset(buf, 0, 128);
////						if(mfcRec.m_PrVal.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
////						else									l_print(buf, val, cFmt2);
////						cst.Empty();
////						cst.Format(_T("%s"), buf);
////						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
////					}
////					else	{
////						if(mfcRec.m_PrVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////						else									m_Fmt = VAL_FORMAT18;
////						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
////					}
////// No.158013 add <--
//// No.158072 del <--
//// No.158072 add -->
//					memset(buf, 0, 128);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_PrVal);
//					l_clear(val);
//					l_input(val, buf);
//					if(mfcRec.m_PrVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					else									m_Fmt = VAL_FORMAT18;
//					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//// No.158072 add <--
//// 21/06/24_01 add -->
//					// データが存在したらフラグを立てる
//					DataUseCheck(mfcRec.m_PrVal, 7);
//// 21/06/24_01 add <--
//
//					//	9.事前確定届出給与
//// No.158072 del -->
////// No.158013 del -->
////					//memset(buf,0,128);
////					//memset(val,0,6);
////					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_BfVal);
////					//l_input(val, buf);
////					//if(mfcRec.m_BfVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////					//else									m_Fmt = VAL_FORMAT18;
////					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
////// No.158013 del <--
////// No.158013 add -->
////					memset(buf, 0, 128);
////					l_clear(val);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_BfVal);
////					l_input(val, buf);
////					if(bG_Kanso == TRUE)	{
////						dvl = _tstoi(mfcRec.m_BfVal);
////
////						memset(buf, 0, 128);
////						if(mfcRec.m_BfVal.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
////						else									l_print(buf, val, cFmt3);
////
////						cst.Empty();
////						cst.Format(_T("%s"), buf);
////						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
////					}
////					else	{
////						if(mfcRec.m_BfVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////						else									m_Fmt = VAL_FORMAT18;
////						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
////					}
////// No.158013 add <--
//// No.158072 del <--
//// No.158072 add -->
//					memset(buf, 0, 128);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_BfVal);
//					l_clear(val);
//					l_input(val, buf);
//					if(mfcRec.m_BfVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					else									m_Fmt = VAL_FORMAT18;
//					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//// No.158072 add <--
//// 21/06/24_01 add -->
//					// データが存在したらフラグを立てる
//					DataUseCheck(mfcRec.m_BfVal, 8);
//// 21/06/24_01 add <--
//
//					//	10.利益連動給与
//// No.158072 del -->
////// No.158013 del -->
////					//memset(buf,0,128);
////					//memset(val,0,6);
////					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_PfVal);
////					//l_input(val, buf);
////					//if(mfcRec.m_PfVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////					//else									m_Fmt = VAL_FORMAT18;
////					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
////// No.158013 del <--
////// No.158013 add -->
////					memset(buf, 0, 128);
////					l_clear(val);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_PfVal);
////					l_input(val, buf);
////					if(bG_Kanso == TRUE)	{
////						dvl = _tstoi(mfcRec.m_PfVal);
////
////						memset(buf, 0, 128);
////						if(mfcRec.m_PfVal.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
////						else									l_print(buf, val, cFmt4);
////						cst.Empty();
////						cst.Format(_T("%s"), buf);
////						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
////					}
////					else	{
////						if(mfcRec.m_PfVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////						else									m_Fmt = VAL_FORMAT18;
////						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
////					}
////// No.158013 add <--
//// No.158072 del <--
//// No.158072 add -->
//					memset(buf, 0, 128);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_PfVal);
//					l_clear(val);
//					l_input(val, buf);
//					if(mfcRec.m_PfVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					else									m_Fmt = VAL_FORMAT18;
//					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//// No.158072 add <--
//// 21/06/24_01 add -->
//					// データが存在したらフラグを立てる
//					DataUseCheck(mfcRec.m_PfVal, 9);
//// 21/06/24_01 add <--
//
//					//	11.その他
//// No.158072 del -->
////// No.158013 del -->
////					//memset(buf,0,128);
////					//memset(val,0,6);
////					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_EtVal);
////					//l_input(val, buf);
////					//if(mfcRec.m_EtVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////					//else									m_Fmt = VAL_FORMAT18;
////					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
////// No.158013 del <--
////// No.158013 add -->
////					memset(buf, 0, 128);
////					l_clear(val);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_EtVal);
////					l_input(val, buf);
////					if(bG_Kanso == TRUE)	{
////						dvl = _tstoi(mfcRec.m_EtVal);
////
////						memset(buf, 0, 128);
////						if(mfcRec.m_EtVal.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
////						else									l_print(buf, val, cFmt5);
////
////						cst.Empty();
////						cst.Format(_T("%s"), buf);
////						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
////					}
////					else	{
////						if(mfcRec.m_EtVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////						else									m_Fmt = VAL_FORMAT18;
////						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
////
////					}
////// No.158013 add <--
//// No.158072 del <--
//// No.158072 add -->
//					memset(buf, 0, 128);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_EtVal);
//					l_clear(val);
//					l_input(val, buf);
//					if(mfcRec.m_EtVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					else									m_Fmt = VAL_FORMAT18;
//					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//// No.158072 add <--
//// 21/06/24_01 add -->
//					// データが存在したらフラグを立てる
//					DataUseCheck(mfcRec.m_EtVal, 10);
//// 21/06/24_01 add <--
//
//					//	12.退職給与
//// No.158072 del -->
////// No.158013 del -->
////					//memset(buf,0,128);
////					//memset(val,0,6);
////					//strcpy_s(&buf[0], sizeof(buf), mfcRec.m_RtVal);
////					//l_input(val, buf);
////					//if(mfcRec.m_RtVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////					//else									m_Fmt = VAL_FORMAT18;
////					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
////// No.158013 del <--
////// No.158013 add -->
////					memset(buf, 0, 128);
////					l_clear(val);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_RtVal);
////					l_input(val, buf);
////					if(bG_Kanso == TRUE)	{
////						dvl = _tstoi(mfcRec.m_RtVal);
////
////						memset(buf, 0, 128);
////						if(mfcRec.m_RtVal.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
////						else									l_print(buf, val, cFmt6);
////
////						cst.Empty();
////						cst.Format(_T("%s"), buf);
////						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
////					}
////					else	{
////						if(mfcRec.m_RtVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
////						else									m_Fmt = VAL_FORMAT18;
////						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
////					}
////// No.158013 add <--
////// No.158072 del <--
//// No.158072 add -->
//					memset(buf, 0, 128);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_RtVal);
//					l_clear(val);
//					l_input(val, buf);
//					if(mfcRec.m_RtVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					else									m_Fmt = VAL_FORMAT18;
//					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
//// No.158072 add <--
//// 21/06/24_01 add -->
//					// データが存在したらフラグを立てる
//					DataUseCheck(mfcRec.m_RtVal, 11);
//// 21/06/24_01 add <--
//
//					//	13.役員給与計
//// No.158072 del -->
////// No.158013 del -->
//////					memset(buf,0,128);
//////					memset(val,0,6);
//////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//////					l_input(val, buf);
//////// midori 190301 del -->
//////					//if(mfcRec.m_Val.IsEmpty() == TRUE)		m_Fmt = _T("S");
//////					//else									m_Fmt = VAL_FORMAT18;
//////					//pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
//////// midori 190301 del <--
//////// midori 190301 add -->
//////					if(bG_Kanso == TRUE)	{
//////						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//////						else								m_Fmt = VAL_FORMAT26;
//////						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,10,ICS_EDS_RIGHT,TRUE));
//////					}
//////					else	{
//////						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//////						else								m_Fmt = VAL_FORMAT18;
//////						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,9,ICS_EDS_RIGHT,TRUE));
//////					}
//////// midori 190301 add <--
////// No.158013 del <--
////// No.158013 add -->
////					memset(buf, 0, 128);
////					l_clear(val);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(bG_Kanso == TRUE)	{
////						dvl = _tstoi(mfcRec.m_Val);
////
////						memset(buf, 0, 128);
////						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
////						else								l_print(buf, val, cFmt7);
////
////						cst.Empty();
////						cst.Format(_T("%s"), buf);
////						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
////					}
////					else	{
////						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////						else								m_Fmt = VAL_FORMAT18;
////						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 9, ICS_EDS_RIGHT, TRUE));
////					}
////// No.158013 add <--
//// No.158072 del <--
//// No.158072 add -->
//					memset(buf, 0, 128);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_clear(val);
//					l_input(val, buf);
//					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//					else	{
//						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT26;
//						else							m_Fmt = VAL_FORMAT18;
//					}
//					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
//// No.158072 add <--
//// 21/06/24_01 add -->
//					// データが存在したらフラグを立てる
//					DataUseCheck(mfcRec.m_Val, 12);
//// 21/06/24_01 add <--
// 改良No.23-0961 del <--
// 改良No.23-0961 add -->
					//	7.使用人職務分
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_EmVal);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_EmVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT26;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_EmVal, 6);

					//	8.定期同額給与
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_PrVal);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_PrVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT26;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_PrVal, 7);

					//	9.事前確定届出給与
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_BfVal);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_BfVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT26;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_BfVal, 8);

					//	10.利益連動給与
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_PfVal);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_PfVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT26;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_PfVal, 9);

					//	11.その他
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_EtVal);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_EtVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT26;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_EtVal, 10);

					//	12.退職給与
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_RtVal);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_RtVal.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else									m_Fmt = VAL_FORMAT26;
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 10, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_RtVal, 11);

					//	13.役員給与計
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT17;
						else							m_Fmt = VAL_FORMAT18;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 12);
// 改良No.23-0961 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}	
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

//	⑭ー２.人件費［様式142］
//	基本的には呼ばれないので何もしない。

//--------------------------------------------------
//	⑮ー１.地代家賃等［様式151］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki151Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst[2];
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc151Tidaiyatin		mfcRec(pDB);	//	uc_151_tidaiyatinテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 地代・家賃の区分
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 借地物件の用途
						if(m_SortSw[1] == 1)	sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 貸主の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 貸主の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 支払対象期間
						if(m_SortSw[1] == 1)	sort = _T("SpDate, SpDate2");
						else					sort = _T("SpDate DESC, SpDate2 DESC");
						break;
					case	6:	// 支払貸借料
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	7:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst[0] = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst[0] = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst[0]);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 地代・家賃の区分
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 借地物件の用途
						if(m_SortSw[1] == 1)	sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 貸主の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 貸主の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 支払対象期間
						if(m_SortSw[1] == 1)	sort = _T("SpDate, SpDate2");
						else					sort = _T("SpDate DESC, SpDate2 DESC");
						break;
					case	6:	// 支払貸借料
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	7:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 支払貸借料の最大桁数を調べる
//					cst[0].Empty();
//					cst[0].Format(_T("%s"), mfcRec.m_Val);
//					cst[0].Trim();
//					kk = cst[0].GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 支払貸借料の編集フォーマット作成
//				cst[0].Empty();
//				cst[0] = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst[0]);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.地代・家賃の区分
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.借地物件の用途
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Youto);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Ad2Add1 + mfcRec.m_Ad2Add2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.貸主の名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.貸主の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	6.支払対象期間
					memset(buf,0,128);
					cst[0].Empty();
					cst[1].Empty();
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
// midori 200101 del -->
						//cst[0].Format(_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							cst[0].Format(_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
						else {
							cst[0].Format(_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
// midori 200101 add <--
					}
					if(mfcRec.m_SpDate2 > 0)	{
						clsDate.Convert(mfcRec.m_SpDate2);
// midori 200101 del -->
						//cst[1].Format(_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							cst[1].Format(_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
						else {
							cst[1].Format(_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
// midori 200101 add <--
					}
// midori 200101 del -->
					//sprintf_s(buf,_T("%8s～%8s"), cst[0], cst[1]);
// midori 200101 del <--
// midori 200101 add -->
					if(bG_Kanso == TRUE) {
						sprintf_s(buf,_T("%12s～%12s"), cst[0], cst[1]);
					}
					else {
						sprintf_s(buf,_T("%8s～%8s"), cst[0], cst[1]);
					}
// midori 200101 add <--
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ZENKAKU|ICS_EDS_ASCII),FALSE,TRUE,18,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);
// 21/06/24_01 add <--

					//	7.支払貸借料
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf,0,128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst[0].Empty();
//						cst[0].Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst[0]));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
						else					m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 6);
// 21/06/24_01 add <--

					//	8.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 7);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑮ー１.地代家賃等［様式151］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki151IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst[2];
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc151Tidaiyatin		mfcRec(pDB);	//	uc_151_tidaiyatinテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 地代・家賃の区分
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 借地物件の用途
						if(m_SortSw[1] == 1)	sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	4:	// 貸主の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 貸主の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	6:	// 支払対象期間
						if(m_SortSw[1] == 1)	sort = _T("SpDate, SpDate2");
						else					sort = _T("SpDate DESC, SpDate2 DESC");
						break;
					case	7:	// 支払貸借料
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	8:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst[0] = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst[0] = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst[0]);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 地代・家賃の区分
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 借地物件の用途
						if(m_SortSw[1] == 1)	sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Youto COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Ad2Add1 COLLATE Japanese_CS_AS_KS_WS DESC, Ad2Add2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	4:	// 貸主の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 貸主の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	6:	// 支払対象期間
						if(m_SortSw[1] == 1)	sort = _T("SpDate, SpDate2");
						else					sort = _T("SpDate DESC, SpDate2 DESC");
						break;
					case	7:	// 支払貸借料
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	8:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.地代・家賃の区分
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.借地物件の用途
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Youto);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Ad2Add1 + mfcRec.m_Ad2Add2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.貸主の名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);

					//	6.貸主の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);

					//	7.支払対象期間
					memset(buf,0,128);
					cst[0].Empty();
					cst[1].Empty();
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
						cst[0].Format(_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					}
					if(mfcRec.m_SpDate2 > 0)	{
						clsDate.Convert(mfcRec.m_SpDate2);
						cst[1].Format(_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					}
					sprintf_s(buf,_T("%12s～%12s"), cst[0], cst[1]);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ZENKAKU|ICS_EDS_ASCII),FALSE,TRUE,25,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);

					//	8.支払貸借料
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 7);

					//	9.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 8);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑮ー２.権利金等の期中支払［様式152］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki152Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc152Kenrikin		mfcRec(pDB);	//	uc_152_kenrikinテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 支払先の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 支払先の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 支払年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	3:	// 支払金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	4:	// 権利金等の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 支払先の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 支払先の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 支払年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	3:	// 支払金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	4:	// 権利金等の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 支払金額の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 支払金額の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.支払先の名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.支払先の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.支払年月日
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
// midori 200101 del -->
						//sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
						else {
							sprintf_s(buf,_T("%s.%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
						}
// midori 200101 add <--
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,8,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.支払金額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 3);
// 21/06/24_01 add <--

					//	5.権利金等の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	6.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑮ー２.権利金等の期中支払［様式152］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki152IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst=_T("");
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc152Kenrikin		mfcRec(pDB);	//	uc_152_kenrikinテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	1:	// 支払先の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 支払先の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 支払年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	4:	// 支払金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 権利金等の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if( ret != 0 ){
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	1:	// 支払先の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 支払先の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 支払年月日
						if(m_SortSw[1] == 1)	sort = _T("SpDate");
						else					sort = _T("SpDate DESC");
						break;
					case	4:	// 支払金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 権利金等の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.支払先の名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.支払先の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.支払年月日
					memset(buf,0,128);
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
						sprintf_s(buf,_T("%s%s.%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth, clsDate.m_szDay);
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ASCII),FALSE,TRUE,8,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.支払金額
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);

					//	6.権利金等の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);

					//	7.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑮ー３.工業所有権等の使用料［様式153］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki153Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst[2];
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc153Kougyou			mfcRec( pDB );	//	uc_153_kougyouテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch( nType ){
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 名称
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 支払先の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 支払先の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 契約期間
						if(m_SortSw[1] == 1)	sort = _T("KyDate, KyDate2");
						else					sort = _T("KyDate DESC, KyDate2 DESC");
						break;
					case	4:	// 支払対象期間
						if(m_SortSw[1] == 1)	sort = _T("SpDate, SpDate2");
						else					sort = _T("SpDate DESC, SpDate2 DESC");
						break;
					case	5:	// 支払金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst[0] = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst[0] = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst[0]);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 名称
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 支払先の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 支払先の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 契約期間
						if(m_SortSw[1] == 1)	sort = _T("KyDate, KyDate2");
						else					sort = _T("KyDate DESC, KyDate2 DESC");
						break;
					case	4:	// 支払対象期間
						if(m_SortSw[1] == 1)	sort = _T("SpDate, SpDate2");
						else					sort = _T("SpDate DESC, SpDate2 DESC");
						break;
					case	5:	// 支払金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	6:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 支払金額の最大桁数を調べる
//					cst[0].Empty();
//					cst[0].Format(_T("%s"), mfcRec.m_Val);
//					cst[0].Trim();
//					kk = cst[0].GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 支払金額の編集フォーマット作成
//				cst[0].Empty();
//				cst[0] = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst[0]);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_HdName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.支払先の名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.支払先の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.契約期間
					cst[0].Empty();
					cst[1].Empty();
					if(mfcRec.m_KyDate > 0)	{
						clsDate.Convert(mfcRec.m_KyDate);
						cst[0].Format(_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
					}
					if(mfcRec.m_KyDate2 > 0)	{
						clsDate.Convert(mfcRec.m_KyDate2);
						cst[1].Format(_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
					}
					sprintf_s(buf,_T("%9s～%9s"), cst[0], cst[1]);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ZENKAKU|ICS_EDS_ASCII),FALSE,TRUE,20,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.支払対象期間
					cst[0].Empty();
					cst[1].Empty();
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
// midori 200101 del -->
						//cst[0].Format(_T("%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							cst[0].Format(_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
						}
						else {
							cst[0].Format(_T("%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth);
						}
// midori 200101 add <--
					}
					if(mfcRec.m_SpDate2 > 0)	{
						clsDate.Convert(mfcRec.m_SpDate2);
// midori 200101 del -->
						//cst[1].Format(_T("%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth);
// midori 200101 del <--
// midori 200101 add -->
						if(bG_Kanso == TRUE) {
							cst[1].Format(_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
						}
						else {
							cst[1].Format(_T("%s.%s"), clsDate.m_szWareki, clsDate.m_szMonth);
						}
// midori 200101 add <--
					}
// midori 200101 del -->
					//sprintf_s(buf,_T("%5s～%5s"), cst[0], cst[1]);
// midori 200101 del <--
// midori 200101 add -->
					if(bG_Kanso == TRUE) {
						sprintf_s(buf,_T("%9s～%9s"), cst[0], cst[1]);
					}
					else {
						sprintf_s(buf,_T("%5s～%5s"), cst[0], cst[1]);
					}
// midori 200101 add <--
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ZENKAKU|ICS_EDS_ASCII),FALSE,TRUE,12,ICS_EDS_CENTER));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	6.支払金額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst[0].Empty();
//						cst[0].Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst[0]));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 5);
// 21/06/24_01 add <--

					//	7.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 6);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑮ー３.工業所有権等の使用料［様式153］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki153IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst[2];
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc153Kougyou			mfcRec( pDB );	//	uc_153_kougyouテーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch( nType ){
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 名称
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 支払先の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 支払先の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 契約期間
						if(m_SortSw[1] == 1)	sort = _T("KyDate, KyDate2");
						else					sort = _T("KyDate DESC, KyDate2 DESC");
						break;
					case	5:	// 支払対象期間
						if(m_SortSw[1] == 1)	sort = _T("SpDate, SpDate2");
						else					sort = _T("SpDate DESC, SpDate2 DESC");
						break;
					case	6:	// 支払金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	7:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst[0] = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst[0] = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst[0]);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 名称
						if(m_SortSw[1] == 1)	sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("HdName COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 支払先の名称
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 支払先の所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 契約期間
						if(m_SortSw[1] == 1)	sort = _T("KyDate, KyDate2");
						else					sort = _T("KyDate DESC, KyDate2 DESC");
						break;
					case	5:	// 支払対象期間
						if(m_SortSw[1] == 1)	sort = _T("SpDate, SpDate2");
						else					sort = _T("SpDate DESC, SpDate2 DESC");
						break;
					case	6:	// 支払金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	7:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_HdName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.支払先の名称
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.支払先の所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.契約期間
					cst[0].Empty();
					cst[1].Empty();
					if(mfcRec.m_KyDate > 0)	{
						clsDate.Convert(mfcRec.m_KyDate);
						cst[0].Format(_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
					}
					if(mfcRec.m_KyDate2 > 0)	{
						clsDate.Convert(mfcRec.m_KyDate2);
						cst[1].Format(_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
					}
					sprintf_s(buf,_T("%9s～%9s"), cst[0], cst[1]);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ZENKAKU|ICS_EDS_ASCII),FALSE,TRUE,20,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);

					//	6.支払対象期間
					cst[0].Empty();
					cst[1].Empty();
					if(mfcRec.m_SpDate > 0)	{
						clsDate.Convert(mfcRec.m_SpDate);
						cst[0].Format(_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
					}
					if(mfcRec.m_SpDate2 > 0)	{
						clsDate.Convert(mfcRec.m_SpDate2);
						cst[1].Format(_T("%s%s.%s"), clsDate.m_szGengou, clsDate.m_szWareki, clsDate.m_szMonth);
					}
					sprintf_s(buf,_T("%9s～%9s"), cst[0], cst[1]);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf,(ICS_EDS_NUMERIC|ICS_EDS_ZENKAKU|ICS_EDS_ASCII),FALSE,TRUE,12,ICS_EDS_CENTER));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);

					//	7.支払金額
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 6);

					//	8.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 7);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑯ー１.雑役［様式161］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki161Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc161Zatueki			mfcRec(pDB);	//	uc_061_zatuekiテーブルクラス

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 相手先
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	3:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 相手先
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	3:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 金額の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 金額の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.取引の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.相手先
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.金額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑯ー１.雑役［様式161］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki161IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst=_T("");
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc161Zatueki			mfcRec(pDB);	//	uc_061_zatuekiテーブルクラス

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			//if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	3:	// 相手先
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	4:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	3:	// 相手先
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	4:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ) )	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.取引の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.相手先
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);

					//	6.金額
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 5);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑯ー２.雑損失［様式162］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki162Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc162Zatuson			mfcRec(pDB);	//	uc_062_zatusonテーブルクラス

// 210609 add -->
	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();
// 210609 add <--

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 相手先
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	3:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 相手先
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("AdName1, AdName2");
						//else					sort = _T("AdName1 DESC, AdName2 DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
// No.158071 add <--
						break;
					case	3:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 金額の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 金額の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.取引の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.相手先
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	5.金額
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT10;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT10;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑯ー２.雑損失［様式162］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki162IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst=_T("");
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc162Zatuson			mfcRec(pDB);	//	uc_062_zatusonテーブルクラス

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	3:	// 相手先
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	4:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 取引の内容
						if(m_SortSw[1] == 1)	sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Naiyou COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	3:	// 相手先
						if(m_SortSw[1] == 1)	sort = _T("AdKana");
						else					sort = _T("AdKana DESC");
						break;
					case	4:	// 所在地
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	5:	// 金額
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.取引の内容
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_Naiyou);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.相手先
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.所在地
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);

					//	6.金額
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT10;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 12, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 5);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑰.その他科目の内訳書①［様式171］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki171Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;					//	行管理用(戻値)
	int						nCnt=0;						//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158072 del -->
//// No.158013 add -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc171Sonota1			mfcRec(pDB, m_nFormSeq);	//	uc_171_sonota1テーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ));
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 相手先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	4:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 相手先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	4:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 期末現在高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord = m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.相手先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.相手先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);
// 21/06/24_01 add <--

					//	4.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 3);
// 21/06/24_01 add <--

					//	5.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 4);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// インボイス登録番号追加対応_23/11/06 add -->
//--------------------------------------------------
//	⑰.その他科目の内訳書①［様式171］データ設定（インボイス登録番号（法人番号）版）
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki171IData(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;					//	行管理用(戻値)
	int						nCnt=0;						//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
	CString					sort="";
	CString					cst=_T("");
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc171Sonota1			mfcRec(pDB, m_nFormSeq);	//	uc_171_sonota1テーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch(nType)	{
		case ID_FGSHOW_HOKAN:		//	一時保管
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 相手先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
			if(m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
						break;
					case	1:	// 登録番号
						if(m_SortSw[1] == 1)	sort = _T("Invno");
						else					sort = _T("Invno DESC");
						break;
					case	2:	// 相手先（名称）
						if(m_SortSw[1] == 1)	sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS, AdName2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdName1 COLLATE Japanese_CS_AS_KS_WS DESC, AdName2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	3:	// 相手先（所在地）
						if(m_SortSw[1] == 1)	sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS, AdAdd2 COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("AdAdd1 COLLATE Japanese_CS_AS_KS_WS DESC, AdAdd2 COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	4:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	5:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}

		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() )	{
					pRecord = m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);

					//	2.登録番号
					memset(buf,0,128);
					sprintf_s(buf, _T("%s"), mfcRec.m_InvNo);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);

					//	3.相手先（名称）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdName1 + mfcRec.m_AdName2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 2);

					//	4.相手先（所在地）
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_AdAdd1 + mfcRec.m_AdAdd2);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);

					//	5.期末現在高
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						m_Fmt = VAL_FORMAT27;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 13, ICS_EDS_RIGHT, TRUE));
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 4);

					//	6.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"), mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 5);

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if( mfcRec.IsOpen() )	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}
// インボイス登録番号追加対応_23/11/06 add <--

//--------------------------------------------------
//	⑱.その他科目の内訳書②［様式181］データ設定
//--------------------------------------------------
//	【引数】	pDB			…	データベースハンドル
//				nType		…	種別
//				nColumnMax	…	カラム最大数
//	【戻値】	行数
//--------------------------------------------------
int CdlgDisplay2::SetYoushiki181Data(CDatabase* pDB, EnumIdFgShow nType, int nColumnMax)
{
	int						defn=0;
	int						nLine=0;		//	行管理用(戻値)
	int						nCnt=0;			//	カウント用
	int						nRet=0;
	int						ret=0;
	char					buf[128];
	char					val[6];
// No.158013 add -->
// No.158072 del -->
//	int						kk=0,kt=0;
//	char					cFmt1[32];
//	double					dvl=0;
// No.158072 del <--
// No.158072 add -->
	CString					sort="";
// No.158072 add <--
	CString					cst=_T("");
// No.158013 add <--
	ICSReportRecordItem		*pItem;
	ICSReportRecord			*pRecord;
	CdbUc181Sonota2			mfcRec(pDB, m_nFormSeq);	//	uc_181_sonota2テーブルクラス
	CdateConvert			clsDate;

	defn = l_retn();
	l_defn(0x16);

	m_HideMap.RemoveAll();

	// レポートをクリア
	m_RepDisplay.RemoveAllRecords();

	try{
		//	種別で分岐
		switch( nType ){
		case ID_FGSHOW_HOKAN:		//	一時保管
// No.158072 del -->
			//ret = mfcRec.Open( AFX_DB_USE_DEFAULT_TYPE, mfcRec.GetSQLHokan( m_nFormSeq ) );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 項目
						if(m_SortSw[1] == 1)	sort = _T("Item COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Item COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	3:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", OrderNum");
				else					sort = sort + _T(", OrderNum DESC");

				cst = mfcRec.GetSQLHokanSort(m_nFormSeq, sort);
			}
			else	{
				cst = mfcRec.GetSQLHokan(m_nFormSeq);
			}
			ret = mfcRec.Open(AFX_DB_USE_DEFAULT_TYPE, cst);
// No.158072 add <--
			if(ret != 0)	{
				nRet = DB_ERR_OK;
			}
			break;

		case ID_FGSHOW_IKKATU:		//	一括金額
// No.158072 del -->
			//nRet = mfcRec.RequeryFgShowIkkatu( m_nNumGroup );
// No.158072 del <--
// No.158072 add -->
			if(bG_Kanso == TRUE && m_SortSw[0] != -1)	{
				switch(m_SortSw[0])	{
					case	0:	// 科目
// No.158071 del -->
						//if(m_SortSw[1] == 1)	sort = _T("KnName");
						//else					sort = _T("KnName DESC");
// No.158071 del <--
// No.158071 add -->
						if(m_SortSw[1] == 1)	sort = _T("KnKana");
						else					sort = _T("KnKana DESC");
// No.158071 add <--
						break;
					case	1:	// 項目
						if(m_SortSw[1] == 1)	sort = _T("Item COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Item COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
					case	2:	// 期末現在高
						if(m_SortSw[1] == 1)	sort = _T("Val");
						else					sort = _T("Val DESC");
						break;
					case	3:	// 摘要
						if(m_SortSw[1] == 1)	sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS");
						else					sort = _T("Teki COLLATE Japanese_CS_AS_KS_WS DESC");
						break;
				}
				if(m_SortSw[1] == 1)	sort = sort + _T(", Seq");
				else					sort = sort + _T(", Seq DESC");

				nRet = mfcRec.RequeryFgShowIkkatuSort(m_nNumGroup, sort);
			}
			else	{
				nRet = mfcRec.RequeryFgShowIkkatu(m_nNumGroup);
			}
// No.158072 add <--
			break;

		default:					//	デフォルト
			nRet = mfcRec.RequeryFgShowZero();
			break;
		}
		
		//	初期化成功？
		if(nRet == DB_ERR_OK)	{
			//	レコードあり？
			if( !( mfcRec.IsEOF() ))	{
// No.158072 del -->
//// No.158013 add -->
//				// レコードを先頭に移動
//				mfcRec.MoveFirst();
//
//				kt = 0;
//				// 終端までループ
//				while(!mfcRec.IsEOF())	{
//					// 期末現在高の最大桁数を調べる
//					cst.Empty();
//					cst.Format(_T("%s"), mfcRec.m_Val);
//					cst.Trim();
//					kk = cst.GetLength();
//
//					if(kt < kk)	{
//						kt = kk;
//					}
//
//					// 次のレコードに移動
//					mfcRec.MoveNext();
//				}
//
//				// 期末現在高の編集フォーマット作成
//				cst.Empty();
//				cst = MakeFormatNum(kt);
//				memset(cFmt1, 0, sizeof(cFmt1));
//				lstrcpy(cFmt1, cst);
//// No.158013 add <--
// No.158072 del <--

				//	レコードを先頭に移動
				mfcRec.MoveFirst();

				//	終端までループ
				while( !mfcRec.IsEOF() ){
					pRecord	= m_RepDisplay.AddRecord(new ICSReportRecord());	//	新規行追加

					//	1.科目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_KnName);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 0);
// 21/06/24_01 add <--

					//	2.項目
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_Item);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 1);
// 21/06/24_01 add <--

					//	3.期末現在高
// No.158072 del -->
//// No.158013 del -->
////					memset(buf,0,128);
////					memset(val,0,6);
////					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
////					l_input(val, buf);
////					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
////// No.200903 del -->
////					//else								m_Fmt = VAL_FORMAT17;
////// No.200903 del <--
////// No.200903 add -->
////					else	{
////						if(bG_Kanso == TRUE)	m_Fmt = VAL_FORMAT27;
////						else					m_Fmt = VAL_FORMAT17;
////					}
////// No.200903 add <--
////					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val,m_Fmt,TRUE,TRUE,11,ICS_EDS_RIGHT,TRUE));
//// No.158013 del <--
//// No.158013 add -->
//					memset(buf, 0, 128);
//					l_clear(val);
//					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
//					l_input(val, buf);
//					if(bG_Kanso == TRUE)	{
//						dvl = _tstoi(mfcRec.m_Val);
//
//						memset(buf, 0, 128);
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	l_print(buf, val, _T("S"));
//						else								l_print(buf, val, cFmt1);
//
//						cst.Empty();
//						cst.Format(_T("%s"), buf);
//						pItem = pRecord->AddItem(new ICSReportRecordItemNumber(dvl, cst));
//					}
//					else	{
//						if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
//						else								m_Fmt = VAL_FORMAT17;
//						pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
//					}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
					memset(buf, 0, 128);
					strcpy_s(&buf[0], sizeof(buf), mfcRec.m_Val);
					l_clear(val);
					l_input(val, buf);
					if(mfcRec.m_Val.IsEmpty() == TRUE)	m_Fmt = _T("S");
					else	{
						if(bG_Kanso == TRUE)			m_Fmt = VAL_FORMAT27;
						else							m_Fmt = VAL_FORMAT17;
					}
					pItem = pRecord->AddItem(new ICSReportRecordItemArith(val, m_Fmt, FALSE, FALSE, 11, ICS_EDS_RIGHT, TRUE));
// No.158072 add <--
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(mfcRec.m_Val, 2);
// 21/06/24_01 add <--

					//	4.摘要
					memset(buf,0,128);
					sprintf_s(buf,_T("%s"),mfcRec.m_Teki);
					pItem = pRecord->AddItem(new ICSReportRecordItemText(buf));
// 21/06/24_01 add -->
					// データが存在したらフラグを立てる
					DataUseCheck(buf, 3);
// 21/06/24_01 add <--

					//	セットした情報でレポートを描画する
					m_RepDisplay.Populate();

					memset(&m_HideDat,0,sizeof(HIDE_DATA));
					m_HideDat.hd_1 = mfcRec.m_Seq;	// 非表示データにシーケンス番号設定
					m_HideMap.SetAt(nLine,m_HideDat);

					//	次のレコードに移動
					mfcRec.MoveNext();

					//	行をインクリメント
					nLine++;
				}
			}
			//	レコード閉じる
			mfcRec.Fin();
		}
		// 全て編集不可
		m_RepDisplay.AllowEdit(FALSE);

		// 行の高さ
		m_RepDisplay.SetItemHeight(20);
	}
	catch(...)	{
		//	レコード開いてる？
		if(mfcRec.IsOpen())	{
			//	レコード閉じる
			mfcRec.Fin();
		}
	}

	l_defn(defn);

	//	行数を返す
	return(nLine);
}

// 21/06/24_01 add -->
//--------------------------------------------------
//	データが存在したらフラグを立てる
//--------------------------------------------------
BOOL CdlgDisplay2::DataUseCheck(LPCTSTR psText, int pindex)
{
	CString			cst=_T("");

	if(bG_Kanso == TRUE) {
		cst.Format(_T("%s"), psText);
		cst.TrimLeft();
		cst.TrimRight();

		if(cst.IsEmpty() == FALSE) {
			m_DtUse[pindex] = 1;
		}
	}
	else	{
		// 簡素化以前は常にフラグON＝データがある
		m_DtUse[pindex] = 1;
	}

	return(TRUE);
}
// 21/06/24_01 add <--

//--------------------------------------------------
//--------------------------------------------------
BOOL CdlgDisplay2::PreTranslateMessage(MSG* pMsg)
{
	int			sw=0;
	int			nID=0;
	int			nIndex=0;
// No.158072 add -->
	int			clm=0;
	POINT		pt;
	RECT		rt;
// No.158072 add <--
	CWnd*		pControl = NULL;	//	コントロール

	sw = 0;
	//	フォーカスのあるコントロールのID取得
	pControl = this->GetFocus();
	if(pControl != NULL)	{
		nID = pControl->GetDlgCtrlID();
	}

	//	キーダウンメッセージ？
	if( pMsg->message == WM_KEYDOWN )	{
		//	パラメータで分岐
		switch( pMsg->wParam )	{
			case VK_F2:				//	F2
				keybd_event(VK_SHIFT, 0, 0, 0);					//	Shiftキー押している
				keybd_event(VK_TAB, 0, 0, 0);					//	Tabキー押している
				keybd_event(VK_TAB, 0, KEYEVENTF_KEYUP, 0);		//	Tabキー放した（※放さないと押っぱなしになる）
				keybd_event(VK_SHIFT, 0, KEYEVENTF_KEYUP, 0);	//	Shiftキー放した（※放さないと押っぱなしになる）
				sw = 1;
				break;

			case VK_ESCAPE:			//	Esc
				//	レポートにフォーカスあり？
				if(m_RepDisplay.HasFocus() == TRUE)	{
					//	OnCancel起動
					PostMessage( WM_COMMAND, IDCANCEL );
					sw = 1;
				}
				break;

			case VK_RETURN:			//	Enter
			case VK_SPACE:			//	スペース
			case VK_TAB:
				// レポートコントロールにフォーカスがある場合
				if(m_clsFunc.GetFocusControlID(this) == IDC_DISPLAY_REPORT)	{
					UpdateStateFromKey((int)pMsg->wParam);
					sw=1;
				}
				break;
		}
	}
// No.158072 add -->
	// マウス左クリック
	else if(pMsg->message == WM_LBUTTONDOWN)	{
		// 現在のカーソルポジションを取得する
		//POINT			pt;
		GetCursorPos(&pt);
		ScreenToClient(&pt);
		// レポートコントロール内でクリックされたかを調べる
		//RECT			rt;
		m_RepDisplay.GetWindowRect(&rt);
		ScreenToClient(&rt);

		if( pt.x >= rt.left && pt.x <= rt.right &&
			pt.y >= rt.top && pt.y <= rt.bottom)	{
			// ヘッダーが選択されたかどうかを取得
			// -1:データ部をクリックした　-1以外:クリックされたヘッダー項目のインデックス
			clm = GetHeadClm(CPoint(GET_X_LPARAM(pMsg->lParam), GET_Y_LPARAM(pMsg->lParam)));
			if(clm >= 0)	{
				MSign = 1;	// Messageサインを立てる
			}
		}
	}
	else if(pMsg->message == WM_LBUTTONDBLCLK)	{
		MSign = 0;	// Messageサインを戻す
	}
	// マウス左クリックが放された
	else if(pMsg->message == WM_LBUTTONUP)	{
		// 現在のカーソルポジションを取得する
		//POINT			pt;
		GetCursorPos(&pt);
		ScreenToClient(&pt);
		// レポートコントロール内でクリックされたかを調べる
		//RECT			rt;
		m_RepDisplay.GetWindowRect(&rt);
		ScreenToClient(&rt);

		if( pt.x >= rt.left && pt.x <= rt.right &&
			pt.y >= rt.top && pt.y <= rt.bottom)	{
			// ヘッダーが選択されたかどうかを取得
			// -1:データ部をクリックした　-1以外:クリックされたヘッダー項目のインデックス
			clm = GetHeadClm(CPoint(GET_X_LPARAM(pMsg->lParam), GET_Y_LPARAM(pMsg->lParam)));
			if(clm >= 0 && MSign == 1)	{
				PostMessage(WM_USER_REPORT_SORT, clm, 0);

				MSign = 0;	// Messageサインを戻す
			}
		}
	}

// No.158072 add <--

	if(sw == 1)		return(1);

	return ICSDialog::PreTranslateMessage(pMsg);
}

// No.158072 add -->
int CdlgDisplay2::GetHeadClm(CPoint point)
{
	ICSReportHeader* hedder = m_RepDisplay.GetReportHeader();
	ICSReportColumn* clm = hedder->HitTest( point );

	int clmidx = -1;

	if( clm )	{
		clmidx = clm->GetIndex();
	}

	return(clmidx);
}
// No.158072 add <--

//--------------------------------------------------
//	レポートコントロールにフォーカスがある場合に
//	Space,Tab,Enterキーが押下された場合の動作
//--------------------------------------------------
void CdlgDisplay2::UpdateStateFromKey(int key)
{
	ICSReportSelectedRows*	s_rows;
	ICSReportRow*			r_row;
	int						indexRow=0;
	char					cShift=0;

	s_rows = m_RepDisplay.GetSelectedRows();
	if(s_rows == NULL)	return;

	r_row = s_rows->GetAt(0);
	if(r_row == NULL)	return;

	switch(key){
		case VK_SPACE:
			PostMessage(WM_USER_RCCLICK,0,0);
			break;
		case VK_RETURN:
			m_RepDisplay.MoveDown(FALSE,FALSE);
			break;
		case VK_TAB:
			cShift = (char)GetKeyState(VK_SHIFT);	// SHIFTキー状態取得
			//	SHIFTキーが押されてる？
			if(cShift & 0x80)	PrevDlgCtrl();
			else				NextDlgCtrl();
			break;
	}
}

//--------------------------------------------------
//--------------------------------------------------
LRESULT CdlgDisplay2::OnUserRcclick( WPARAM wParam, LPARAM lParam )
{
	ICSReportSelectedRows*	s_rows;
	ICSReportRow*			r_row;
	int						indexRow=0;
	int						sel=0;		// 選択値
	COLORREF				color;		// 背景色
// No.200603 add -->
	int						sidxRow=-1;
	ICSReportRecord*		pRecord;
// No.200603 add <--

	s_rows = m_RepDisplay.GetSelectedRows();
	if(s_rows != NULL)	{
		r_row = s_rows->GetAt(0);
		if(r_row != NULL)	{
			indexRow = r_row->GetIndex();
// No.200603 del -->
			//m_HideMap.Lookup(indexRow,m_HideDat);
// No.200603 del <--
// No.200603 add -->
			// ソートしている時、本体の行番号を取得
			pRecord = m_RepDisplay.GetSortedRecord(indexRow);
			sidxRow = pRecord->GetIndex();

			m_HideMap.Lookup(sidxRow, m_HideDat);
// No.200603 add <--
			// 選択オフ？
			if(m_HideDat.hd_0 == 0)	{
				// 選択オンに変更
				m_HideDat.hd_0 = 1;
				color = m_SelectColor;
			}
			else	{
				// 選択オフに変更
				m_HideDat.hd_0 = 0;
				color = m_ViewColor;
			}
// No.200603 del -->
			//// 選択データを設定
			//m_HideMap.SetAt(indexRow,m_HideDat);
			//// 色を設定
			//m_RepDisplay.SetRowBackColor(indexRow,color,TRUE);
// No.200603 del <--
// No.200603 add -->
			// 選択データを設定
			m_HideMap.SetAt(sidxRow, m_HideDat);
			// 色を設定
			m_RepDisplay.SetRowBackColor(sidxRow, color, TRUE);
// No.200603 add <--
		}
	}
	return(0);
}

//--------------------------------------------------
//--------------------------------------------------
LRESULT CdlgDisplay2::OnUserFocusset( WPARAM wParam, LPARAM lParam )
{
	ICSReportSelectedRows*	s_rows;
	ICSReportRow*			r_row;
	int						indexRow=0;
	COLORREF				color;		// 背景色
// No.200603 add -->
	int						sidxRow=-1;
	ICSReportRecord*		pRecord;
// No.200603 add <--

	s_rows = m_RepDisplay.GetSelectedRows();
	if(s_rows != NULL)	{
		r_row = s_rows->GetAt(0);
		if(r_row != NULL)	{
			indexRow = r_row->GetIndex();
// No.200603 del -->
			//m_HideMap.Lookup(indexRow,m_HideDat);
// No.200603 del <--
// No.200603 add -->
			// ソートしている時、本体の行番号を取得
			pRecord = m_RepDisplay.GetSortedRecord(indexRow);
			sidxRow = pRecord->GetIndex();

			m_HideMap.Lookup(sidxRow, m_HideDat);
// No.200603 add <--
			// 選択オフ？
			if(m_HideDat.hd_0 == 0)	{
				// 背景色を選択オフにする
				color = m_ViewColor;
			}
			else	{
				// 背景色を選択オンにする
				color = m_SelectColor;
			}
			// 色を設定
			m_RepDisplay.ColorInactive(color);
		}
	}
	return(0);
}

//--------------------------------------------------
//	レポートコントロール内でマウス左ボタンがクリックされた時
//--------------------------------------------------
void CdlgDisplay2::OnNMReportLbuttondownDISPLAY_REPORT(NMHDR * pNotifyStruct, LRESULT * result)
{
	PostMessage(WM_USER_RCCLICK,0,0);
}

//--------------------------------------------------
//	戻すボタン	SetFocusイベント
//	(※レポートコントロールのKillFocusが発生しないため、レポート以外のSetFocusで処理を行う)
//--------------------------------------------------
void CdlgDisplay2::OnBnSetfocusOkButton()
{
	PostMessage(WM_USER_FOCUSSET,0,0);
}

//--------------------------------------------------
//	削除ボタン	SetFocusイベント
//	(※レポートコントロールのKillFocusが発生しないため、レポート以外のSetFocusで処理を行う)
//--------------------------------------------------
void CdlgDisplay2::OnBnSetfocusDeleteButton()
{
	PostMessage(WM_USER_FOCUSSET,0,0);
}

//--------------------------------------------------
//	閉じるボタン	SetFocusイベント
//	(※レポートコントロールのKillFocusが発生しないため、レポート以外のSetFocusで処理を行う)
//--------------------------------------------------
void CdlgDisplay2::OnBnSetfocusCancelButton()
{
	PostMessage(WM_USER_FOCUSSET,0,0);
}

//--------------------------------------------------
//	全選択ボタン	SetFocusイベント
//	(※レポートコントロールのKillFocusが発生しないため、レポート以外のSetFocusで処理を行う)
//--------------------------------------------------
void CdlgDisplay2::OnBnSetfocusAllButtonOn()
{
	PostMessage(WM_USER_FOCUSSET,0,0);
}

//--------------------------------------------------
//	全解除ボタン	SetFocusイベント
//	(※レポートコントロールのKillFocusが発生しないため、レポート以外のSetFocusで処理を行う)
//--------------------------------------------------
void CdlgDisplay2::OnBnSetfocusAllButtonOff()
{
	PostMessage(WM_USER_FOCUSSET,0,0);
}

//--------------------------------------------------
//	戻すボタン	クリックイベント
//--------------------------------------------------
void CdlgDisplay2::OnBnClickedOkButton()
{
	//	選択アイテムなし？
	if(CheckSelectItem() == 0)	{
		ICSMessageBox( _T("リストが１件も選択されていません。"), MB_OK, 0, 0, this );
		return;
	}

	//	転記確認でキャンセル？
	if(ICSMessageBox( _T("選択データを転記します。"), MB_OKCANCEL, 0, 0, this ) == IDCANCEL)	{
		//	抜ける
		return;
	}

	//	リストアイテムをチェック
	if(CheckListItam() != 0)	{
		m_nRet = ID_DLG_BACK;	//	戻値を戻すに設定
	}

	ICSDialog::OnOK();
}

//--------------------------------------------------
//	削除ボタン	クリックイベント
//--------------------------------------------------
void CdlgDisplay2::OnBnClickedDeleteButton()
{
	//	選択アイテムなし？
	if(CheckSelectItem() == 0)	{
		ICSMessageBox( _T("リストが１件も選択されていません。"), MB_OK, 0, 0, this );
		return;
	}

	//	削除確認でキャンセル？
	if(ICSMessageBox( _T("選択データを削除します。"), MB_OKCANCEL | MB_DEFBUTTON2, 0, 0, this ) == IDCANCEL ){
		//	抜ける
		return;
	}

	//	リストアイテムをチェック
	if(CheckListItam(TRUE) != 0)	{
		// レポートを再表示
		InitReportData(m_nFormSeq, m_pDB, m_nType);
	}
}

//--------------------------------------------------
//	全選択ボタン	クリックイベント
//--------------------------------------------------
void CdlgDisplay2::OnBnClickedAllButtonOn()
{
	int				cur=0,max=0;
	ICSReportRows	*rrs=m_RepDisplay.GetRows();
	COLORREF		color=m_SelectColor;

	if(rrs != NULL)	{
		max = rrs->GetCount();
		for(cur=0; cur<max; cur++)	{
			m_HideMap.Lookup(cur,m_HideDat);
			if(m_HideDat.hd_0 == 0)	{
				m_HideDat.hd_0 = 1;
				m_HideMap.SetAt(cur,m_HideDat);
				m_RepDisplay.SetRowBackColor(cur,color,TRUE);
			}
		}
		// インバース表示されている行は下記関数で変更
		m_RepDisplay.ColorInactive(color);
	}
}

//--------------------------------------------------
//	全解除ボタン	クリックイベント
//--------------------------------------------------
void CdlgDisplay2::OnBnClickedAllButtonOff()
{
	int				cur=0,max=0;
	ICSReportRows	*rrs=m_RepDisplay.GetRows();
	COLORREF		color=m_ViewColor;

	if(rrs != NULL)	{
		max = rrs->GetCount();
		for(cur=0; cur<max; cur++)	{
			m_HideMap.Lookup(cur,m_HideDat);
			if(m_HideDat.hd_0 != 0)	{
				m_HideDat.hd_0 = 0;
				m_HideMap.SetAt(cur,m_HideDat);
				m_RepDisplay.SetRowBackColor(cur,m_ViewColor,TRUE);
			}
		}
		// インバース表示されている行は下記関数で変更
		m_RepDisplay.ColorInactive(color);
	}
}

//--------------------------------------------------
//	選択アイテムの確認
//--------------------------------------------------
//	【引数】	なし
//	【戻値】	選択されているアイテム数
//--------------------------------------------------
int CdlgDisplay2::CheckSelectItem(void)
{
	int		nRet=0;			// 戻値
	int		nCnt=0,nMax=0;	// カウント用

	// アイテム分ループ
	nMax = (int)m_HideMap.GetCount();
	for(nCnt=0; nCnt<nMax; nCnt++)	{
		// 選択値がオン？
		m_HideMap.Lookup(nCnt,m_HideDat);
		if(m_HideDat.hd_0 != 0)	{
			// 戻値インクリメント
			nRet++;
		}
	}
	// 戻値を返す
	return(nRet);
}

//--------------------------------------------------
//	リストアイテムをチェック
//--------------------------------------------------
//	【引数】	fDel	…	削除フラグ
//	【戻値】	変更（削除）したアイテム数
//--------------------------------------------------
int CdlgDisplay2::CheckListItam(BOOL fDel)
{
	int					nRet = 0;	//	戻値
	CdbUc000Common*		pRec = 0;	//	データベースクラスポインタ
	
	//	様式で分岐
	switch( m_nFormSeq ){
	case ID_FORMNO_011:
		pRec = new CdbUc011Yotyokin( m_pDB );
		break;
	case ID_FORMNO_021:
		pRec = new CdbUc021Uketoritegata( m_pDB );
		break;
	case ID_FORMNO_031:
		pRec = new CdbUc031Urikakekin( m_pDB );
		break;
	case ID_FORMNO_041:
		pRec = new CdbUc041Karibarai( m_pDB );
		break;
	case ID_FORMNO_042:
		pRec = new CdbUc042Kasituke( m_pDB );
		break;
	case ID_FORMNO_051:
		pRec = new CdbUc051Tanaoroshi( m_pDB );
		break;
	case ID_FORMNO_061:
		pRec = new CdbUc061Yuukasyouken( m_pDB );
		break;
	case ID_FORMNO_071:
		pRec = new CdbUc071Koteishisan( m_pDB );
		break;
	case ID_FORMNO_081:
		pRec = new CdbUc081Siharaitegata( m_pDB );
		break;
	case ID_FORMNO_091:
		pRec = new CdbUc091Kaikakekin( m_pDB );
		break;
	case ID_FORMNO_101:
		pRec = new CdbUc101Kariukekin( m_pDB );
		break;
	case ID_FORMNO_102:
		pRec = new CdbUc102Gensen( m_pDB );
		break;
	case ID_FORMNO_111:
		pRec = new CdbUc111Kariirekin( m_pDB );
		break;
	case ID_FORMNO_121:
		pRec = new CdbUc121Totiuriage( m_pDB );
		break;
	case ID_FORMNO_131:
		pRec = new CdbUc131Uriagedaka( m_pDB );
		break;
	case ID_FORMNO_141:
		pRec = new CdbUc141Yakuin( m_pDB );
		break;
	case ID_FORMNO_142:
		pRec = new CdbUc142Jinkenhi( m_pDB );
		break;
	case ID_FORMNO_151:
		pRec = new CdbUc151Tidaiyatin( m_pDB );
		break;
	case ID_FORMNO_152:
		pRec = new CdbUc152Kenrikin( m_pDB );
		break;
	case ID_FORMNO_153:
		pRec = new CdbUc153Kougyou( m_pDB );
		break;
	case ID_FORMNO_161:
		pRec = new CdbUc161Zatueki( m_pDB );
		break;
	case ID_FORMNO_162:
		pRec = new CdbUc162Zatuson( m_pDB );
		break;
	case ID_FORMNO_171:
	case ID_FORMNO_172:
	case ID_FORMNO_173:
	case ID_FORMNO_174:
	case ID_FORMNO_175:
	case ID_FORMNO_176:
	case ID_FORMNO_177:
	case ID_FORMNO_178:
	case ID_FORMNO_179:
	case ID_FORMNO_1710:
	case ID_FORMNO_1711:
	case ID_FORMNO_1712:
	case ID_FORMNO_1713:
	case ID_FORMNO_1714:
	case ID_FORMNO_1715:
	case ID_FORMNO_1716:
	case ID_FORMNO_1717:
	case ID_FORMNO_1718:
	case ID_FORMNO_1719:
	case ID_FORMNO_1720:
		pRec = new CdbUc171Sonota1( m_pDB, m_nFormSeq );
		break;
	case ID_FORMNO_181:
	case ID_FORMNO_182:
	case ID_FORMNO_183:
	case ID_FORMNO_184:
	case ID_FORMNO_185:
	case ID_FORMNO_186:
	case ID_FORMNO_187:
	case ID_FORMNO_188:
	case ID_FORMNO_189:
	case ID_FORMNO_1810:
	case ID_FORMNO_1811:
	case ID_FORMNO_1812:
	case ID_FORMNO_1813:
	case ID_FORMNO_1814:
	case ID_FORMNO_1815:
	case ID_FORMNO_1816:
	case ID_FORMNO_1817:
	case ID_FORMNO_1818:
	case ID_FORMNO_1819:
	case ID_FORMNO_1820:
		pRec = new CdbUc181Sonota2( m_pDB, m_nFormSeq );
		break;
	}	
	
	//	選択行の表示フラグ設定
	nRet = SetFgShow( pRec, fDel );
	//	データベースクラスを破棄
	delete( pRec );

	//	戻値を返す
	return( nRet );
}

// -----------------------------------------------------------------------------------------------------------------------------------
//	選択行の表示フラグ設定
// -----------------------------------------------------------------------------------------------------------------------------------
//	【引数】	pRec	…	データベースクラス
//				fDel	…	
//	【戻値】	変更（削除）したアイテム数
// -----------------------------------------------------------------------------------------------------------------------------------
int CdlgDisplay2::SetFgShow(CdbUc000Common* pRec,  BOOL fDel)
{
	int				nRet=0;			// 戻値
	int				nCnt=0,nMax=0;	// カウント用
	int				nSeq=0;			// シーケンス番号
	BYTE			nFgShow=0;		// 表示フラグ
	CdbUcLstHokan	mfcRec(m_pDB);	// 保管データ

	// リストアイテム分ループ
	nMax = (int)m_HideMap.GetCount();
	for(nCnt=0; nCnt<nMax; nCnt++)	{
		// 選択値がオン？
		m_HideMap.Lookup(nCnt,m_HideDat);
		if(m_HideDat.hd_0 != 0)	{
			nSeq = m_HideDat.hd_1;

			//	シーケンス番号で検索
			if(pRec->RequerySeq( nSeq ) == DB_ERR_OK)	{
				//	レコードあり？
				if( !pRec->IsEOF() )	{
					//	レコードの先頭に移動
					pRec->MoveFirst();

					//	削除する？
					if( fDel == TRUE )	{
						//	レコードの削除
						pRec->Delete();
					}
					else	{
						//	編集開始
						pRec->Edit();
						
						//	種別で分岐
						switch( m_nType )	{
						//	一括金額
						case ID_FGSHOW_IKKATU:
							nFgShow = ID_FGSHOW_RET_IKKATU;
							break;
						//	一時保管
						case ID_FGSHOW_HOKAN:
							nFgShow = ID_FGSHOW_RET_HOKAN;
							break;
						}
						//	表示フラグを変更
						pRec->m_FgShow = nFgShow;
						//	レコードの更新
						pRec->Update();
					}
					//	戻値インクリメント
					nRet++;
				}
				//	レコード閉じる
				pRec->Fin(); 
			}

			// 保管テーブル削除
			mfcRec.RequerySeqFormSeq(m_nFormSeq, nSeq);
			if( !mfcRec.IsEOF() )	{
				mfcRec.MoveFirst();
				if( fDel == TRUE )	{
					mfcRec.Delete();
				}
			}
		}
	}

	// 保管テーブルのOrderNum整理
	mfcRec.RequeryFormSeq( m_nFormSeq );
	if( !mfcRec.IsEOF() ){
		int nOrderNum = 1;
		mfcRec.MoveFirst();
		while( !mfcRec.IsEOF() ){
			mfcRec.Edit();
			mfcRec.m_OrderNum = nOrderNum;
			mfcRec.Update();

			// オーダーインクリメント
			nOrderNum++;

			// 次のレコードへ
			mfcRec.MoveNext();
		}
	}
	mfcRec.Fin();

	//	戻値を返す
	return( nRet );
}

// No.200602 add -->
// -----------------------------------------------------------------------------------------------------------------------------------
//	「全項目を１画面に表示する」クリックイベント
// -----------------------------------------------------------------------------------------------------------------------------------
void CdlgDisplay2::OnBnClickedCheckRyaku()
{
	// 列幅を保存
	SaveReportnWidth();

	// 「全項目を１画面に表示する」チェック
	m_Flg1 = m_chkRyaku.GetCheck();

	// レポートコントロールの再描画、ヘッダ部作成
// No.158013 del -->
	//InitReportHeader(m_nFormSeq);
// No.158013 del <--
// No.158013 add -->
	InitReportHeader(m_nFormSeq, 1);
// No.158013 add <--
}

// -----------------------------------------------------------------------------------------------------------------------------------
//	「全項目を１画面に表示する」SetFocusイベント
//	(※レポートコントロールのKillFocusが発生しないため、レポート以外のSetFocusで処理を行う)
// -----------------------------------------------------------------------------------------------------------------------------------
void CdlgDisplay2::OnBnSetfocusCheckRyaku()
{
	PostMessage(WM_USER_FOCUSSET,0,0);
}
// No.200602 add <--

// No.158072 del -->
//// No.158013 add -->
//// -----------------------------------------------------------------------------------------------------------------------------------
////	フォーマット文字列を作成する
////	※"sss,sss,ss9.99"の形にする	"s"：データがなければスペースを返す
////									"9"：データがなければ「0」を返す
//// -----------------------------------------------------------------------------------------------------------------------------------
//// 引数		：int				nIntDigit			整数の桁数
////			：int				nDecDigit			小数点以下の桁数（0）
////			：BOOL				bFgComma			TRUE :カンマ有
////													FALSE:カンマ無
////			：BOOL				bComma13			TRUE :13桁目のカンマ有	S,SSS,SSS,SSS,SS9
////													FALSE:13桁目のカンマ無	SSSS,SSS,SSS,SS9
//// 戻り値	：CString			フォーマット文字列
//// -----------------------------------------------------------------------------------------------------------------------------------
//CString CdlgDisplay2::MakeFormatNum(int nIntDigit, int nDecDigit /*= 0*/, BOOL bFgComma /*= TRUE*/, BOOL bComma13 /*= TRUE*/)
//{
//	int			ii=0;
//	CString		strFormat=_T("");
//
//	// 小数点以下
//	if(nDecDigit > 0)	{
//		for(ii=0; ii<nDecDigit; ii++)	{
//			strFormat = "9" + strFormat;
//		}
//
//		// 小数点の追加
//		strFormat = "." + strFormat;
//	}
//
//	// 整数
//	strFormat = "9" + strFormat;	// 9.99
//
//	if(nIntDigit > 0)	{
//		for(ii=2; ii<=nIntDigit; ii++)	{
//			// 4, 7, 10･･･桁目の場合にカンマ付きでセットする
//			if(ii != 1 && ii % 3 == 1 && bFgComma && (bComma13 == TRUE || ii < 13))	{
//				strFormat = "s," + strFormat;		// s,ss9
//			}
//			else{
//				strFormat = "s" + strFormat;		// ss9
//			}
//		}
//	}
//
//	return strFormat;
//}
//// No.158013 add <--
// No.158072 del <--
// No.158072 add -->
// -----------------------------------------------------------------------------------------------------------------------------------
// レポートコントロールのヘッダー部分がクリックされた
// -----------------------------------------------------------------------------------------------------------------------------------
LRESULT CdlgDisplay2::OnUserReportSort( WPARAM wParam, LPARAM lParam )
{
	int					idxClm = 0;
	int					ii=0;
	int					sw=0;
	CString				cs=_T("");
	ICSReportColumns*	clms;
	ICSReportColumn*	clm;

// 21/06/24_01 add -->
	// 簡素化以前は処理しない
	if(bG_Kanso == FALSE)	return(0);
// 21/06/24_01 add <--

	idxClm = (int)wParam;

	if(idxClm < m_nColumnMax)	{
// 21/06/24_01 add -->
		// 全行データが入力されていない項目の場合は、ソート処理を行わないのでリターン
		if(m_DtUse[idxClm] == 0) {
			return(0);
		}
// 21/06/24_01 add <--

		// m_SortSw[0] = -1;	// ソートカラム
		// m_SortSw[1] = 0;		// ソートサイン 0:なし、1:昇順、2:降順
		m_SortSw[0] = idxClm;
		if(m_SortSw[0] != m_SaveSw[0])	m_SortSw[1] = 0;

		if(m_SortSw[1] == 1)	{
			// 昇順 → 降順
			m_SortSw[1] = 2;
		}
		else	{
			// ソート無し or 降順 → 昇順
			m_SortSw[1] = 1;
		}

		// レポートコントロールのデータ作成（ソート処理）
		InitReportData(m_nFormSeq,m_pDB,m_nType);

		clms = m_RepDisplay.GetColumns();
		for(ii=0; ii<m_nColumnMax; ii++)	{
			clm = clms->GetAt(ii);
			// カラムタイトル設定
			cs.Empty();

			if(m_nFormSeq == ID_FORMNO_011)			{	sw = 0;		}					//	①.預貯金等［様式011］
			else if(m_nFormSeq == ID_FORMNO_021)	{	sw = 1;		}					//	②.受取手形［様式021］
			else if(m_nFormSeq == ID_FORMNO_031)	{	sw = 2;		}					//	③.売掛金［様式031］
			else if(m_nFormSeq == ID_FORMNO_041)	{	sw = 3;		}					//	④－１.仮払金［様式041］
			else if(m_nFormSeq == ID_FORMNO_042)	{	sw = 4;		}					//	④－２.貸付金［様式042］
			else if(m_nFormSeq == ID_FORMNO_051)	{	sw = 5;		}					//	⑤.棚卸資産［様式051］
			else if(m_nFormSeq == ID_FORMNO_061)	{	sw = 6;		}					//	⑥.有価証券［様式061］
			else if(m_nFormSeq == ID_FORMNO_071)	{	sw = 7;		}					//	⑦.固定資産［様式071］
			else if(m_nFormSeq == ID_FORMNO_081)	{	sw = 8;		}					//	⑧.支払手形［様式081］
			else if(m_nFormSeq == ID_FORMNO_091)	{	sw = 9;		}					//	⑨.買掛金［様式091］
			else if(m_nFormSeq == ID_FORMNO_101)	{	sw = 10;	}					//	⑩ー１.仮受金［様式101］
			else if(m_nFormSeq == ID_FORMNO_102)	{	sw = 11;	}					//	⑩ー２.源泉取得税［様式102］
			else if(m_nFormSeq == ID_FORMNO_111)	{	sw = 12;	}					//	⑪.借入金［様式111］
			else if(m_nFormSeq == ID_FORMNO_121)	{	sw = 13;	}					//	⑫.土地の売上高等［様式121］
			else if(m_nFormSeq == ID_FORMNO_131)	{	sw = 14;	}					//	⑬.売上高等の事業所別［様式131］
			else if(m_nFormSeq == ID_FORMNO_141)	{	sw = 15;	}					//	⑭ー１.役員報酬手当金等［様式141］
			else if(m_nFormSeq == ID_FORMNO_151)	{	sw = 17;	}					//	⑮ー１.地代家賃等［様式151］
			else if(m_nFormSeq == ID_FORMNO_152)	{	sw = 18;	}					//	⑮ー２.権利金等の期中支払［様式152］
			else if(m_nFormSeq == ID_FORMNO_153)	{	sw = 19;	}					//	⑮ー３.工業所有権等の使用料［様式153］
			else if(m_nFormSeq == ID_FORMNO_161)	{	sw = 20;	}					//	⑯ー１.雑役［様式161］
			else if(m_nFormSeq == ID_FORMNO_162)	{	sw = 21;	}					//	⑯ー２.雑損失［様式162］
			else if(m_nFormSeq >= ID_FORMNO_171 && m_nFormSeq <= ID_FORMNO_1720)	{	//	⑰.その他科目の内訳書①－１～２０［様式171］
				sw = 22;
			}
			else if(m_nFormSeq >= ID_FORMNO_181 && m_nFormSeq <= ID_FORMNO_1820)	{	//	⑱.その他科目の内訳書②－１～２０［様式181］
				sw = 23;
			}

			if((m_nFormSeq >= ID_FORMNO_181 && m_nFormSeq <= ID_FORMNO_1820) && ii == 1)	{
				cs = GetSonota2ItemName();
			}
			else	{
				if(m_Flg1 == 0)	{	// 全項目を１画面に表示しない
// インボイス登録番号追加対応_23/09/11 del -->
					//cs = R_Title_1[sw][ii];
// インボイス登録番号追加対応_23/09/11 del <--
// インボイス登録番号追加対応_23/09/11 add -->
					if(bG_InvNo == TRUE)	cs = R_Title_3[sw][ii];
					else					cs = R_Title_1[sw][ii];
// インボイス登録番号追加対応_23/09/11 add <--
				}
				else	{			// 全項目を１画面に表示する
// インボイス登録番号追加対応_23/09/11 del -->
					//cs = R_Title_2[sw][ii];
// インボイス登録番号追加対応_23/09/11 del <--
// インボイス登録番号追加対応_23/09/11 add -->
					if(bG_InvNo == TRUE)	cs = R_Title_4[sw][ii];
					else					cs = R_Title_2[sw][ii];
// インボイス登録番号追加対応_23/09/11 add <--
				}
			}

			if(idxClm == ii)	{
// No.158113 del -->
				//if(m_SortSw[1] == 1)		cs = cs + _T(" △");
				//else if(m_SortSw[1] == 2)	cs = cs + _T(" ▽");
// No.158113 del <--
// No.158113 add -->
				if(m_SortSw[1] == 1)		cs = cs + _T(" ▲");
				else if(m_SortSw[1] == 2)	cs = cs + _T(" ▼");
// No.158113 add <--
			}

			clm->SetCaption(cs);
		}

		for(ii=0; ii<2; ii++)	{
			m_SaveSw[ii] = m_SortSw[ii];
		}
	}

	return(0);
}
// No.158072 add <--
