#pragma	once

#define	ID51T	122	//  1. 課税標準額に対する消費税額（期間計）
#define ID52T	123	//  2. 貸倒回収額に対する消費税額（期間計）
#define ID53T	124	//  3. 売上対価の返還等に係る消費税額（期間計）
#define ID54T	125	//  4. 控除対象仕入税額計算の為の消費税額（期間計）
#define ID55T	126	//	5. 単一事業の場合の控除対象仕入税額（期間計）
#define ID56T	127	//	6. 事業別課税売上高合計（期間計）
#define ID512T	128 // 12. 事業別課税売上に係る消費税額合計（期間計）
#define ID57T	129	//	7. 事業別課税売上高･第一種（期間計）
#define	ID57TE	130 //  7. 売上割合
#define ID513T	131 // 13. 事業別課税売上に係る消費税額･第一種（期間計）
#define ID58T	132	//	8. 事業別課税売上高･第二種（期間計）
#define	ID58TE	133	//  8. 売上割合
#define ID514T	134	// 14. 事業別課税売上に係る消費税額･第二種（期間計）
#define ID59T	135	//	9. 事業別課税売上高･第三種（期間計）
#define	ID59TE	136	//  9. 売上割合
#define ID515T	137	// 15. 事業別課税売上に係る消費税額･第三種（期間計）
#define ID510T	138	// 10. 事業別課税売上高･第四種（期間計）
#define	ID510TE	139	// 10. 売上割合
#define ID516T	140	// 16. 事業別課税売上に係る消費税額･第四種（期間計）
#define ID511T	141	// 11. 事業別課税売上高･第五種（期間計）
#define	ID511TE	142	// 11. 売上割合
#define ID517T	143	// 17. 事業別課税売上に係る消費税額･第五種（期間計）

#define ID518T	144	// 18. 原則計算適用･合計 仕入税額（期間計）
#define ID519T	145	// 19. 特例適用･合計 仕入税額(4%分)	
#define ID520T	146	// 20.
#define ID521T	147	// 21.
#define ID522T	148	// 22.
#define ID523T	149	// 23.
#define ID524T	150	// 24.
#define ID525T	151	// 25.
#define ID526T	152	// 26.
#define ID527T	153	// 27.
#define ID528T	154	// 28.
#define ID529T	155	// 29.
#define ID530T	156	// 30.

// 付表５
static SH_ITEMINDEX	Fhyo5[]	=	{
//	{	ID51T,  0, 1, 0		},
//	{	ID52T,  0, 1, 0		}, 
//	{	ID53T,  0, 1, 0		}, 
//	{	ID54T,  0, 0, 0		}, 
//	{	ID55T,  0, 0, 0		}, 
	{	ID56T,  0, 1, 0		}, 
//	{	ID512T, 0, 1, 0		}, 
	{	ID57T,  0, 1, 0		}, 
//	{	ID57TE, 0, 0, 0		},
	{	ID513T, 0, 1, 0		},
	{	ID58T,  0, 1, 0		}, 
//	{	ID58TE, 0, 0, 0		}, 
	{	ID514T, 0, 1, 0		}, 
	{	ID59T,  0, 1, 0		}, 
//	{	ID59TE, 0, 0, 0		}, 	
	{	ID515T, 0, 1, 0		}, 
	{	ID510T, 0, 1, 0		}, 
//	{	ID510TE,0, 0, 0		},
	{	ID516T, 0, 1, 0		}, 
	{	ID511T, 0, 1, 0		},  
//	{	ID511TE,0, 0, 0		},
	{	ID517T, 0, 1, 0		},  
	{	ID518T, 0, 1, 0		},  
	{	ID519T, 0, 1, 0		},  
	{	ID520T, 0, 1, 0		},  
	{	ID521T, 0, 1, 0		},  
	{	ID522T, 0, 1, 0		}, 
	{	ID523T, 0, 1, 0		}, 
	{	ID524T, 0, 1, 0		},  
	{	ID525T, 0, 1, 0		},  
	{	ID526T, 0, 1, 0		},  
	{	ID527T, 0, 1, 0		},  
	{	ID528T, 0, 1, 0		}, 
	{	ID529T, 0, 1, 0		}, 
//	{	ID530T, 0, 0, 0		}, 
	{	0,0,0,0				}
};

static FCSUPDOWN_INFO	FCS_Fhyo5[]	=	{
	{	ID56T		},
	{	ID57T		},
	{	ID58T		},
	{	ID59T		},
	{	ID510T		},
	{	ID511T		},
	{	ID512T		},
	{	ID513T		},
	{	ID514T		},
	{	ID515T		},
	{	ID516T		},
	{	ID517T		},
	{	ID518T 		},
	{	ID519T 		},
	{	ID520T 		},
	{	ID521T		},
	{	ID522T		},
	{	ID523T		},
	{	ID524T		},
	{	ID525T		},
	{	ID526T		},
	{	ID527T		},
	{	ID528T		},
	{	ID529T		},
};

#define		FCS_FHYO5CNT	24


