#pragma	once

#define	ID51T	148	//  1. 課税標準額に対する消費税額（期間計）
#define ID52T	149	//  2. 貸倒回収額に対する消費税額（期間計）
#define ID53T	150	//  3. 売上対価の返還等に係る消費税額（期間計）
#define ID54T	151	//  4. 控除対象仕入税額計算の為の消費税額（期間計）
#define ID55T	152	//	5. 単一事業の場合の控除対象仕入税額（期間計）
#define ID56T	153	//	6. 事業別課税売上高合計（期間計）
#define ID513T	154 // 13. 事業別課税売上に係る消費税額合計（期間計）
#define ID57T	155	//	7. 事業別課税売上高･第一種（期間計）
#define	ID57TE	156 //  7. 売上割合
#define ID514T	157 // 14. 事業別課税売上に係る消費税額･第一種（期間計）
#define ID58T	158	//	8. 事業別課税売上高･第二種（期間計）
#define	ID58TE	159	//  8. 売上割合
#define ID515T	160	// 15. 事業別課税売上に係る消費税額･第二種（期間計）
#define ID59T	161	//	9. 事業別課税売上高･第三種（期間計）
#define	ID59TE	162	//  9. 売上割合
#define ID516T	163	// 16. 事業別課税売上に係る消費税額･第三種（期間計）
#define ID510T	164	// 10. 事業別課税売上高･第四種（期間計）
#define	ID510TE	165	// 10. 売上割合
#define ID517T	166	// 16. 事業別課税売上に係る消費税額･第四種（期間計）
#define ID511T	167	// 11. 事業別課税売上高･第五種（期間計）
#define	ID511TE	168	// 11. 売上割合
#define ID518T	169	// 18. 事業別課税売上に係る消費税額･第五種（期間計）
#define ID512T	170	// 12. 事業別課税売上高･第六種（期間計）
#define	ID512TE	171	// 12. 売上割合
#define ID519T	172	// 19. 事業別課税売上に係る消費税額･第六種（期間計）


#define ID520T	173	// 20. 原則計算適用･合計 仕入税額（期間計）
#define ID521T	174	// 21. 特例適用･合計 仕入税額(4%分)	
#define ID522T	175	// 22.
#define ID523T	176	// 23.
#define ID524T	177	// 24.
#define ID525T	178	// 25.
#define ID526T	179	// 26.
#define ID527T	180	// 27.
#define ID528T	181	// 28.
#define ID529T	182	// 29.
#define ID530T	183	// 30.
#define ID531T	184	// 31.
#define ID532T	185	// 32.
#define ID533T	186	// 33.
#define ID534T	187	// 34.
#define ID535T	188	// 35.
#define ID536T	189	// 36.
#define ID537T	190	// 37.

// 付表５
static SH_ITEMINDEX	Fhyo5EX[]	=	{
//	{	ID51T,  0, 1, 0		},
//	{	ID52T,  0, 1, 0		}, 
//	{	ID53T,  0, 1, 0		}, 
//	{	ID54T,  0, 0, 0		}, 
//	{	ID55T,  0, 0, 0		}, 
	{	ID56T,  0, 1, 0		}, 
//	{	ID513T, 0, 1, 0		},
	{	ID57T,  0, 1, 0		}, 
//	{	ID57TE, 0, 0, 0		},
	{	ID514T, 0, 1, 0		}, 
	{	ID58T,  0, 1, 0		}, 
//	{	ID58TE, 0, 0, 0		}, 
	{	ID515T, 0, 1, 0		}, 
	{	ID59T,  0, 1, 0		}, 
//	{	ID59TE, 0, 0, 0		}, 	
	{	ID516T, 0, 1, 0		}, 
	{	ID510T, 0, 1, 0		}, 
//	{	ID510TE,0, 0, 0		},
	{	ID517T, 0, 1, 0		}, 
	{	ID511T, 0, 1, 0		},  
//	{	ID511TE,0, 0, 0		},
	{	ID518T, 0, 1, 0		},  
	{	ID512T, 0, 1, 0		},  
//	{	ID512TE,0, 0, 0		},
	{	ID519T, 0, 1, 0		},  
	{	ID520T, 0, 1, 0		},  
	{	ID521T, 0, 1, 0		},  
	{	ID522T, 0, 1, 0		},  
	{	ID523T, 0, 1, 0		},  
	{	ID524T, 0, 1, 0		}, 
	{	ID525T, 0, 1, 0		}, 
	{	ID526T, 0, 1, 0		},  
	{	ID527T, 0, 1, 0		},  
	{	ID528T, 0, 1, 0		},  
	{	ID529T, 0, 1, 0		},  
	{	ID530T, 0, 1, 0		}, 
	{	ID531T, 0, 1, 0		}, 
	{	ID532T, 0, 1, 0		}, 
	{	ID533T, 0, 1, 0		}, 
	{	ID534T, 0, 1, 0		}, 
	{	ID535T, 0, 1, 0		}, 
	{	ID536T, 0, 1, 0		}, 
//	{	ID537T, 0, 1, 0		}, 
//	{	ID530T, 0, 0, 0		}, 
	{	0,0,0,0				}
};

static FCSUPDOWN_INFO	FCS_Fhyo5EX[]	=	{
	
	{	ID56T		},
	{	ID57T		},
	{	ID58T		},
	{	ID59T		},
	{	ID510T		},
	{	ID511T		},
	{	ID512T		},
	
//	{	ID57TE		},
//	{	ID58TE		},
//	{	ID59TE		},
//	{	ID510TE		},
//	{	ID511TE		},
//	{	ID512TE		},
	
//	{	ID51T 		},
//	{	ID52T 		},
//	{	ID53T 		},
//	{	ID54T		},
//	{	ID55T		},
	
	{	ID513T		},
	{	ID514T		},
	{	ID515T		},
	{	ID516T		},
	{	ID517T		},
	{	ID518T		},
	{	ID519T		},

	{	ID520T 		},
	{	ID521T 		},
	{	ID522T 		},
	{	ID523T		},
	{	ID524T		},
	{	ID525T		},
	{	ID526T		},
	{	ID527T		},
	{	ID528T		},
	{	ID529T		},
	{	ID530T		},
	{	ID531T		},
	{	ID532T		},
	{	ID533T		},
	{	ID534T		},
	{	ID535T		},
	{	ID536T		},
	{	ID537T		},
};

//#define		FCS_FHYO5CNT	35
#define		FCS_FHYO5EXCNT	32


