#pragma	once

#define	ID521A		182	//  1. 課税標準額に対する消費税額（3%分）
#define	ID521B		183	//  1. 課税標準額に対する消費税額（4%分）
#define	ID521C		184	//  1. 課税標準額に対する消費税額（6.3%分）
#define	ID521T		185	//  1. 課税標準額に対する消費税額（期間計）

#define ID522A		186	//  2. 貸倒回収額に対する消費税額（3%分）
#define ID522B		187	//  2. 貸倒回収額に対する消費税額（4%分）
#define ID522C		188	//  2. 貸倒回収額に対する消費税額（6.3%分）
#define ID522T		189	//  2. 貸倒回収額に対する消費税額（期間計）

#define ID523A		190	//  3. 売上対価の返還等に係る消費税額（3%分）
#define ID523B		191	//  3. 売上対価の返還等に係る消費税額（4%分）
#define ID523C		192	//  3. 売上対価の返還等に係る消費税額（6.3%分）
#define ID523T		193	//  3. 売上対価の返還等に係る消費税額（期間計）

#define ID524A		194	//  4. 控除対象仕入税額計算の為の消費税額（3%分）
#define ID524B		195	//  4. 控除対象仕入税額計算の為の消費税額（4%分）
#define ID524C		196	//  4. 控除対象仕入税額計算の為の消費税額（6.3%分）
#define ID524T		197	//  4. 控除対象仕入税額計算の為の消費税額（期間計）

#define ID525A		198	//	5. 単一事業の場合の控除対象仕入税額（3%分）
#define ID525B		199	//	5. 単一事業の場合の控除対象仕入税額（4%分）
#define ID525C		200	//	5. 単一事業の場合の控除対象仕入税額（6.3%分）
#define ID525T		201	//	5. 単一事業の場合の控除対象仕入税額（期間計）

#define ID526A		202	//	6. 事業別課税売上高合計（3%分）
#define ID526B		203	//	6. 事業別課税売上高合計（4%分）
#define ID526C		204	//	6. 事業別課税売上高合計（6.3%分）
#define ID526T		205	//	6. 事業別課税売上高合計（期間計）

#define ID527A		206	//	7. 事業別課税売上高･第一種（3%分）
#define ID527B		207	//	7. 事業別課税売上高･第一種（4%分）
#define ID527C		208	//	7. 事業別課税売上高･第一種（6.3%分）
#define ID527T		209	//	7. 事業別課税売上高･第一種（期間計）
#define	ID527TE		210 //  7. 売上割合

#define ID528A		211	//	8. 事業別課税売上高･第二種（3%分）
#define ID528B		212	//	8. 事業別課税売上高･第二種（4%分）
#define ID528C		213	//	8. 事業別課税売上高･第二種（6.3%分）
#define ID528T		214	//	8. 事業別課税売上高･第二種（期間計）
#define	ID528TE		215	//  8. 売上割合

#define ID529A		216	//	9. 事業別課税売上高･第三種（3%分）
#define ID529B		217	//	9. 事業別課税売上高･第三種（4%分）
#define ID529C		218	//	9. 事業別課税売上高･第三種（6.3%分）
#define ID529T		219	//	9. 事業別課税売上高･第三種（期間計）
#define	ID529TE		220	//  9. 売上割合

#define ID5210A		221	// 10. 事業別課税売上高･第四種（3%分）
#define ID5210B		222	// 10. 事業別課税売上高･第四種（4%分）
#define ID5210C		223	// 10. 事業別課税売上高･第四種（6.3%分）
#define ID5210T		224	// 10. 事業別課税売上高･第四種（期間計）
#define	ID5210TE	225	// 10. 売上割合

#define ID5211A		226	// 11. 事業別課税売上高･第五種（3%分）
#define ID5211B		227	// 11. 事業別課税売上高･第五種（4%分）
#define ID5211C		228	// 11. 事業別課税売上高･第五種（6.3%分）
#define ID5211T		229 // 11. 事業別課税売上高･第五種（期間計）
#define	ID5211TE	230	// 11. 売上割合

#define ID5212A		231	// 12. 事業別課税売上高･第六種（3%分）
#define ID5212B		232	// 12. 事業別課税売上高･第六種（4%分）
#define ID5212C		233	// 12. 事業別課税売上高･第六種（6.3%分）
#define ID5212T		234 // 12. 事業別課税売上高･第六種（期間計）
#define	ID5212TE	235	// 12. 売上割合

#define ID5213A		236 // 13. 事業別課税売上に係る消費税額合計（3%分）
#define ID5213B		237 // 13. 事業別課税売上に係る消費税額合計（4%分）
#define ID5213C		238 // 13. 事業別課税売上に係る消費税額合計（6.3%分）
#define ID5213T		239 // 13. 事業別課税売上に係る消費税額合計（期間計）

#define ID5214A		240 // 14. 事業別課税売上に係る消費税額･第一種（3%分）
#define ID5214B		241 // 14. 事業別課税売上に係る消費税額･第一種（4%分）
#define ID5214C		242 // 14. 事業別課税売上に係る消費税額･第一種（6.3%分）
#define ID5214T		243 // 14. 事業別課税売上に係る消費税額･第一種（期間計）

#define ID5215A		244	// 15. 事業別課税売上に係る消費税額･第二種（3%分）
#define ID5215B		245	// 15. 事業別課税売上に係る消費税額･第二種（4%分）
#define ID5215C		246	// 15. 事業別課税売上に係る消費税額･第二種（6.3%分）
#define ID5215T		247	// 15. 事業別課税売上に係る消費税額･第二種（期間計）

#define ID5216A		248	// 16. 事業別課税売上に係る消費税額･第三種（3%分）
#define ID5216B		249	// 16. 事業別課税売上に係る消費税額･第三種（4%分）
#define ID5216C		250	// 16. 事業別課税売上に係る消費税額･第三種（6.3%分）
#define ID5216T		251	// 16. 事業別課税売上に係る消費税額･第三種（期間計）

#define ID5217A		252	// 17. 事業別課税売上に係る消費税額･第四種（3%分）
#define ID5217B		253	// 17. 事業別課税売上に係る消費税額･第四種（4%分）
#define ID5217C		254	// 17. 事業別課税売上に係る消費税額･第四種（6.3%分）
#define ID5217T		255	// 17. 事業別課税売上に係る消費税額･第四種（期間計）

#define ID5218A		256	// 18. 事業別課税売上に係る消費税額･第五種（3%分）
#define ID5218B		257	// 18. 事業別課税売上に係る消費税額･第五種（4%分）
#define ID5218C		258	// 18. 事業別課税売上に係る消費税額･第五種（6.3%分）
#define ID5218T		259	// 18. 事業別課税売上に係る消費税額･第五種（期間計）

#define ID5219A		260	// 19. 事業別課税売上に係る消費税額･第六種（3%分）
#define ID5219B		261	// 19. 事業別課税売上に係る消費税額･第六種（4%分）
#define ID5219C		262	// 19. 事業別課税売上に係る消費税額･第六種（6.3%分）
#define ID5219T		263	// 19. 事業別課税売上に係る消費税額･第六種（期間計）


/*
#define ID5218T		210	// 18. 原則計算適用･合計 仕入税額（期間計）
#define ID5218B		211	// 18. 原則計算適用･合計 仕入税額（4%分）
#define ID5219T		212	// 19. 特例適用･合計 仕入税額(期間計)	
#define ID5219B		213	// 19. 特例適用･合計 仕入税額(4%分)	
#define ID5220T		214	// 20.
#define ID5220B		215	// 20.
#define ID5221T		216	// 21.
#define ID5221B		217	// 21.
#define ID5222T		218	// 22.
#define ID5222B		219	// 22.
#define ID5223T		220	// 23.
#define ID5223B		221	// 23.
#define ID5224T		222	// 24.
#define ID5224B		223	// 24.
#define ID5225T		224	// 25.
#define ID5225B		225	// 25.
#define ID5226T		226	// 26.
#define ID5226B		227	// 26.
#define ID5227T		228	// 27.
#define ID5227B		229	// 27.
#define ID5228T		230	// 28.
#define ID5228B		231	// 28.
#define ID5229T		232	// 29.
#define ID5229B		233	// 29.
#define ID5230T		234	// 30.
#define ID5230B		235	// 30.
*/

// 付表５-（２）
static SH_ITEMINDEX	Fhyo52[]	=	{
//	{	ID521T,  0, 0, 0		}, 	
//	{	ID521B,  0, 0, 0		},  
//	{	ID522T,  0, 0, 0		},  
//	{	ID522B,  0, 0, 0		},  
//	{	ID523T,  0, 0, 0		},  
//	{	ID523B,  0, 0, 0		},  
//	{	ID524T,  0, 0, 0		},  
//	{	ID524B,  0, 0, 0		},  
//	{	ID525T,  0, 0, 0		}, 
//	{	ID525B,  0, 0, 0		}, 
	
	{	ID526A,  0, 1, 0		},  
	{	ID526B,  0, 1, 0		},  
	{	ID526C,  0, 1, 0		},  
//	{	ID5212A, 0, 1, 0		},  	
//	{	ID5212B, 0, 1, 0		},  
//	{	ID5212C, 0, 1, 0		},  

	{	ID527A,  0, 1, 0		},  
	{	ID527B,  0, 1, 0		},  
	{	ID527C,  0, 1, 0		},  
//	{	ID527TE, 0, 0, 0		}, 
	{	ID5214A, 0, 1, 0		},   
	{	ID5214B, 0, 1, 0		},   
	{	ID5214C, 0, 1, 0		},   

	{	ID528A,  0, 1, 0		},   
	{	ID528B,  0, 1, 0		},   
	{	ID528C,  0, 1, 0		},   
//	{	ID528TE, 0, 0, 0		},   	
	{	ID5215A, 0, 1, 0		},   	
	{	ID5215B, 0, 1, 0		},   	
	{	ID5215C, 0, 1, 0		},   	

	{	ID529A,	 0, 1, 0		},    
	{	ID529B,	 0, 1, 0		},    
	{	ID529C,	 0, 1, 0		},    
//	{	ID529TE, 0, 0, 0		},  	
	{	ID5216A, 0, 1, 0		},    
	{	ID5216B, 0, 1, 0		},    
	{	ID5216C, 0, 1, 0		},    

	{	ID5210A, 0, 1, 0		},  
	{	ID5210B, 0, 1, 0		},  
	{	ID5210C, 0, 1, 0		},  
//	{	ID5210TE,0, 0, 0		}, 
	{	ID5217A, 0, 1, 0		},  
	{	ID5217B, 0, 1, 0		},  
	{	ID5217C, 0, 1, 0		},  

	{	ID5211A, 0, 1, 0		}, 	
	{	ID5211B, 0, 1, 0		}, 	
	{	ID5211C, 0, 1, 0		}, 	
//	{	ID5211BE,0, 0, 0		},   
	{	ID5218A, 0, 1, 0		}, 
	{	ID5218B, 0, 1, 0		}, 
	{	ID5218C, 0, 1, 0		}, 

	{	ID5212A, 0, 1, 0		}, 	
	{	ID5212B, 0, 1, 0		}, 	
	{	ID5212C, 0, 1, 0		}, 	
//	{	ID5211BE,0, 0, 0		},   
	{	ID5219A, 0, 1, 0		}, 
	{	ID5219B, 0, 1, 0		}, 
	{	ID5219C, 0, 1, 0		}, 

/*	{	ID5218T, 0, 1, 0		}, 
	{	ID5218B, 0, 1, 0		},   
	{	ID5219T, 0, 1, 0		},  	
	{	ID5219B, 0, 1, 0		}, 	
	{	ID5220T, 0, 1, 0		},  
	{	ID5220B, 0, 1, 0		}, 	 	
	{	ID5221T, 0, 1, 0		},  	
	{	ID5221B, 0, 1, 0		},  	
	{	ID5222T, 0, 1, 0		}, 	
	{	ID5222B, 0, 1, 0		},  	
	{	ID5223T, 0, 1, 0		},   	
	{	ID5223B, 0, 1, 0		}, 	
	{	ID5224T, 0, 1, 0		},   	
	{	ID5224B, 0, 1, 0		},  	
	{	ID5225T, 0, 1, 0		},   	
	{	ID5225B, 0, 1, 0		},   	
	{	ID5226T, 0, 1, 0		},   	
	{	ID5226B, 0, 1, 0		},  	
	{	ID5227T, 0, 1, 0		},  	
	{	ID5227B, 0, 1, 0		},   	
	{	ID5228T, 0, 1, 0		},   	
	{	ID5228B, 0, 1, 0		},   	
	{	ID5229T, 0, 1, 0		},   	
	{	ID5229B, 0, 1, 0		},  	
//	{	ID5230T, 0, 0, 0		},  	
//	{	ID5230B, 0, 0, 0		}, 	*/
	{	0,0,0,0				}
};


static FCSUPDOWN_INFO	FCS_Fhyo52[]	=	{
	{	ID521A 		},
	{	ID522A 		},
	{	ID523A 		},
	{	ID524A		},
	{	ID525A		},
	{	ID526A		},
	{	ID527A		},
	{	ID528A		},
	{	ID529A		},
	{	ID5210A		},
	{	ID5211A		},
	{	ID5212A		},
	{	ID5213A		},
	{	ID5214A		},
	{	ID5215A		},
	{	ID5216A		},
	{	ID5217A		},
	{	ID5218A		},
	{	ID5219A		},

	{	ID521B 		},
	{	ID522B 		},
	{	ID523B 		},
	{	ID524B		},
	{	ID525B		},
	{	ID526B		},
	{	ID527B		},
	{	ID528B		},
	{	ID529B		},
	{	ID5210B		},
	{	ID5211B		},
	{	ID5212B		},
	{	ID5213B		},
	{	ID5214B		},
	{	ID5215B		},
	{	ID5216B		},
	{	ID5217B		},
	{	ID5218B		},
	{	ID5219B		},

	{	ID521C 		},
	{	ID522C 		},
	{	ID523C 		},
	{	ID524C		},
	{	ID525C		},
	{	ID526C		},
	{	ID527C		},
	{	ID528C		},
	{	ID529C		},
	{	ID5210C		},
	{	ID5211C		},
	{	ID5212C		},
	{	ID5213C		},
	{	ID5214C		},
	{	ID5215C		},
	{	ID5216C		},
	{	ID5217C		},
	{	ID5218C		},
	{	ID5219C		},

	{	ID521T 		},
	{	ID522T 		},
	{	ID523T 		},
	{	ID524T		},
	{	ID525T		},
	{	ID526T		},
	{	ID527T		},
	{	ID528T		},
	{	ID529T		},
	{	ID5210T		},
	{	ID5211T		},
	{	ID5212T		},
	{	ID5213T		},
	{	ID5214T		},
	{	ID5215T		},
	{	ID5216T		},
	{	ID5217T		},
	{	ID5218T		},
	{	ID5219T		},

	{	ID527TE		},
	{	ID528TE 	},
	{	ID529TE 	},
	{	ID5210TE	},
	{	ID5211TE	},
	{	ID5212TE	}
	
};

#define		FCS_FHYO52CNT	82


