/*****************************************************************
	UcCsvCommon.h
	
	ICS標準CSVファイル 定義ヘッダ

	2009.06.19	New
******************************************************************/

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 共通情報
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

// ファイル名
static char UcCsvFile[][15] = {
	_T("IcsUc011.csv"),					// ①　　：預貯金等の内訳書
	_T("IcsUc021.csv"),					// ②　　：受取手形の内訳書
	_T("IcsUc031.csv"),					// ③　　：売掛金（未収入金）の内訳書
	_T("IcsUc041.csv"),					// ④－１：仮払金（前渡金）の内訳書
	_T("IcsUc042.csv"),					// ④－２：貸付金及び受取利息の内訳書
	_T("IcsUc051.csv"),					// ⑤　　：棚卸資産の内訳書
	_T("IcsUc061.csv"),					// ⑥　　：有価証券の内訳書
	_T("IcsUc071.csv"),					// ⑦　　：固定資産の内訳書
	_T("IcsUc081.csv"),					// ⑧　　：支払手形の内訳書
	_T("IcsUc091.csv"),					// ⑨　　：買掛金の内訳書
	_T("IcsUc101.csv"),					// ⑩－１：仮受金の内訳書
	_T("IcsUc102.csv"),					// ⑩－２：源泉所得税預り金の内訳書
	_T("IcsUc111.csv"),					// ⑪　　：借入金及び支払利子の内訳書
	_T("IcsUc121.csv"),					// ⑫　　：土地の売上高等の内訳書
	_T("IcsUc131.csv"),					// ⑬　　：売上高等の事業所別内訳書
	_T("IcsUc141.csv"),					// ⑭－１：役員報酬手当金等の内訳書
	_T("IcsUc142.csv"),					// ⑭－２：人件費の内訳書
	_T("IcsUc151.csv"),					// ⑮－１：地代家賃等の内訳書
	_T("IcsUc152.csv"),					// ⑮－２：権利金等の期中支払の内訳書
	_T("IcsUc153.csv"),					// ⑮－３：工業所有権等の使用料の内訳書
	_T("IcsUc161.csv"),					// ⑯－１：雑益等の内訳書
// midori 170504 del -->
//	_T("IcsUc162.csv")					// ⑯－２：雑損失等の内訳書
// midori 170504 del <--
// midori 170504 add -->
	_T("IcsUc162.csv"),					// ⑯－２　：雑損失等の内訳書
// midori 152192 del -->
	//_T("IcsUc171.csv"),					// ⑰－１　：その他科目の内訳書①－１
	//_T("IcsUc172.csv"),					// ⑰－２　：その他科目の内訳書①－２
	//_T("IcsUc173.csv"),					// ⑰－３　：その他科目の内訳書①－３
	//_T("IcsUc174.csv"),					// ⑰－４　：その他科目の内訳書①－４
	//_T("IcsUc175.csv"),					// ⑰－５　：その他科目の内訳書①－５
	//_T("IcsUc176.csv"),					// ⑰－６　：その他科目の内訳書①－６
	//_T("IcsUc177.csv"),					// ⑰－７　：その他科目の内訳書①－７
	//_T("IcsUc178.csv"),					// ⑰－８　：その他科目の内訳書①－８
	//_T("IcsUc179.csv"),					// ⑰－９　：その他科目の内訳書①－９
// midori 152192 del <--
// midori 152192 add -->
	_T("IcsUc1701.csv"),				// ⑰－１　：その他科目の内訳書①－１
	_T("IcsUc1702.csv"),				// ⑰－２　：その他科目の内訳書①－２
	_T("IcsUc1703.csv"),				// ⑰－３　：その他科目の内訳書①－３
	_T("IcsUc1704.csv"),				// ⑰－４　：その他科目の内訳書①－４
	_T("IcsUc1705.csv"),				// ⑰－５　：その他科目の内訳書①－５
	_T("IcsUc1706.csv"),				// ⑰－６　：その他科目の内訳書①－６
	_T("IcsUc1707.csv"),				// ⑰－７　：その他科目の内訳書①－７
	_T("IcsUc1708.csv"),				// ⑰－８　：その他科目の内訳書①－８
	_T("IcsUc1709.csv"),				// ⑰－９　：その他科目の内訳書①－９
// midori 152192 add <--
	_T("IcsUc1710.csv"),				// ⑰－１０：その他科目の内訳書①－１０
	_T("IcsUc1711.csv"),				// ⑰－１１：その他科目の内訳書①－１１
	_T("IcsUc1712.csv"),				// ⑰－１２：その他科目の内訳書①－１２
	_T("IcsUc1713.csv"),				// ⑰－１３：その他科目の内訳書①－１３
	_T("IcsUc1714.csv"),				// ⑰－１４：その他科目の内訳書①－１４
	_T("IcsUc1715.csv"),				// ⑰－１５：その他科目の内訳書①－１５
	_T("IcsUc1716.csv"),				// ⑰－１６：その他科目の内訳書①－１６
	_T("IcsUc1717.csv"),				// ⑰－１７：その他科目の内訳書①－１７
	_T("IcsUc1718.csv"),				// ⑰－１８：その他科目の内訳書①－１８
	_T("IcsUc1719.csv"),				// ⑰－１９：その他科目の内訳書①－１９
	_T("IcsUc1720.csv"),				// ⑰－２０：その他科目の内訳書①－２０
// midori 152192 del -->
	//_T("IcsUc181.csv"),					// ⑱－１　：その他科目の内訳書②－１
	//_T("IcsUc182.csv"),					// ⑱－２　：その他科目の内訳書②－２
	//_T("IcsUc183.csv"),					// ⑱－３　：その他科目の内訳書②－３
	//_T("IcsUc184.csv"),					// ⑱－４　：その他科目の内訳書②－４
	//_T("IcsUc185.csv"),					// ⑱－５　：その他科目の内訳書②－５
	//_T("IcsUc186.csv"),					// ⑱－６　：その他科目の内訳書②－６
	//_T("IcsUc187.csv"),					// ⑱－７　：その他科目の内訳書②－７
	//_T("IcsUc188.csv"),					// ⑱－８　：その他科目の内訳書②－８
	//_T("IcsUc189.csv"),					// ⑱－９　：その他科目の内訳書②－９
// midori 152192 del <--
// midori 152192 add -->
	_T("IcsUc1801.csv"),				// ⑱－１　：その他科目の内訳書②－１
	_T("IcsUc1802.csv"),				// ⑱－２　：その他科目の内訳書②－２
	_T("IcsUc1803.csv"),				// ⑱－３　：その他科目の内訳書②－３
	_T("IcsUc1804.csv"),				// ⑱－４　：その他科目の内訳書②－４
	_T("IcsUc1805.csv"),				// ⑱－５　：その他科目の内訳書②－５
	_T("IcsUc1806.csv"),				// ⑱－６　：その他科目の内訳書②－６
	_T("IcsUc1807.csv"),				// ⑱－７　：その他科目の内訳書②－７
	_T("IcsUc1808.csv"),				// ⑱－８　：その他科目の内訳書②－８
	_T("IcsUc1809.csv"),				// ⑱－９　：その他科目の内訳書②－９
// midori 152192 add <--
	_T("IcsUc1810.csv"),				// ⑱－１０：その他科目の内訳書②－１０
	_T("IcsUc1811.csv"),				// ⑱－１１：その他科目の内訳書②－１１
	_T("IcsUc1812.csv"),				// ⑱－１２：その他科目の内訳書②－１２
	_T("IcsUc1813.csv"),				// ⑱－１３：その他科目の内訳書②－１３
	_T("IcsUc1814.csv"),				// ⑱－１４：その他科目の内訳書②－１４
	_T("IcsUc1815.csv"),				// ⑱－１５：その他科目の内訳書②－１５
	_T("IcsUc1816.csv"),				// ⑱－１６：その他科目の内訳書②－１６
	_T("IcsUc1817.csv"),				// ⑱－１７：その他科目の内訳書②－１７
	_T("IcsUc1818.csv"),				// ⑱－１８：その他科目の内訳書②－１８
	_T("IcsUc1819.csv"),				// ⑱－１９：その他科目の内訳書②－１９
	_T("IcsUc1820.csv")					// ⑱－２０：その他科目の内訳書②－２０
// midori 170504 add <--
};

// midori 170504 del -->
//// 帳票名		[2009/07/08 Add for Error Message]
//static char UcSheetName[][30] = {
//	_T("預貯金等の内訳書"),				// ①　　：預貯金等の内訳書
//	_T("受取手形の内訳書"),				// ②　　：受取手形の内訳書
//	_T("売掛金の内訳書"),				// ③　　：売掛金（未収入金）の内訳書
//	_T("仮払金の内訳書"),				// ④－１：仮払金（前渡金）の内訳書
//	_T("貸付金及び受取利息の内訳書"),	// ④－２：貸付金及び受取利息の内訳書
//	_T("棚卸資産の内訳書"),				// ⑤　　：棚卸資産の内訳書
//	_T("有価証券の内訳書"),				// ⑥　　：有価証券の内訳書
//	_T("固定資産の内訳書"),				// ⑦　　：固定資産の内訳書
//	_T("支払手形の内訳書"),				// ⑧　　：支払手形の内訳書
//	_T("買掛金の内訳書"),				// ⑨　　：買掛金の内訳書
//	_T("仮受金の内訳書"),				// ⑩－１：仮受金の内訳書
//	_T("源泉所得税預り金の内訳書"),		// ⑩－２：源泉所得税預り金の内訳書
//	_T("借入金及び支払利子の内訳書"),	// ⑪　　：借入金及び支払利子の内訳書
//	_T("土地の売上高等の内訳書"),		// ⑫　　：土地の売上高等の内訳書
//	_T("売上高等の事業所別内訳書"),		// ⑬　　：売上高等の事業所別内訳書
//	_T("役員報酬手当金等の内訳書"),		// ⑭－１：役員報酬手当金等の内訳書
//	_T("人件費の内訳書"),				// ⑭－２：人件費の内訳書
//	_T("地代家賃等の内訳書"),			// ⑮－１：地代家賃等の内訳書
//	_T("権利金等の期中支払の内訳書"),	// ⑮－２：権利金等の期中支払の内訳書
//	_T("工業所有権等の使用料の内訳書"),	// ⑮－３：工業所有権等の使用料の内訳書
//	_T("雑益等の内訳書"),				// ⑯－１：雑益等の内訳書
//	_T("雑損失等の内訳書")				// ⑯－２：雑損失等の内訳書
//};
// midori 170504 del <--

// 帳票番号		[20111007]
static char UcSheetNumber[][30] = {
	_T("①"),				// ①　　：預貯金等の内訳書
	_T("②"),				// ②　　：受取手形の内訳書
	_T("③"),				// ③　　：売掛金（未収入金）の内訳書
	_T("④－１"),			// ④－１：仮払金（前渡金）の内訳書
	_T("④－２"),			// ④－２：貸付金及び受取利息の内訳書
	_T("⑤"),				// ⑤　　：棚卸資産の内訳書
	_T("⑥"),				// ⑥　　：有価証券の内訳書
	_T("⑦"),				// ⑦　　：固定資産の内訳書
	_T("⑧"),				// ⑧　　：支払手形の内訳書
	_T("⑨"),				// ⑨　　：買掛金の内訳書
	_T("⑩－１"),			// ⑩－１：仮受金の内訳書
	_T("⑩－２"),			// ⑩－２：源泉所得税預り金の内訳書
	_T("⑪"),				// ⑪　　：借入金及び支払利子の内訳書
	_T("⑫"),				// ⑫　　：土地の売上高等の内訳書
	_T("⑬"),				// ⑬　　：売上高等の事業所別内訳書
	_T("⑭－１"),			// ⑭－１：役員報酬手当金等の内訳書
	_T("⑭－２"),			// ⑭－２：人件費の内訳書
	_T("⑮－１"),			// ⑮－１：地代家賃等の内訳書
	_T("⑮－２"),			// ⑮－２：権利金等の期中支払の内訳書
	_T("⑮－３"),			// ⑮－３：工業所有権等の使用料の内訳書
	_T("⑯－１"),			// ⑯－１：雑益等の内訳書
// midori 170504 del -->
//	_T("⑯－２")			// ⑯－２：雑損失等の内訳書
// midori 170504 del <--
// midori 170504 add -->
	_T("⑯－２"),			// ⑯－２：雑損失等の内訳書
	_T("⑰－１"),			// ⑰－１：その他科目の内訳書①－１
	_T("⑰－２"),			// ⑰－２：その他科目の内訳書①－２
	_T("⑰－３"),			// ⑰－３：その他科目の内訳書①－３
	_T("⑰－４"),			// ⑰－４：その他科目の内訳書①－４
	_T("⑰－５"),			// ⑰－５：その他科目の内訳書①－５
	_T("⑰－６"),			// ⑰－６：その他科目の内訳書①－６
	_T("⑰－７"),			// ⑰－７：その他科目の内訳書①－７
	_T("⑰－８"),			// ⑰－８：その他科目の内訳書①－８
	_T("⑰－９"),			// ⑰－９：その他科目の内訳書①－９
	_T("⑰－１０"),			// ⑰－１０：その他科目の内訳書①－１０
	_T("⑰－１１"),			// ⑰－１１：その他科目の内訳書①－１１
	_T("⑰－１２"),			// ⑰－１２：その他科目の内訳書①－１２
	_T("⑰－１３"),			// ⑰－１３：その他科目の内訳書①－１３
	_T("⑰－１４"),			// ⑰－１４：その他科目の内訳書①－１４
	_T("⑰－１５"),			// ⑰－１５：その他科目の内訳書①－１５
	_T("⑰－１６"),			// ⑰－１６：その他科目の内訳書①－１６
	_T("⑰－１７"),			// ⑰－１７：その他科目の内訳書①－１７
	_T("⑰－１８"),			// ⑰－１８：その他科目の内訳書①－１８
	_T("⑰－１９"),			// ⑰－１９：その他科目の内訳書①－１９
	_T("⑰－２０"),			// ⑰－２０：その他科目の内訳書①－２０
	_T("⑱－１"),			// ⑱－１：その他科目の内訳書②－１
	_T("⑱－２"),			// ⑱－２：その他科目の内訳書②－２
	_T("⑱－３"),			// ⑱－３：その他科目の内訳書②－３
	_T("⑱－４"),			// ⑱－４：その他科目の内訳書②－４
	_T("⑱－５"),			// ⑱－５：その他科目の内訳書②－５
	_T("⑱－６"),			// ⑱－６：その他科目の内訳書②－６
	_T("⑱－７"),			// ⑱－７：その他科目の内訳書②－７
	_T("⑱－８"),			// ⑱－８：その他科目の内訳書②－８
	_T("⑱－９"),			// ⑱－９：その他科目の内訳書②－９
	_T("⑱－１０"),			// ⑱－１０：その他科目の内訳書②－１０
	_T("⑱－１１"),			// ⑱－１１：その他科目の内訳書②－１１
	_T("⑱－１２"),			// ⑱－１２：その他科目の内訳書②－１２
	_T("⑱－１３"),			// ⑱－１３：その他科目の内訳書②－１３
	_T("⑱－１４"),			// ⑱－１４：その他科目の内訳書②－１４
	_T("⑱－１５"),			// ⑱－１５：その他科目の内訳書②－１５
	_T("⑱－１６"),			// ⑱－１６：その他科目の内訳書②－１６
	_T("⑱－１７"),			// ⑱－１７：その他科目の内訳書②－１７
	_T("⑱－１８"),			// ⑱－１８：その他科目の内訳書②－１８
	_T("⑱－１９"),			// ⑱－１９：その他科目の内訳書②－１９
	_T("⑱－２０")			// ⑱－２０：その他科目の内訳書②－２０
// midori 170504 add <--
};

// 帳票数
// midori 170504 del -->
//#define SHEET_NUM					22
// midori 170504 del <--
// midori 170504 add -->
#define SHEET_NUM					62
// midori 170504 add <--

// 帳票の転送方式	20111007
static char UcTransMode[][30] = {
	_T("上書き"),
	_T("追加"),
};

// 帳票の転送方式の数	20111007
#define TRANS_NUM					2

//インポートオプションダイアログのカラム名	20111007
static char UcImpOptClm[][30] = {
// midori 153952 del -->
//	_T("出力"),
// midori 153952 del <--
// midori 153952 add -->
	_T("取込"),
// midori 153952 add <--
	_T("転送方式"),
	_T("様式番号"),
	_T("様式名称")
};

//インポートオプションダイアログのカラム名(エクスポート)	20111007
static char UcImpOptClmExp[][30] = {
	_T("出力"),
	_T("様式番号"),
	_T("様式名称")
};


// 識別子
#define CSV_ID_ITEM					_T("[項目]")
#define CSV_ID_DATA					_T("[明細]")
#define CSV_ID_SYOKEI				_T("[小計]")
#define CSV_ID_CHUKEI				_T("[中計]")
#define CSV_ID_EXTRA				_T("[欄外]")
// midori 190505 add -->
#define CSV_ID_KAMOKU				_T("[科目]")
// midori 190505 add <--

// 和暦元号（ローマ字）　※漢字は dateConvert.h を参照
#define CSV_ROMAN_GENGOUW_REIGAI	_T("")
#define CSV_ROMAN_GENGOUW_MEIJ		_T("M")
#define CSV_ROMAN_GENGOUW_TAISYOU	_T("T")
#define CSV_ROMAN_GENGOUW_SYOUWA	_T("S")
#define CSV_ROMAN_GENGOUW_HEISEI	_T("H")

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Infomation Block
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

// 項目数
#define CSV_INF_ITEM_CNT			2
// 項目名
#define CSV_INF_ITEM_01				_T("帳票名")
#define CSV_INF_ITEM_02				_T("会社名")


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Data Block
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//--------------------------------------------------
// ①　　：預貯金等の内訳書
//--------------------------------------------------
// 項目数
#define CSV_011_ITEM_CNT			8
// 項目名
#define CSV_011_ITEM_01				_T("金融機関名")
#define CSV_011_ITEM_02				_T("支店名")
#define CSV_011_ITEM_03				_T("種類")
#define CSV_011_ITEM_04				_T("口座番号")
#define CSV_011_ITEM_05				_T("期末現在高")
#define CSV_011_ITEM_06				_T("摘要１")
#define CSV_011_ITEM_07				_T("摘要２")
// １頁内の合計行を含む全体の行数
#define ID_ROWKOBETU_011			24
#define ID_ROWNORMAL_011			24
//帳表固定の合計行数（1:合計あり，0:なし）
#define ID_ROWKEI_011				1

//--------------------------------------------------
// ②　　：受取手形の内訳書
//--------------------------------------------------
// 項目数
#define CSV_021_ITEM_CNT			13	// 科目追加により12→13
// 項目名
#define CSV_021_ITEM_01				_T("科目")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_021_ITEM_13				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_021_ITEM_02				_T("振出人１")
#define CSV_021_ITEM_03				_T("振出人２")
#define CSV_021_ITEM_04				_T("振出年月日")
#define CSV_021_ITEM_05				_T("支払期日")
#define CSV_021_ITEM_06				_T("支払銀行名")
#define CSV_021_ITEM_07				_T("支店名")
#define CSV_021_ITEM_08				_T("金額")
#define CSV_021_ITEM_09				_T("割引銀行名等")
#define CSV_021_ITEM_10				_T("支店名")
#define CSV_021_ITEM_11				_T("摘要１")
#define CSV_021_ITEM_12				_T("摘要２")
// 210113_5301_1 add -->
#define CSV_021_ITEM_06_NEW			_T("支払銀行名称")
#define CSV_021_ITEM_07_NEW			_T("支払銀行支店名")
#define CSV_021_ITEM_09_NEW			_T("割引銀行名及び支店名等１")
#define CSV_021_ITEM_10_NEW			_T("割引銀行名及び支店名等２")
// 210113_5301_1 add <--
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_021			24		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_021			24		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_021				1

//--------------------------------------------------
// ③　　：売掛金（未収入金）の内訳書
//--------------------------------------------------
// 項目数
#define CSV_031_ITEM_CNT			9
// 項目名
#define CSV_031_ITEM_01				_T("科目")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_031_ITEM_09				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_031_ITEM_02				_T("相手先名称（氏名）１")
#define CSV_031_ITEM_03				_T("相手先名称（氏名）２")
#define CSV_031_ITEM_04				_T("相手先所在地（住所）１")
#define CSV_031_ITEM_05				_T("相手先所在地（住所）２")
#define CSV_031_ITEM_06				_T("期末現在高")
#define CSV_031_ITEM_07				_T("摘要１")
#define CSV_031_ITEM_08				_T("摘要２")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_031			27		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_031			27		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_031				1

//--------------------------------------------------
// ④－１：仮払金（前渡金）の内訳書
//--------------------------------------------------
// 項目数
#define CSV_041_ITEM_CNT			10
// 項目名
#define CSV_041_ITEM_01				_T("科目")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_041_ITEM_10				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_041_ITEM_02				_T("相手先名称（氏名）１")
#define CSV_041_ITEM_03				_T("相手先名称（氏名）２")
#define CSV_041_ITEM_04				_T("相手先所在地（住所）１")
#define CSV_041_ITEM_05				_T("相手先所在地（住所）２")
#define CSV_041_ITEM_06				_T("法人・代表者との関係")
#define CSV_041_ITEM_07				_T("期末現在高")
#define CSV_041_ITEM_08				_T("取引の内容１")
#define CSV_041_ITEM_09				_T("取引の内容２")
// 210113_5301_1 add -->
#define CSV_041_ITEM_08_NEW			_T("摘要１")
#define CSV_041_ITEM_09_NEW			_T("摘要２")
// 210113_5301_1 add <--
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_041			11		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_041			29		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_041				0

//--------------------------------------------------
// ④－２：貸付金及び受取利息の内訳書
//--------------------------------------------------
// 項目数
#define CSV_042_ITEM_CNT			13
// 項目名
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_042_ITEM_13				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_042_ITEM_01				_T("貸付先１")
#define CSV_042_ITEM_02				_T("貸付先２")
#define CSV_042_ITEM_03				_T("所在地（住所）１")
#define CSV_042_ITEM_04				_T("所在地（住所）２")
#define CSV_042_ITEM_05				_T("法人・代表者との関係")
#define CSV_042_ITEM_06				_T("期末現在高")
#define CSV_042_ITEM_07				_T("期中の受取利息額")
#define CSV_042_ITEM_08				_T("利率")
#define CSV_042_ITEM_09				_T("貸付理由１")
#define CSV_042_ITEM_10				_T("貸付理由２")
#define CSV_042_ITEM_11				_T("担保の内容（物件の種類、数量、所在地等）１")
#define CSV_042_ITEM_12				_T("担保の内容（物件の種類、数量、所在地等）２")
// 210113_5301_1 add -->
#define CSV_042_ITEM_01_NEW			_T("貸付先名称（氏名）１")
#define CSV_042_ITEM_02_NEW			_T("貸付先名称（氏名）２")
#define CSV_042_ITEM_03_NEW			_T("貸付先所在地（住所）１")
#define CSV_042_ITEM_04_NEW			_T("貸付先所在地（住所）２")
// 210113_5301_1 add <--
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_042			8		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_042			19		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_042				1

//--------------------------------------------------
// ⑤　　：棚卸資産の内訳書
//--------------------------------------------------
// 項目数
#define CSV_051_ITEM_CNT			10
// 項目名
#define CSV_051_ITEM_01				_T("科目")
#define CSV_051_ITEM_02				_T("品目１")
#define CSV_051_ITEM_03				_T("品目２")
#define CSV_051_ITEM_04				_T("数量")
#define CSV_051_ITEM_05				_T("単位")
#define CSV_051_ITEM_06				_T("単価")
#define CSV_051_ITEM_07				_T("期末現在高")
#define CSV_051_ITEM_08				_T("摘要１")
#define CSV_051_ITEM_09				_T("摘要２")
// １頁内の合計行を含む全体の行数
#define ID_ROWNORMAL_051			25		// 通常時：１頁内の合計行を含む全体の行数
#define ID_ROWKOBETU_051			25		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし
#define ID_ROWKEI_051				1

//--------------------------------------------------
// ⑥　　：有価証券の内訳書
//--------------------------------------------------
// 項目数
#define CSV_061_ITEM_CNT			21
// 項目名
#define CSV_061_ITEM_01				_T("区分")
#define CSV_061_ITEM_02				_T("種類・銘柄１")
#define CSV_061_ITEM_03				_T("種類・銘柄２")
#define CSV_061_ITEM_04				_T("期末数量")
#define CSV_061_ITEM_05				_T("（単位）")
#define CSV_061_ITEM_06				_T("期末現在高（時価評価前）")
#define CSV_061_ITEM_07				_T("期末現在高（時価評価後）")
#define CSV_061_ITEM_08				_T("異動年月日")
#define CSV_061_ITEM_09				_T("異動事由１")
#define CSV_061_ITEM_10				_T("異動事由２")
#define CSV_061_ITEM_11				_T("異動数量")
#define CSV_061_ITEM_12				_T("（単位）")
#define CSV_061_ITEM_13				_T("期末増（減）額")
#define CSV_061_ITEM_14				_T("売却（買入）先の名称（氏名）１")
#define CSV_061_ITEM_15				_T("売却（買入）先の名称（氏名）２")
#define CSV_061_ITEM_16				_T("売却（買入）先の所在地（住所）１")
#define CSV_061_ITEM_17				_T("売却（買入）先の所在地（住所）２")
#define CSV_061_ITEM_18				_T("摘要１")
#define CSV_061_ITEM_19				_T("摘要２")
#define CSV_061_ITEM_20				_T("摘要３")
// 210113_5301_1 add -->
#define CSV_061_ITEM_02_NEW			_T("種類")
#define CSV_061_ITEM_03_NEW			_T("銘柄")
// 210113_5301_1 add <--
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_061			16		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_061			16		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_061				1


//--------------------------------------------------
// ⑦　　：固定資産の内訳書
//--------------------------------------------------
// 項目数
#define CSV_071_ITEM_CNT			19
// 項目名
#define CSV_071_ITEM_01				_T("種類・構造１")
#define CSV_071_ITEM_02				_T("種類・構造２")
#define CSV_071_ITEM_03				_T("用途１")
#define CSV_071_ITEM_04				_T("用途２")
#define CSV_071_ITEM_05				_T("面積")
#define CSV_071_ITEM_06				_T("物件の所在地１")
#define CSV_071_ITEM_07				_T("物件の所在地２")
#define CSV_071_ITEM_08				_T("期末現在高")
#define CSV_071_ITEM_09				_T("異動年月日")
#define CSV_071_ITEM_10				_T("異動事由１")
#define CSV_071_ITEM_11				_T("異動事由２")
#define CSV_071_ITEM_12				_T("取得（処分）価額")
#define CSV_071_ITEM_13				_T("異動直前の帳簿価額")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_071_ITEM_19				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_071_ITEM_14				_T("売却（購入）先の名称（氏名）１")
#define CSV_071_ITEM_15				_T("売却（購入）先の名称（氏名）２")
#define CSV_071_ITEM_16				_T("売却（購入）先の所在地（住所）１")
#define CSV_071_ITEM_17				_T("売却（購入）先の所在地（住所）２")
#define CSV_071_ITEM_18				_T("売却物件の取得年月")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_071			10		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_071			10		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_071				0

//--------------------------------------------------
// ⑧　　：支払手形の内訳書
//--------------------------------------------------
// 項目数
#define CSV_081_ITEM_CNT			10
#define CSV_081_ITEM_CNT_K			11	// 改良No.21-0086,21-0529 add
// 項目名
// 24/05/31_ScoreLink add -->
#define CSV_081_ITEM_11				_T("科目")
// 24/05/31_ScoreLink add <--
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_081_ITEM_10				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_081_ITEM_01				_T("支払先１")
#define CSV_081_ITEM_02				_T("支払先２")
#define CSV_081_ITEM_03				_T("振出年月日")
#define CSV_081_ITEM_04				_T("支払期日")
#define CSV_081_ITEM_05				_T("支払銀行名")
#define CSV_081_ITEM_06				_T("支店名")
#define CSV_081_ITEM_07				_T("金額")
#define CSV_081_ITEM_08				_T("摘要１")
#define CSV_081_ITEM_09				_T("摘要２")
// 210113_5301_1 add -->
#define CSV_081_ITEM_05_NEW			_T("支払銀行名称")
#define CSV_081_ITEM_06_NEW			_T("支払銀行支店名")
// 210113_5301_1 add <--
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_081			24		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_081			24		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_081				1

//--------------------------------------------------
// ⑨　　：買掛金の内訳書
//--------------------------------------------------
// 項目数
#define CSV_091_ITEM_CNT			9
#define CSV_091_ITEM_01				_T("科目")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_091_ITEM_09				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_091_ITEM_02				_T("相手先名称（氏名）１")
#define CSV_091_ITEM_03				_T("相手先名称（氏名）２")
#define CSV_091_ITEM_04				_T("相手先所在地（住所）１")
#define CSV_091_ITEM_05				_T("相手先所在地（住所）２")
#define CSV_091_ITEM_06				_T("期末現在高")
#define CSV_091_ITEM_07				_T("摘要１")
#define CSV_091_ITEM_08				_T("摘要２")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_091			24		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_091			24		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_091				1

//--------------------------------------------------
// ⑩－１：仮受金の内訳書
//--------------------------------------------------
// 項目数
#define CSV_101_ITEM_CNT			10
// 項目名
#define CSV_101_ITEM_01				_T("科目")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_101_ITEM_10				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_101_ITEM_02				_T("相手先名称（氏名）１")
#define CSV_101_ITEM_03				_T("相手先名称（氏名）２")
#define CSV_101_ITEM_04				_T("相手先所在地（住所）１")
#define CSV_101_ITEM_05				_T("相手先所在地（住所）２")
#define CSV_101_ITEM_06				_T("法人・代表者との関係")
#define CSV_101_ITEM_07				_T("期末現在高")
#define CSV_101_ITEM_08				_T("取引の内容１")
#define CSV_101_ITEM_09				_T("取引の内容２")
// 210113_5301_1 add -->
#define CSV_101_ITEM_08_NEW			_T("摘要１")
#define CSV_101_ITEM_09_NEW			_T("摘要２")
// 210113_5301_1 add <--
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_101			12		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_101			24		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_101				0

//--------------------------------------------------
// ⑩－２：源泉所得税預り金の内訳書
//--------------------------------------------------
// 項目数
#define CSV_102_ITEM_CNT			4
// 項目名
//#define CSV_102_ITEM_01				_T("年月日")
#define CSV_102_ITEM_01				_T("支払年月")	// 2016/01/26 年月日→支払年月
#define CSV_102_ITEM_02				_T("所得の種類")
#define CSV_102_ITEM_03				_T("期末現在高")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_102			14		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_102			52		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_102				0

//--------------------------------------------------
// ⑪　　：借入金及び支払利子の内訳書
//--------------------------------------------------
// 項目数
#define CSV_111_ITEM_CNT			14
// 項目名
#define CSV_111_ITEM_01				_T("科目")
#define CSV_111_ITEM_02				_T("借入先１")
#define CSV_111_ITEM_03				_T("借入先２")
#define CSV_111_ITEM_04				_T("所在地（住所）１")
#define CSV_111_ITEM_05				_T("所在地（住所）２")
#define CSV_111_ITEM_06				_T("法人・代表者との関係")
#define CSV_111_ITEM_07				_T("期末現在高")
#define CSV_111_ITEM_08				_T("期中の支払利子額")
#define CSV_111_ITEM_09				_T("利率")
#define CSV_111_ITEM_10				_T("借入理由１")
#define CSV_111_ITEM_11				_T("借入理由２")
#define CSV_111_ITEM_12				_T("担保の内容（物件の種類、数量、所在地等）１")
#define CSV_111_ITEM_13				_T("担保の内容（物件の種類、数量、所在地等）２")
// 210113_5301_1 add -->
#define CSV_111_ITEM_02_NEW			_T("借入先名称（氏名）１")
#define CSV_111_ITEM_03_NEW			_T("借入先名称（氏名）２")
#define CSV_111_ITEM_04_NEW			_T("借入先所在地（住所）１")
#define CSV_111_ITEM_05_NEW			_T("借入先所在地（住所）２")
// 210113_5301_1 add <--
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_111			15		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_111			15		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_111				1

//--------------------------------------------------
// ⑫　　：土地の売上高等の内訳書
//--------------------------------------------------
// 項目数
#define CSV_121_ITEM_CNT			14
// 項目名
#define CSV_121_ITEM_01				_T("区分")
#define CSV_121_ITEM_02				_T("商品の所在地１")
#define CSV_121_ITEM_03				_T("商品の所在地２")
#define CSV_121_ITEM_04				_T("地目")
#define CSV_121_ITEM_05				_T("総面積")
#define CSV_121_ITEM_06				_T("売上（仲介）年月")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_121_ITEM_14				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
// 210113_5301_1 del -->
//#define CSV_121_ITEM_07				_T("売上（仲介）先氏名（名称）")
//#define CSV_121_ITEM_08				_T("売上（仲介）先住所（所在地）１")
//#define CSV_121_ITEM_09				_T("売上（仲介）先住所（所在地）２")
// 210113_5301_1 del <--
// 210113_5301_1 add -->
#define CSV_121_ITEM_07				_T("売上（仲介）先名称（氏名）")
#define CSV_121_ITEM_08				_T("売上（仲介）先所在地（住所）１")
#define CSV_121_ITEM_09				_T("売上（仲介）先所在地（住所）２")
// 210113_5301_1 add <--
#define CSV_121_ITEM_10				_T("売上（仲介）面積")
#define CSV_121_ITEM_11				_T("売上金額")
#define CSV_121_ITEM_12				_T("仲介手数料")
#define CSV_121_ITEM_13				_T("売上商品の取得年")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_121			10		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_121			10		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_121				0

//--------------------------------------------------
// ⑬　　：売上高等の事業所別内訳書
//--------------------------------------------------
#define CSV_131_ITEM_CNT			19
// 項目名
#define CSV_131_ITEM_01				_T("事業所の名称")
#define CSV_131_ITEM_02				_T("所在地１")
#define CSV_131_ITEM_03				_T("所在地２")
#define CSV_131_ITEM_04				_T("責任者氏名１")
#define CSV_131_ITEM_05				_T("責任者氏名２")
#define CSV_131_ITEM_06				_T("代表者との関係")
#define CSV_131_ITEM_07				_T("事業等の内容１")
#define CSV_131_ITEM_08				_T("事業等の内容２")
#define CSV_131_ITEM_09				_T("事業等の内容３")
#define CSV_131_ITEM_10				_T("売上高")
#define CSV_131_ITEM_11				_T("期末棚卸高")
// 210113_5301_1 del -->
//#define CSV_131_ITEM_12				_T("期末従業員数")
// 210113_5301_1 del <--
// 210113_5301_1 add -->
#define CSV_131_ITEM_12				_T("期末従事員数")
// 210113_5301_1 add <--
#define CSV_131_ITEM_13				_T("使用建物の延面積")
#define CSV_131_ITEM_14				_T("源泉所得税納付署１")
#define CSV_131_ITEM_15				_T("源泉所得税納付署２")
#define CSV_131_ITEM_16				_T("摘要１")
#define CSV_131_ITEM_17				_T("摘要２")
#define CSV_131_ITEM_18				_T("摘要３")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_131			15		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_131			15		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_131				1

//--------------------------------------------------
// ⑭－１：役員報酬手当金等の内訳書
//--------------------------------------------------
// 項目数
#define CSV_141_ITEM_CNT			16
// 項目名
#define CSV_141_ITEM_01				_T("役職名")
// midori 150974 cor -->
//#define CSV_141_ITEM_02				_T("担当職務")
// ---------------------
#define CSV_141_ITEM_02				_T("担当業務")
// midori 150974 cor <--
#define CSV_141_ITEM_03				_T("氏名１")
#define CSV_141_ITEM_04				_T("氏名２")
#define CSV_141_ITEM_05				_T("住所１")
#define CSV_141_ITEM_06				_T("住所２")
#define CSV_141_ITEM_07				_T("代表者との関係")
#define CSV_141_ITEM_08				_T("常勤・非常勤の別")
#define CSV_141_ITEM_09				_T("使用人職務分")
#define CSV_141_ITEM_10				_T("定期同額給与")
#define CSV_141_ITEM_11				_T("事前確定届出給与")
#define CSV_141_ITEM_12				_T("利益連動給与")
#define CSV_141_ITEM_13				_T("その他")
#define CSV_141_ITEM_14				_T("退職給与")
#define CSV_141_ITEM_15				_T("役員給与計")
// 210113_5301_1 add -->
#define CSV_141_ITEM_12_NEW			_T("業績連動給与")
// 210113_5301_1 add <--
// 常勤・非常勤の別
#define CSV_141_FPTIME_NULL			_T("")
#define CSV_141_FPTIME_FULL			_T("常")
#define CSV_141_FPTIME_PART			_T("非")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_141			11		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_141			15		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_141				1

//--------------------------------------------------
// ⑭－２：人件費の内訳書
//--------------------------------------------------
// 項目数
#define CSV_142_ITEM_CNT			4
// 項目名
#define CSV_142_ITEM_01				_T("区分")
#define CSV_142_ITEM_02				_T("総額")
#define CSV_142_ITEM_03				_T("総額のうち代表者及びその家族分")

#define CSV_142_SEQ_01				_T("役員報酬手当")
#define CSV_142_SEQ_02				_T("従業員給料手当")
#define CSV_142_SEQ_03				_T("従業員賃金手当")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_142			4		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_142			4		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_142				1

//--------------------------------------------------
// ⑮－１：地代家賃等の内訳書
#define CSV_151_ITEM_CNT			15
// 項目名
#define CSV_151_ITEM_01				_T("地代・家賃の区分")
#define CSV_151_ITEM_02				_T("借地（借家）物件の用途１")
#define CSV_151_ITEM_03				_T("借地（借家）物件の用途２")
#define CSV_151_ITEM_04				_T("所在地１")
#define CSV_151_ITEM_05				_T("所在地２")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_151_ITEM_15				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_151_ITEM_06				_T("貸主の名称（氏名）")
#define CSV_151_ITEM_07				_T("貸主の所在地（住所）１")
#define CSV_151_ITEM_08				_T("貸主の所在地（住所）２")
#define CSV_151_ITEM_09				_T("支払対象期間（開始）")
#define CSV_151_ITEM_10				_T("支払対象期間（終了）")
// midori 150975 cor -->
//#define CSV_151_ITEM_11				_T("支払賃貸料")
// ---------------------
#define CSV_151_ITEM_11				_T("支払賃借料")
// midori 150975 cor <--
#define CSV_151_ITEM_12				_T("摘要１")
#define CSV_151_ITEM_13				_T("摘要２")
#define CSV_151_ITEM_14				_T("摘要３")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_151			8		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_151			19		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_151				0

//--------------------------------------------------
// ⑮－２：権利金等の期中支払の内訳書
//--------------------------------------------------
// 項目数
#define CSV_152_ITEM_CNT			11
// 項目名
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_152_ITEM_11				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_152_ITEM_01				_T("支払先の名称（氏名）")
#define CSV_152_ITEM_02				_T("支払先の所在地（住所）１")
#define CSV_152_ITEM_03				_T("支払先の所在地（住所）２")
#define CSV_152_ITEM_04				_T("支払年月日")
#define CSV_152_ITEM_05				_T("支払金額")
#define CSV_152_ITEM_06				_T("権利金等の内容１")
#define CSV_152_ITEM_07				_T("権利金等の内容２")
#define CSV_152_ITEM_08				_T("摘要１")
#define CSV_152_ITEM_09				_T("摘要２")
#define CSV_152_ITEM_10				_T("摘要３")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_152			3		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_152			18		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_152				0

//--------------------------------------------------
// ⑮－３：工業所所有権等の使用料の内訳書
//--------------------------------------------------
// 項目数
#define CSV_153_ITEM_CNT			14
// 項目名
#define CSV_153_ITEM_01				_T("名称１")
#define CSV_153_ITEM_02				_T("名称２")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_153_ITEM_14				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_153_ITEM_03				_T("支払先の名称（氏名）")
#define CSV_153_ITEM_04				_T("支払先の所在地（住所）１")
#define CSV_153_ITEM_05				_T("支払先の所在地（住所）２")
#define CSV_153_ITEM_06				_T("契約期間（開始）")
#define CSV_153_ITEM_07				_T("契約期間（終了）")
#define CSV_153_ITEM_08				_T("支払対象期間（開始）")
#define CSV_153_ITEM_09				_T("支払対象期間（終了）")
#define CSV_153_ITEM_10				_T("支払金額")
#define CSV_153_ITEM_11				_T("摘要１")
#define CSV_153_ITEM_12				_T("摘要２")
#define CSV_153_ITEM_13				_T("摘要３")
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_153			3		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_153			21		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_153				0

//--------------------------------------------------
// ⑯－１：雑益等の内訳書
//--------------------------------------------------
// 項目数
#define CSV_161_ITEM_CNT			9
// 項目名
#define CSV_161_ITEM_01				_T("科目")
#define CSV_161_ITEM_02				_T("取引の内容１")
#define CSV_161_ITEM_03				_T("取引の内容２")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_161_ITEM_09				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_161_ITEM_04				_T("相手先１")
#define CSV_161_ITEM_05				_T("相手先２")
#define CSV_161_ITEM_06				_T("所在地（住所）１")
#define CSV_161_ITEM_07				_T("所在地（住所）２")
#define CSV_161_ITEM_08				_T("金額")
// 210113_5301_1 add -->
#define CSV_161_ITEM_04_NEW			_T("相手先名称（氏名）１")
#define CSV_161_ITEM_05_NEW			_T("相手先名称（氏名）２")
#define CSV_161_ITEM_06_NEW			_T("相手先所在地（住所）１")
#define CSV_161_ITEM_07_NEW			_T("相手先所在地（住所）２")
// 210113_5301_1 add <--
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_161			10		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_161			20		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_161				0

//--------------------------------------------------
// ⑯－２：雑損失等の内訳書
//--------------------------------------------------
#define CSV_162_ITEM_CNT			9
// 項目名
#define CSV_162_ITEM_01				_T("科目")
#define CSV_162_ITEM_02				_T("取引の内容１")
#define CSV_162_ITEM_03				_T("取引の内容２")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_162_ITEM_09				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_162_ITEM_04				_T("相手先１")
#define CSV_162_ITEM_05				_T("相手先２")
#define CSV_162_ITEM_06				_T("所在地（住所）１")
#define CSV_162_ITEM_07				_T("所在地（住所）２")
#define CSV_162_ITEM_08				_T("金額")
// 210113_5301_1 add -->
#define CSV_162_ITEM_04_NEW			_T("相手先名称（氏名）１")
#define CSV_162_ITEM_05_NEW			_T("相手先名称（氏名）２")
#define CSV_162_ITEM_06_NEW			_T("相手先所在地（住所）１")
#define CSV_162_ITEM_07_NEW			_T("相手先所在地（住所）２")
// 210113_5301_1 add <--
// １頁内の合計行を含む全体の行数
#define	ID_ROWNORMAL_162			10		// 通常時：１頁内の合計行を含む全体の行数
#define	ID_ROWKOBETU_162			20		// 個別時：１頁内の合計行を含む全体の行数
//帳表固定の合計行数（1:合計あり，0:なし）
#define	ID_ROWKEI_162				0

// midori 170504 add -->
//--------------------------------------------------
// ⑰－１～⑰－２０：その他科目の内訳書①－１～その他科目の内訳書①－２０
//--------------------------------------------------
#define CSV_171_ITEM_CNT			9
// 項目名
#define CSV_171_ITEM_01				_T("科目")
// 登録番号（法人番号）_23/11/21 add -->
#define CSV_171_ITEM_09				_T("登録番号（法人番号）")
// 登録番号（法人番号）_23/11/21 add <--
#define CSV_171_ITEM_02				_T("名称（氏名）１")
#define CSV_171_ITEM_03				_T("名称（氏名）２")
#define CSV_171_ITEM_04				_T("所在地（住所）１")
#define CSV_171_ITEM_05				_T("所在地（住所）２")
#define CSV_171_ITEM_06				_T("期末現在高")
#define CSV_171_ITEM_07				_T("摘要１")
#define CSV_171_ITEM_08				_T("摘要２")
//--------------------------------------------------
// ⑱－１～⑱－２０：その他科目の内訳書②－１～その他科目の内訳書②－２０
//--------------------------------------------------
#define CSV_181_ITEM_CNT			7
// 項目名
#define CSV_181_ITEM_01				_T("科目")
#define CSV_181_ITEM_04				_T("期末現在高")
#define CSV_181_ITEM_05				_T("摘要１")
#define CSV_181_ITEM_06				_T("摘要２")
// midori 170504 add <--

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Extension Block
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//--------------------------------------------------
// ⑤    ：棚卸資産の内訳書 [下欄]
//--------------------------------------------------
// 識別子
#define CSV_ID_UCHIWAKE				_T("内訳")
// 項目数
#define CSV_052_ITEM_CNT			4
// 項目名
#define CSV_052_ITEM_01				_T("期末棚卸の方法")
#define CSV_052_ITEM_02				_T("登録名称")
#define CSV_052_ITEM_03				_T("棚卸を行った時期")
// 登録名称（Ａ～Ｃ）
#define CSV_052_REGNAME_A			_T("実施棚卸")
#define CSV_052_REGNAME_B			_T("帳簿棚卸")
#define CSV_052_REGNAME_C			_T("ＡとＢとの併用")
// 期末棚卸の方法
#define CSV_052_METHOD_A			_T("Ａ")
#define CSV_052_METHOD_B			_T("Ｂ")
#define CSV_052_METHOD_C			_T("Ｃ")
#define CSV_052_METHOD_D			_T("Ｄ")
// 最大行数
#define CSV_052_ROW_MAX				1

//--------------------------------------------------
// ⑨    ：買掛金の内訳書 [下欄]
//--------------------------------------------------
// 識別子
#define CSV_ID_HAITOKIN				_T("未払配当金")
#define CSV_ID_YAKUINSYOYO			_T("未払役員賞与")
// 項目数
#define CSV_092_ITEM_CNT			3
// 項目名
#define CSV_092_ITEM_01				_T("支払確定年月日")
#define CSV_092_ITEM_02				_T("期末現在高")
// 最大行数
#define CSV_092_ROW_MAX				4

